id: 0051e53e-648c-48a9-ad46-81cfe2381aed
name: Detect CVE Exploits on Network for Vulnerable Devices
description: This rule detects attempts to exploit known CVEs on the network where the targeted device is identified as vulnerable to that specific CVE. It correlates network inspection signatures with vulnerability management data to identify high-confidence exploitation attempts.
query: |-
    # *Detect CVE exploits on network for which a device is vulnerable*

    ## Query Information

    #### MITRE ATT&CK Technique(s)

    | Technique ID | Title    | Link    |
    | ---  | --- | --- |
    | T1203 | Exploitation for Client Execution | https://attack.mitre.org/techniques/T1203/ |
    | T1068 | Exploitation for Privilege Escalation | https://attack.mitre.org/techniques/T1068/ |
    | T1210 | Exploitation of Remote Services | https://attack.mitre.org/techniques/T1210/ |

    #### Description
    This detection query can be used to find specific CVE exploits passing on the wire for which the device is vulnerable. This query should have a very high TP rate, and can be considered as a 'High severity' query.

    #### Risk
    Detection of CVE exploits depends on the CVE detections Microsoft included in the Zeek engine of MDE.

    #### Author <Optional>
    - **Name:** Robbe Van den Daele
    - **Github:** https://github.com/RobbeVandenDaele
    - **Twitter:** https://x.com/RobbeVdDaele
    - **LinkedIn:** https://www.linkedin.com/in/robbe-van-den-daele-677986190/
    - **Website:** https://hybridbrothers.com/

    #### References
    - https://hybridbrothers.com/analyzing-mde-network-inspections/
    ## Defender XDR
    ```KQL
    // Get all the TVM data
    let tvm_data = DeviceTvmSoftwareVulnerabilities
    | distinct DeviceName, SoftwareName, SoftwareVendor, SoftwareVersion, CveId, VulnerabilitySeverityLevel;
    // Get CVE signatures on the network
    DeviceNetworkEvents
    | where ActionType contains "NetworkSignatureInspected"
    | extend AdditionalFields = todynamic(AdditionalFields)
    | extend SignatureName = tostring(AdditionalFields.SignatureName),
        SignatureMatchedContent = tostring(AdditionalFields.SignatureMatchedContent),
        SamplePacketContent = tostring(AdditionalFields.SamplePacketContent)
    | where SignatureName contains "CVE"
    // Join the TVM data of the related device
    | join kind=inner tvm_data on DeviceName
    // Check if the server is vulnerable to the detected CVE in network traffic
    | where SignatureName == CveId
    | project-away DeviceName1
    ```

    ## Sentinel
    ```KQL
    N/A
    ```
query_type: kql
tactics:
    - TA0002
    - TA0004
    - TA0008
techniques:
    - T1203
    - T1068
    - T1210
tags:
    - kql
version: "1"
references:
    - https://hybridbrothers.com/analyzing-mde-network-inspections/
