id: 007735ab-b311-489a-b911-9b6546aef4e4
name: Detecting M365 Copilot Shared Agent
description: 'KQL Query from file: Detecting M365 Copilot Shared Agent'
query: |
    // Detecting M365 Copilot Shared Agent

    CloudAppEvents
    | where Timestamp > ago(1h)
    | where Application == @"Microsoft 365"
    | where ActionType in ("BotCreate", "BotUpdateOperation-BotPublish")
query_type: kql
tactics:
    - TA0003
    - TA0005
techniques:
    - T1137
    - T1562.008
tags:
    - kql
version: "1"
