id: 0199c633-75ac-7017-8cdf-4ea26b41a66f
name: Detect Suspicious Browser Extension Activity
description: Detects potential unauthorized browser extension installations or debugging activities by monitoring process and network events related to popular web browsers.
query: "DeviceProcessEvents\r\n| where FileName in~ (\"chrome.exe\", \"msedge.exe\", \"brave.exe\", \"opera.exe\")\r\nand ProcessCommandLine contains \"--remote\"\r\n\r\n\r\nDeviceNetworkEvents\r\n| where RemotePort in (9222, 9223, 9229)\r\n| where RemoteIP == \"127.0.0.1\"\r\n| where InitiatingProcessFileName !in~ (\"chrome.exe\", \"msedge.exe\", \"brave.exe\", \"opera.exe\")\r\n"
query_type: kql
severity: medium
tactics:
    - TA0003
techniques:
    - T1176.001
tags:
    - kql
version: "2"
