id: 01999b3b-4c60-7617-9cb4-d411f4df44ad
name: Notepad++ DLL Hijacking Detection
description: A DefenderXDR Custom Detection for CVE-2025-56383
query: "DeviceImageLoadEvents\r\n| where TimeGenerated > ago(1h)\r\n| where ActionType == \"ImageLoaded\"\r\n| where FileName endswith \".dll\" or FileName endswith \".DLL\"\r\n| where FolderPath has \"notepad++\"\r\n| invoke FileProfile(\"SHA1\",1000)\r\n| where GlobalPrevalence < 10"
query_type: kql
severity: medium
tactics:
    - TA0003
    - TA0004
    - TA0005
techniques:
    - T1574.001
tags:
    - kql
author: Steven Lim
version: "2"
references:
    - https://cybersecuritynews.com/notepad-hijacking-vulnerability/
