id: 0199f162-cdb9-70eb-a1c7-9532e0d14fb1
name: Oyster Malware Scheduled Task 'CaptureService' Creation
description: Detects the creation of a suspicious scheduled task named "CaptureService" that is set to run every 11 minutes. This specific combination of task name, frequency, and executable (rundll32.exe) is indicative of a known persistence technique.
query: "SecurityEvent\r\n| where NewProcessName matches regex \"(?i:schtasks\\\\.exe)\"\r\n| where EventID == 4688\r\n    and CommandLine contains '/Create'\r\n    and CommandLine contains '/SC MINUTE'\r\n    and CommandLine contains '/MO 11'\r\n    and CommandLine contains '/TN \"CaptureService\"'\r\n    and CommandLine contains '/TR \"C:\\\\WINDOWS\\\\System32\\\\rundll32.exe'"
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0003
    - TA0004
techniques:
    - T1053.005
tags:
    - kql
author: Sotirios Mavrakis
version: "1"
references:
    - https://www.thaicert.or.th/en/2025/09/29/hackers-spread-oyster-malware-through-fake-microsoft-teams-installer/
    - https://www.catonetworks.com/blog/cato-ctrl-oyster-malware-campaign/
