id: 0199f04a-c275-712d-9cce-6d589cff8bd5
name: Oyster Malware Scheduled Task 'CaptureService' Creation
description: Detects the creation of a suspicious scheduled task named "CaptureService" that is set to run every 11 minutes. This specific combination of task name, frequency, and executable (rundll32.exe) is indicative of a known persistence technique.
query: |
    DeviceProcessEvents
    | where FolderPath endswith '\\schtasks.exe'
    | where ProcessCommandLine has '/Create'
        and ProcessCommandLine has '/SC MINUTE'
        and ProcessCommandLine has '/MO 11'
        and ProcessCommandLine has '/TN "CaptureService"'
        and ProcessCommandLine has '/TR "C:\\WINDOWS\\System32\\rundll32.exe'
query_type: kql
severity: medium
tactics:
    - TA0003
    - TA0002
    - TA0004
    - TA0005
techniques:
    - T1053.005
    - T1218.011
tags:
    - kql
author: Kaung Khant Ko
version: "6"
references:
    - https://malasada.tech/oyster-malware-delivery-via-teams-fake-app/
