id: 0199c7ef-3648-752c-ad19-5d9c55702ad4
name: WScript/CScript Executing JavaScript from User Profile
description: |-
    RedCanary recommends to create a Policy wich opens js files in Notepad (https://redcanary.com/blog/threat-intelligence/notepad-javascript/) to prevent the execution of malicious payloads.
    This Query detects instances where 'wscript.exe' or 'cscript.exe' are initiated by 'openwith.exe' or 'explorer.exe' and execute a JavaScript file (.js) located within a user's profile directory. This behavior can indicate an attempt to execute malicious scripts, often delivered via user interaction (e.g., opening a malicious file).
query: "DeviceProcessEvents\r\n| where InitiatingProcessFileName in (\"openwith.exe\", \"explorer.exe\")\r\n| where FileName in ('wscript.exe','cscript.exe')\r\n| where ProcessCommandLine contains @\"c:\\Users\\\" and ProcessCommandLine contains \".js\""
query_type: kql
severity: medium
tactics:
    - TA0002
techniques:
    - T1059.007
    - T1204.002
tags:
    - kql
author: Benjamin Zulliger
version: "2"
references:
    - https://redcanary.com/blog/threat-intelligence/notepad-javascript/
