id: 0199b9d4-3514-740b-83f7-d4292aa635d7
name: RMM Tool Usage Summary warnign query is heavy as F***
description: This rule identifies and summarizes the usage of various Remote Monitoring and Management (RMM) tools across an environment. It correlates process execution events (based on executable and process names) and network connection events (based on remote URLs/domains) with a predefined list of known RMM tools. The output provides a count of unique devices using each RMM tool, grouped by machine group, allowing for an overview of RMM tool prevalence and distribution.
query: "  let RMMIOCs = externaldata(\r\n    ToolName:string,\r\n    ExecutableName:string,\r\n    ProcessName:string,\r\n    Domain:string\r\n)\r\n[\r\n    \"https://raw.githubusercontent.com/VlogicK/HuntAndDetect/refs/heads/main/Queries/Command%20and%20Control/Enhanced_RMM_Tools_List_With_Domains.csv\"\r\n]\r\nwith (format=\"csv\", ignoreFirstRecord=true);\r\n// Build distinct lists for matching\r\nlet RMMProcNames = RMMIOCs | where isnotempty(ProcessName) | distinct ProcessName;\r\nlet RMMExeNames  = RMMIOCs | where isnotempty(ExecutableName) | distinct ExecutableName;\r\nlet RMMDomains   = RMMIOCs | where isnotempty(Domain) | distinct Domain;\r\n// Helper: normalize a FileName or ProcessName to ToolName\r\nlet MapToToolByProcess = (name:string) {\r\n    case(\r\n        name has \"TeamViewer.exe\" or name has \"TeamViewer\", \"TeamViewer\",\r\n        name has \"AnyDesk.exe\" or name has \"AnyDesk\", \"AnyDesk\",\r\n        name has \"ScreenConnect.Client.exe\" or name has \"ScreenConnect.Client\", \"ConnectWise Control (ScreenConnect)\",\r\n        name has \"LogMeIn.exe\" or name has \"LogMeIn\", \"LogMeIn\",\r\n        name has \"SRManager.exe\" or name has \"SRManager\", \"Splashtop\",\r\n        name has \"SplashtopRemoteService.exe\" or name has \"SplashtopRemoteService\", \"Splashtop\",\r\n        name has \"g2comm.exe\" or name has \"g2comm\" or name has \"g2tray.exe\" or name has \"g2tray\", \"GoToMyPC\",\r\n        name has \"winvnc.exe\" or name has \"winvnc\", \"UltraVNC\",\r\n        name has \"DWRCS.exe\" or name has \"DWRCS\" or name has \"DWRCSMS.exe\" or name has \"DWRCSMS\", \"DameWare\",\r\n        name has \"rfusclient.exe\" or name has \"rfusclient\" or name has \"rutserv.exe\" or name has \"rutserv\", \"Remote Utilities\",\r\n        name has \"ZohoAssistService.exe\" or name has \"ZohoAssistService\", \"Zoho Assist\",\r\n        name has \"KaUsrTsk.exe\" or name has \"KaUsrTsk\" or name has \"AgentMon.exe\" or name has \"AgentMon\", \"Kaseya Agent\",\r\n        name has \"AteraAgent.exe\" or name has \"AteraAgent\", \"Atera Agent\",\r\n        name has \"pulsewayagent.exe\" or name has \"pulsewayagent\", \"Pulseway\",\r\n        name has \"NinjaRMMAgent.exe\" or name has \"NinjaRMMAgent\", \"NinjaOne (NinjaRMM)\",\r\n        name has \"ncentralagent.exe\" or name has \"ncentralagent\", \"SolarWinds N-central\",\r\n        name has \"MWAgent.exe\" or name has \"MWAgent\", \"Barracuda RMM (Managed Workplace)\",\r\n        name has \"ITSMService.exe\" or name has \"ITSMService\", \"ITarian (Comodo RMM)\",\r\n        name has \"CloudBerryRemoteAssistant.exe\" or name has \"CloudBerryRemoteAssistant\", \"MSP360\",\r\n        name has \"DomotzAgent.exe\" or name has \"DomotzAgent\", \"Domotz\",\r\n        name has \"rasagent.exe\" or name has \"rasagent\", \"Parallels RAS\",\r\n        name has \"client32.exe\" or name has \"client32\" or name has \"pciclient.exe\" or name has \"pciclient\", \"NetSupport Manager\",\r\n        name has \"vncserver.exe\" or name has \"vncserver\" or name has \"vncviewer.exe\" or name has \"vncviewer\", \"VNC Connect (RealVNC)\",\r\n        name has \"tvnviewer.exe\" or name has \"tvnviewer\" or name has \"tvnserver.exe\" or name has \"tvnserver\", \"TightVNC\",\r\n        name has \"AA_v3.exe\" or name has \"AA_v3\", \"Ammyy Admin\",\r\n        name has \"rpclient.exe\" or name has \"rpclient\", \"RemotePC\",\r\n        name has \"dwagent.exe\" or name has \"dwagent\", \"DWService\",\r\n        name has \"isl_light_client.exe\" or name has \"isl_light_client\", \"ISL Light\",\r\n        name has \"RemoteDesktopManager.exe\" or name has \"RemoteDesktopManager\", \"RemoteDesktopManager\",\r\n        name has \"Bomgar-scc.exe\" or name has \"Bomgar-scc\" or name has \"bomgar-rep.exe\" or name has \"bomgar-rep\", \"BeyondTrust (Bomgar)\",\r\n        name has \"AweSun.exe\" or name has \"AweSun\", \"AweSun\",\r\n        name has \"wtserver.exe\" or name has \"wtserver\", \"TSplus\",\r\n        name has \"Action1Agent.exe\" or name has \"Action1Agent\", \"Action1\",\r\n        name has \"Addigy\" or name has \"Addigy.app\", \"Addigy\",\r\n        name has \"AeroAdmin.exe\" or name has \"AeroAdmin\", \"AeroAdmin\",\r\n        name has \"Alpemix.exe\" or name has \"Alpemix\", \"Alpemix\",\r\n        name has \"apc_admin.exe\" or name has \"apc_admin\", \"Anyplace Control\",\r\n        name has \"AnyViewer.exe\" or name has \"AnyViewer\", \"AnyViewer\",\r\n        name has \"Auvik\" or name has \"AuvikAgentService.exe\", \"Auvik\",\r\n        name has \"BYS.exe\" or name has \"BYS\", \"BeamYourScreen\",\r\n        name has \"BASupSrvc.exe\" or name has \"BASupSrvc\", \"BeAnywhere\",\r\n        name has \"remoting_host.exe\" or name has \"remoting_host\", \"Chrome Remote Desktop\",\r\n        name has \"CrossLoopConnect.exe\" or name has \"CrossLoopConnect\", \"CrossLoop\",\r\n        name has \"CrossTecRemote.exe\" or name has \"CrossTecRemote\", \"CrossTec\",\r\n        name has \"CagService.exe\" or name has \"CagService\", \"Datto RMM\",\r\n        name has \"DesktopNow.exe\" or name has \"DesktopNow\", \"DesktopNow\",\r\n        name has \"DistantDesktop.exe\" or name has \"DistantDesktop\", \"Distant Desktop\",\r\n        name has \"ehorusclientctl.exe\" or name has \"ehorusclientctl\", \"EHorus\",\r\n        name has \"NotAvailableDummyValueVlogicK\" and name !~ \"\", \"Unknown/Unmapped\",\r\n        name has \"fleetdeck_agent_svc\", \"FleetDeck\",\r\n        name has \"getscreen.exe\", \"GetScreen\",\r\n        name has \"IperiusRemote.exe\" or name has \"IperiusRemote\", \"Iperius Remote\",\r\n        name has \"JumpCloud.exe\" or name has \"JumpCloud\", \"JumpCloud\",\r\n        name has \"server.exe\" or name has \"server\", \"LiteManager\",\r\n        name has \"MeshAgent.exe\" or name has \"MeshAgent\", \"MeshCentral\",\r\n        name has \"mRemoteNG.exe\" or name has \"mRemoteNG\", \"mRemoteNG\",\r\n        name has \"naveriskagent.exe\" or name has \"naveriskagent\", \"Naverisk\",\r\n        name has \"OptiTuneAgent.exe\" or name has \"OptiTuneAgent\", \"OptiTune\",\r\n        name has \"Panorama9.exe\" or name has \"Panorama9\", \"Panorama9\",\r\n        name has \"parsecd.exe\" or name has \"parsecd\", \"Parsec\",\r\n        name startswith \"pcvisit_\" or name has \"pcvisit\", \"PCVisit\",\r\n        name has \"PDQInventory.exe\" or name has \"PDQInventory\", \"PDQ Inventory\",\r\n        name has \"rserver3.exe\" or name has \"rserver3\", \"Radmin\",\r\n        name has \"rustdesk.exe\" or name has \"rustdesk\", \"RustDesk\",\r\n        name has \"ScreenMeetSupport.app\" or name has \"ScreenMeetSupport.exe\", \"ScreenMeet\",\r\n        name has \"ServerEye\" or name has \"ServerEye.Client.exe\", \"ServerEye\",\r\n        name has \"wShowMyPC.exe\" or name has \"wShowMyPC\", \"ShowMyPC\",\r\n        name has \"simplehelp.exe\" or name has \"simplehelp\", \"SimpleHelp\",\r\n        name has \"Supremo.exe\" or name has \"Supremo\", \"SupRemo\",\r\n        name has \"Syncro.exe\" or name has \"Syncro\", \"SyncroMSP\",\r\n        name has \"SyspectrAgent.exe\" or name has \"SyspectrAgent\", \"Syspectr\",\r\n        name has \"TacticalAgent.exe\" or name has \"TacticalAgent\", \"TacticalRMM\",\r\n        name has \"techinline.exe\" or name has \"techinline\", \"TechInline\",\r\n        name has \"winvnc4.exe\" or name has \"winvnc4\", \"TigerVNC\",\r\n        name has \"UltraViewer.exe\" or name has \"UltraViewer\", \"UltraViewer\",\r\n        name has \"XMReality\" or name has \"XMReality.exe\", \"XMReality\",\r\n        \"Unknown/Unmapped\"\r\n    )\r\n};\r\n// Helper: normalize a RemoteUrl/Domain to ToolName\r\nlet MapToToolByDomain = (url:string) {\r\n    case(\r\n        url has \"teamviewer.com\", \"TeamViewer\",\r\n        url has \"anydesk.com\", \"AnyDesk\",\r\n        url has \"screenconnect.com\", \"ConnectWise Control (ScreenConnect)\",\r\n        url has \"logmein.com\", \"LogMeIn\",\r\n        url has \"splashtop.com\", \"Splashtop\",\r\n        url has \"gotomypc.com\", \"GoToMyPC\",\r\n        url has \"uvnc.com\", \"UltraVNC\",\r\n        url has \"solarwinds.com\", \"DameWare\",\r\n        url has \"remoteutilities.com\", \"Remote Utilities\",\r\n        url has \"zoho.com\", \"Zoho Assist\",\r\n        url has \"kaseya.net\", \"Kaseya Agent\",\r\n        url has \"atera.com\", \"Atera Agent\",\r\n        url has \"pulseway.com\", \"Pulseway\",\r\n        url has \"ninjarmm.com\", \"NinjaOne (NinjaRMM)\",\r\n        url has \"n-able.com\", \"SolarWinds N-central\",\r\n        url has \"barracuda.com\", \"Barracuda RMM (Managed Workplace)\",\r\n        url has \"itarian.com\", \"ITarian (Comodo RMM)\",\r\n        url has \"msp360.com\", \"MSP360\",\r\n        url has \"domotz.com\", \"Domotz\",\r\n        url has \"parallels.com\", \"Parallels RAS\",\r\n        url has \"netsupportsoftware.com\", \"NetSupport Manager\",\r\n        url has \"realvnc.com\", \"VNC Connect (RealVNC)\",\r\n        url has \"tightvnc.com\", \"TightVNC\",\r\n        url has \"ammyy.com\", \"Ammyy Admin\",\r\n        url has \"remotepc.com\", \"RemotePC\",\r\n        url has \"dwservice.net\", \"DWService\",\r\n        url has \"islonline.com\", \"ISL Light\",\r\n        url has \"devolutions.net\", \"RemoteDesktopManager\",\r\n        url has \"bomgar.com\", \"BeyondTrust (Bomgar)\",\r\n        url has \"aweray.com\", \"AweSun\",\r\n        url has \"tsplus.net\", \"TSplus\",\r\n        url has \"action1.com\", \"Action1\",\r\n        url has \"addigy.com\", \"Addigy\",\r\n        url has \"aeroadmin.com\", \"AeroAdmin\",\r\n        url has \"alpemix.com\", \"Alpemix\",\r\n        url has \"anyplace-control.com\", \"Anyplace Control\",\r\n        url has \"anyviewer.com\", \"AnyViewer\",\r\n        url has \"auvik.com\", \"Auvik\",\r\n        url has \"beamyourscreen.com\", \"BeamYourScreen\",\r\n        url has \"beanywhere.com\", \"BeAnywhere\",\r\n        url has \"remotedesktop.google.com\", \"Chrome Remote Desktop\",\r\n        url has \"crossloop.com\", \"CrossLoop\",\r\n        url has \"crosstecsoftware.com\", \"CrossTec\",\r\n        url has \"dattobackup.com\", \"Datto RMM\",\r\n        url has \"nchsoftware.com\", \"DesktopNow\",\r\n        url has \"distantdesktop.com\", \"Distant Desktop\",\r\n        url has \"ehorus.com\", \"EHorus\",\r\n        url has \"electric.ai\", \"ElectricAI\",\r\n        url has \"fleetdeck.io\", \"FleetDeck\",\r\n        url has \"getscreen.me\", \"GetScreen\",\r\n        url has \"iperiusremote.com\", \"Iperius Remote\",\r\n        url has \"jumpcloud.com\", \"JumpCloud\",\r\n        url has \"litemanager.com\", \"LiteManager\",\r\n        url has \"meshcentral.com\", \"MeshCentral\",\r\n        url has \"mremoteng.org\", \"mRemoteNG\",\r\n        url has \"naverisk.com\", \"Naverisk\",\r\n        url has \"optitune.com\", \"OptiTune\",\r\n        url has \"panorama9.com\", \"Panorama9\",\r\n        url has \"parsec.app\", \"Parsec\",\r\n        url has \"pcvisit.com\", \"PCVisit\",\r\n        url has \"pdq.com\", \"PDQ Inventory\",\r\n        url has \"radmin.com\", \"Radmin\",\r\n        url has \"rport.io\", \"Rport\",\r\n        url has \"rustdesk.com\", \"RustDesk\",\r\n        url has \"screenmeet.com\", \"ScreenMeet\",\r\n        url has \"servereye.de\", \"ServerEye\",\r\n        url has \"showmypc.com\", \"ShowMyPC\",\r\n        url has \"simple-help.com\", \"SimpleHelp\",\r\n        url has \"supremocontrol.com\", \"SupRemo\",\r\n        url has \"syncromsp.com\", \"SyncroMSP\",\r\n        url has \"syspectr.com\", \"Syspectr\",\r\n        url has \"tacticalrmm.com\", \"TacticalRMM\",\r\n        url has \"techinline.net\", \"TechInline\",\r\n        url has \"tigervnc.org\", \"TigerVNC\",\r\n        url has \"ultraviewer.net\", \"UltraViewer\",\r\n        url has \"xmreality.com\", \"XMReality\",\r\n        \"Unknown/Unmapped\"\r\n    )\r\n};\r\n// Process events: match by FileName or ProcessName and map to ToolName\r\nlet processEventsQuery =\r\n    DeviceProcessEvents\r\n    | where isnotempty(FileName)\r\n        and (FileName has_any (RMMExeNames) or InitiatingProcessFileName has_any (RMMExeNames) or\r\n             FileName has_any (RMMProcNames) or InitiatingProcessFileName has_any (RMMProcNames))\r\n    | extend RawMatch = iff(FileName in~ (RMMExeNames) or FileName in~ (RMMProcNames), FileName,\r\n                       iff(InitiatingProcessFileName in~ (RMMExeNames) or InitiatingProcessFileName in~ (RMMProcNames), InitiatingProcessFileName, FileName))\r\n    | extend ToolName = MapToToolByProcess(RawMatch)\r\n    | extend eventtype = \"ProcessEvent\";\r\n// Network events: match by RemoteUrl domain list and map to ToolName\r\nlet networkEventsQuery =\r\n    DeviceNetworkEvents\r\n    | where isnotempty(RemoteUrl)\r\n        and RemoteUrl has_any (RMMDomains)\r\n    | extend ToolName = MapToToolByDomain(RemoteUrl)\r\n    | extend eventtype = \"NetworkEvent\";\r\n// Union, enrich with DeviceInfo, and summarize\r\nunion processEventsQuery, networkEventsQuery\r\n| join kind=leftouter (DeviceInfo | project DeviceId, MachineGroup) on DeviceId\r\n| summarize dcount(DeviceId) by MachineGroup, ToolName\r\n| order by dcount_DeviceId desc, MachineGroup asc, ToolName asc\r\n"
query_type: kql
severity: medium
tactics:
    - TA0011
    - TA0002
    - TA0008
techniques:
    - T1219
    - T1219.002
    - T1072
tags:
    - kql
version: "2"
references:
    - https://raw.githubusercontent.com/VlogicK/HuntAndDetect/refs/heads/main/Queries/Command%20and%20Control/Enhanced_RMM_Tools_List_With_Domains.csv
