id: 0199c30f-7bb4-762f-a91a-23bfea99d889
name: Potential Browser Data Stealing
description: Detects access to sensitive browser files by non-browser processes. This can indicate attempts by malware to steal credentials, cookies or other sensitive user data.
query: "DeviceFileEvents \r\n| where ((((FolderPath contains @'\\Google\\Chrome\\User Data\\' or FolderPath contains @'\\Microsoft\\Edge\\User Data\\' or \r\nFolderPath contains @'\\BraveSoftware\\Brave-Browser\\User Data\\' or FolderPath contains @'\\Vivaldi\\User Data\\' or FolderPath contains @'\\Opera Software\\Opera') \r\nand (FolderPath endswith @'\\Login Data' or FolderPath endswith @'\\Cookies' or FolderPath endswith @'\\Web Data' or FolderPath endswith @'\\History')) or \r\n(FolderPath contains @'\\Mozilla\\Firefox\\Profiles\\' and (FolderPath endswith @'\\logins.json' or FolderPath endswith @'\\key4.db' or FolderPath endswith @'\\key3.db' or\r\n FolderPath endswith @'\\cookies.sqlite' or FolderPath endswith @'\\places.sqlite'))) and not ((InitiatingProcessFolderPath endswith @'\\chrome.exe' \r\n or InitiatingProcessFolderPath endswith @'\\firefox.exe' or InitiatingProcessFolderPath endswith @'\\msedge.exe' or InitiatingProcessFolderPath endswith @'\\brave.exe' or\r\n  InitiatingProcessFolderPath endswith @'\\opera.exe' or InitiatingProcessFolderPath endswith @'\\vivaldi.exe' or InitiatingProcessFolderPath endswith @'\\updater.exe' or \r\n  InitiatingProcessFolderPath endswith @'\\msedgewebview2.exe')))"
query_type: kql
severity: medium
tactics:
    - TA0006
techniques:
    - T1555.003
tags:
    - kql
author: Kaung Khant Ko
version: "2"
references:
    - https://attack.mitre.org/techniques/T1555/003/
