id: 0199c10b-4938-761c-bae4-2855a20f1a1e
name: Logon Activity from Threat Intelligence Identified IP
description: This rule detects successful or failed logon attempts originating from IP addresses identified by threat intelligence as associated with botnets, command and control (C2) infrastructure, or proxies. The rule specifically looks for 'LogOn' or 'FailedLogOn' activity types where the source IP's threat intelligence indicator type is 'Botnet', 'C2', or 'Proxy', and where activity insights are available.
query: "BehaviorAnalytics\r\n| where ActivityType =~ 'LogOn' or ActivityType =~ 'FailedLogOn'\r\n| where DevicesInsights.ThreatIntelIndicatorType =~ 'Botnet' \r\n    or DevicesInsights.ThreatIntelIndicatorType =~ 'C2' \r\n    or DevicesInsights.ThreatIntelIndicatorType =~ 'Proxy'\r\n| where ActivityInsights contains 'True'\r\n| extend AadUserId = UsersInsights.AccountObjectID\r\n| extend Account_0_AadUserId = AadUserId"
query_type: kql
severity: medium
tactics:
    - TA0042
    - TA0011
techniques:
    - T1584.005
    - T1583.005
    - T1090
    - T1090.001
    - T1090.002
    - DS0028
tags:
    - kql
version: "1"
