id: 0199c635-fca3-735d-9867-8a55ec46db09
name: Browser Extension Persistence via Command Line or Registry
description: This rule detects potential persistence mechanisms related to browser extensions. It looks for processes launching Chrome or Edge with the '--load-extension' command-line argument, which can be used to load unpacked extensions. Additionally, it monitors registry modifications to 'ExtensionInstallForcelist' that contain 'http' or 'crx', indicating a forced installation of an extension, potentially from a remote source or a local file.
query: "DeviceProcessEvents\r\n| where ProcessCommandLine has \"--load-extension\"\r\n| where FileName in~ (\"chrome.exe\", \"msedge.exe\")\r\n\r\n\r\n\r\nDeviceRegistryEvents\r\n| where RegistryKey has \"ExtensionInstallForcelist\"\r\n| where RegistryValueData has_any (\"http\", \"crx\")\r\n"
query_type: kql
severity: medium
tactics:
    - TA0003
    - TA0004
techniques:
    - T1176.001
    - T1547.001
tags:
    - kql
version: "2"
