id: 0199c636-be2a-7028-a12e-3371a239f2db
name: Suspicious Process Spawned by Browser
description: Detects when a web browser (Chrome, Edge, Firefox, Brave, Opera) initiates a process that is not another instance of itself. This could indicate a drive-by download, execution of malicious code, or other suspicious activity originating from a browser.
query: "DeviceProcessEvents\r\n| where InitiatingProcessFileName in~ (\"chrome.exe\", \"msedge.exe\", \"firefox.exe\", “brave.exe”, “opera.exe”)\r\n| where FileName !in~ (\"chrome.exe\", \"msedge.exe\", \"firefox.exe\") \r\n"
query_type: kql
severity: medium
tactics:
    - TA0001
    - TA0002
techniques:
    - T1189
    - T1204
    - T1204.001
tags:
    - kql
version: "1"
