id: 0199d9bf-80b2-74bf-9b26-41529bb25e09
name: 7-Zip CVE-2025-11002 Detection
description: 'KQL Query from file: 7-Zip CVE-2025-11002 Detection'
query: "DeviceFileEvents\r\n| where Timestamp > ago(1h)\r\n| where ActionType == \"FileCreated\"\r\n| where InitiatingProcessVersionInfoOriginalFileName has \"7z.exe\"\r\n| where InitiatingProcessVersionInfoProductVersion !startswith \"25.\"\r\n| where FolderPath has \"\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\""
query_type: kql
severity: medium
tactics:
    - TA0003
    - TA0004
techniques:
    - T1547.001
tags:
    - kql
author: Steven Lim
version: "2"
