id: 0199bb1d-67ad-7199-8448-46b73945089c
name: Guest Account Activated
description: "This KQL query detects the activation or modification of Guest accounts or Guest group memberships, which may indicate unauthorized access attempts or privilege escalation. \n\nAnalysts should review the initiating user (SubjectUserName) and process context. Confirm whether the Guest account is expected to be active on the system. Investigate the host for signs of lateral movement or privilege abuse. Correlate with logon events and group membership changes. Escalate if Guest account activation is unexpected or unauthorized.\n\n"
query: "SecurityEvent\r\n| where EventID in (4722, 4724, 4738)\r\n//-501 == Local Guest, -514 == Domain Guests, -546 == Built-in Guests\r\n| where TargetSid has '-501' or TargetSid has '-514' or TargetSid has \"S-1-5-32-546\""
query_type: kql
severity: medium
techniques:
    - T1078.001
    - T1098
    - T1136
tags:
    - kql
author: Rory Wagner
version: "4"
references:
    - https://www.trendmicro.com/en_gb/research/25/h/warlock-ransomware.html
