id: 019970d1-e7eb-7329-8a51-9cce886865de
name: NPM compromised packages Shai hulud
description: Look for hashes in the environment
query: "let hashes=externaldata(PackageName:string, Version:string, SHA1:string)\r\n['https://raw.githubusercontent.com/SlimKQL/Hunting-Queries-Detection-Rules/refs/heads/main/IOC/Shai-hulud.csv']\r\nwith (format='csv', ignoreFirstRecord=true) | project SHA1;\r\nunion isfuzzy=true\r\n(BehaviorEntities\r\n| where SHA1 in (hashes)\r\n),\r\n(DeviceEvents\r\n| where SHA1 in (hashes) or InitiatingProcessSHA1 in (hashes)\r\n),\r\n(DeviceFileEvents\r\n| where SHA1 in (hashes) or InitiatingProcessSHA1 in (hashes)\r\n),\r\n(DeviceImageLoadEvents\r\n| where SHA1 in (hashes) or InitiatingProcessSHA1 in (hashes)\r\n),\r\n(DeviceLogonEvents\r\n| where InitiatingProcessSHA1 in (hashes)\r\n),\r\n(DeviceNetworkEvents\r\n| where InitiatingProcessSHA1 in (hashes)\r\n),\r\n(DeviceProcessEvents\r\n| where SHA1 in (hashes) or InitiatingProcessSHA1 in (hashes)\r\n),\r\n(DeviceRegistryEvents\r\n| where InitiatingProcessSHA1 in (hashes)\r\n)\r\n"
query_type: kql
severity: medium
tags:
    - kql
version: "1"
