id: 01997248-c1e6-7021-ba07-7eded02e7142
name: '[IC] - Identifying methods used to establish secure communication over insecure channels'
description: |-
    In this case, I have been researching about the 'curve' value into AdditionalFields field of DeviceNetworkEvents table which I identified into iana.org as two groups 'Elliptic curve' and 'Diffie-Hellman groups'.

    These 2 kinds of encryption groups work to secure communication over an insecure channel, are classified by Internet Assigned Numbers Authority (IANA), as if are 'recommended' and the Datagram Transport Layer Security status. In addition, to take into account, the mentioned site mention: "If an item is not marked as 'Recommended', it does not necessarily mean that it is flawed; rather, it indicates that the item either has not been through the IETF consensus process, has limited applicability, or is intended only for specific use cases"

    Therefore, this KQL Query is oriented to identify if the current encryption to secure your communications is enough or if due to the level of sensitive of your information, would need to be reviewed.
query: |-
    let Courve_Source = externaldata(Value:int,Description:string,DTLSOK:string,Recommended:string,Reference:string)
    [@"https://www.iana.org/assignments/tls-parameters/tls-parameters-8.csv"] with (format="csv");
    DeviceNetworkEvents
    | extend AdditionalFieldsJson = parse_json(AdditionalFields)
    | extend curve = tostring(AdditionalFieldsJson.curve),
            server_name = tostring(AdditionalFieldsJson.server_name)
    | extend RemoteIPCountry = tostring(geo_info_from_ip_address(RemoteIP).country)
    | join kind=inner (Courve_Source) on $left.curve == $right.Description
    // listing non-recommended curve versions or communications where the Datagram Transport Layer Security (DTLS) is not OK
    | where DTLSOK has "N" or Recommended has "N"
    // adding DeviceInfo table to show Device OS info
    | lookup kind=inner ( DeviceInfo) on $left.DeviceName == $right.DeviceName
    | summarize Totalconnections=count() by RemoteIP , RemoteIPCountry, OSDistribution, OSPlatform,OSVersion, ClientVersion, OSBuild, OSArchitecture,DeviceName, LocalIP,ActionType, RemotePort, Protocol, server_name,curve,DTLSOK, Recommended
    | order by Totalconnections
query_type: kql
severity: medium
tactics:
    - TA0011
    - TA0005
techniques:
    - T1573.002
    - T1600
    - T1600.001
tags:
    - kql
author: Sergio Albea
version: "2"
references:
    - https://medium.com/detect-fyi/use-kql-to-surface-non-recommended-tls-parameters-iana-based-642ec8aec633
    - https://www.iana.org/assignments/tls-parameters/tls-parameters-8.csv
