id: 0199c645-6c02-767d-a8cb-9fa1bdc5641c
name: Chaos Ransomware Hash Detection
description: This rule detects the presence of known Chaos ransomware samples by matching their SHA256 hashes against process execution events and file events. If a process with a matching hash is executed or a file with a matching hash is observed, an alert will be triggered.
query: "let ioc_hashes = dynamic([\r\n    \"19f5999948a4dcc9b5956e797d1194f9498b214479d2a6da8cb8d5a1c0ce3267\",\r\n    \"f200ea7ccc5c9b0eaada74046551ed18a3a9d11c9e87999b25e6b8ee55857359\",\r\n    \"f4b5b1166c1267fc5a565a861295a20cf357c17d75418f40b4f14b094409d431\",\r\n    \"9521a154b06743fcb3a24b6b61ae0b4cbd1f1ba74d3d9cd9110042082d0b1d5c\",\r\n    \"5d3fcf6532c9ee5778753c3f13e71d1e3b157b49e56133bdff5d04d6e6d6c8be\",\r\n    \"fe717bab60f1b03012b1e6287e3f3725f1ad5163897041b824024aedabb7c46d\",\r\n    \"76fde847037ca79c8e897fac9d80567efc4ec3a193ec3d8ae9c9fcd9e1ac4939\",\r\n    \"bbf9ebbfd93306108299e54ecbfb59bb9433eeb34f89cef61864f4e87640eaf0\"\r\n]);\r\nunion DeviceProcessEvents, DeviceFileEvents\r\n| where SHA256 in (ioc_hashes)\r\n"
query_type: kql
severity: medium
tactics:
    - TA0040
techniques:
    - T1486
tags:
    - kql
version: "1"
