id: 0199f044-f942-71f3-b3ca-e5353e6fe10b
name: Oyster Delivery via Teams FakeApp and Script Download Detection
description: 'Detects the Oyster delivery via Teams FakeApp by identifying specific HTTP request patterns, including OPTIONS/POST to /create/link and GET to /gov/ paths and '
query: "CommonSecurityLog \r\n| where ((((http.url contains @'/create/link' and http.request.headers.Content_Type =~ @'application/json') and (http.method =~ @'OPTIONS' or (http.method =~ @'POST' and http.request.headers.Content_Encoding =~ @'msteams'))) or (http.method =~ @'GET' and (http.url matches regex @'(?i)^/gov/[A-Za-z0-9+/=]+$'))) or (http.method =~ @'GET' and (http.url matches regex @'(?i)download-script[0-9]{0,4}\\.js$') and http.request.headers.Referer startswith @'https://teams-'))"
query_type: kql
severity: medium
tags:
    - kql
version: "2"
references:
    - https://malasada.tech/oyster-malware-delivery-via-teams-fake-app/
