id: 0199f0ea-210b-72dd-aada-460c87d1053f
name: 'Hunting MSIX Malware: Combining Splunk Insights with DefenderXDR Precision'
description: KQL Query
query: "DeviceFileEvents\r\n| where Timestamp > ago(1h)\r\n| where ActionType == \"FileCreated\"\r\n| where FileName endswith \".msix\"\r\n| where InitiatingProcessVersionInfoCompanyName != \"Microsoft Corporation\"\r\n| invoke FileProfile(\"SHA1\",1000)\r\n| where isnotempty(GlobalPrevalence)\r\n| where GlobalPrevalence < 100\r\n| where SignatureState == \"Unsigned\""
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0001
techniques:
    - T1204.002
    - T1566.001
tags:
    - kql
version: "2"
references:
    - https://www.splunk.com/en_us/blog/security/msix-weaponization-threat-detection-splunk.html
