id: 0199dcf4-38b4-72bb-8225-778a4dd8798a
name: Quick Assist Network Connection to Microsoft Relay Server
description: Detects network connections initiated by Microsoft Quick Assist (QuickAssist.exe) to its official relay server. This activity is expected for legitimate Quick Assist usage, but monitoring it can help identify unauthorized remote access or potential abuse of the tool.
query: "DeviceNetworkEvents\r\n| where InitiatingProcessCommandLine contains  \"QuickAssist.exe\"\r\n| where RemoteUrl == \"https://hub.relay.support.services.microsoft.com\""
query_type: kql
severity: medium
tactics:
    - TA0011
techniques:
    - T1219
tags:
    - kql
author: Benjamin Zulliger
version: "2"
