id: 0199ee29-26df-7488-a785-a2b90c0ef359
name: Obfuscated ClickFix Powershell Command
description: This rule detects instances where 'powershell.exe', 'pwsh.exe', or 'conhost.exe' are launched by 'explorer.exe' with a command line containing an unusual number of spaces or tabs. This pattern can indicate obfuscation attempts often used by adversaries to hide malicious commands or scripts.
query: "DeviceProcessEvents\r\n| where InitiatingProcessFileName =~ \"explorer.exe\" \r\n| where FileName in~ ( \"powershell.exe\", \"pwsh.exe\", \"conhost.exe\")\r\n| where ProcessCommandLine matches regex @'(\\s{5,}|\\t{2,})'\r\n| project Timestamp,DeviceId, DeviceName, InitiatingProcessFileName, InitiatingProcessCommandLine, FileName, ProcessCommandLine, AccountName, ReportId"
query_type: kql
severity: medium
tactics:
    - TA0002
techniques:
    - T1059
    - T1059.001
tags:
    - kql
author: Benjamin Zulliger
version: "3"
references:
    - https://expel.com/blog/cache-smuggling-when-a-picture-isnt-a-thousand-words/
