id: 0199c631-0f3a-729e-bfcf-d8301dd9243d
name: SSLKEYLOGFILE Environment Variable Modification
description: Detects modifications to the 'SSLKEYLOGFILE' environment variable in the Windows Registry. This variable is often used by applications like web browsers to log SSL/TLS session keys to a file, which can then be used to decrypt encrypted network traffic. Malicious actors might enable this to capture sensitive data.
query: "DeviceRegistryEvents\r\n| where RegistryKey =~ @\"SYSTEM\\CurrentControlSet\\Control\\Session Manager\\Environment\"\r\nand RegistryValueName =~ \"SSLKEYLOGFILE\""
query_type: kql
severity: medium
tactics:
    - TA0006
techniques:
    - T1552.004
tags:
    - kql
version: "1"
