id: 0199d449-24ce-773c-ba0a-c268fb09cedd
name: Suspicious Network Connection to EDR C2 URLs
description: This rule detects suspicious network connections made by processes (excluding legitimate EDR processes like mssense.exe and senseir.exe) to URLs commonly associated with EDR command and control (C2) infrastructure. This could indicate an attempt by an adversary to communicate with or manipulate the EDR agent.
query: "DeviceNetworkEvents\r\n| where InitiatingProcessFileName !in (\"mssense.exe\", \"senseir.exe\")\r\n| where RemoteUrl has_any (\"/edr/commands/cnc\", \"/senseir/v1/actions/\")\r\n| project\r\n    TimeGenerated,\r\n    DeviceName,\r\n    InitiatingProcessFileName,\r\n    InitiatingProcessCommandLine,\r\n    InitiatingProcessParentFileName,\r\n    RemoteUrl,\r\n    RemoteIP,\r\n    RemotePort,\r\n    InitiatingProcessAccountName,\r\n    InitiatingProcessAccountDomain\r\n"
query_type: kql
severity: medium
tactics:
    - TA0011
techniques:
    - T1071.001
tags:
    - kql
version: "1"
