id: 0199868f-a21e-76da-86af-1afcd603cda0
name: Homoglyph Attack Indicators
description: 'KQL Query from file: Homoglyph Attack Indicators'
query: "ThreatIntelIndicators\r\n| where TimeGenerated > ago(4d)\r\n| where IsActive == true\r\n| where Confidence >= 80\r\n| where Tags has \"homoglyph\"\r\n| summarize Total=count() by ObservableKey\r\n| sort by Total desc "
query_type: kql
severity: medium
tags:
    - kql
author: Steven Lim
version: "2"
