id: 0199c2f4-7da5-7358-bf52-965882d76ade
name: Visual Studio Tunnel Connection
description: Tracks network events involving connections to specific Visual Studio Tunnel API URLs, which are used for remote development scenarios (like Visual Studio Code's Live Share or remote tunneling features).
query: "DeviceNetworkEvents\r\n| where RemoteUrl contains \"rel.tunnels.api.visualstudio.com\" or RemoteUrl contains \"devtunnels.ms\""
query_type: kql
severity: medium
techniques:
    - T1219.001
tags:
    - kql
version: "2"
references:
    - https://global.rel.tunnels.api.visualstudio.com/api/v1/clusters
    - https://code.visualstudio.com/docs/remote/tunnels
