id: 0199817a-d8cb-708a-a1bc-5363b8523be2
name: Mapping CVE-2025-20352 Exposure with MDE Telemetry
description: This rule identifies Cisco network devices within Microsoft Defender for Endpoint (MDE) telemetry that are running Cisco IOS or Cisco XE operating systems, excluding version '17.15.4a'. The exclusion of a specific OS version suggests the rule is designed to pinpoint devices that may be vulnerable to a known security flaw, potentially CVE-2025-20352 as indicated by the rule's title. It helps in mapping exposure to specific vulnerabilities by identifying potentially unpatched or vulnerable network infrastructure components.
query: "DeviceInfo\r\n| where Timestamp > ago(30d)\r\n| summarize arg_max(Timestamp, *) by DeviceId\r\n| where Vendor == \"Cisco\"\r\n| where OSVersion != \"\" and OSVersion != \"17.15.4a\"\r\n| where DeviceCategory == \"NetworkDevice\"\r\n| where OSDistribution == \"CiscoIOS\" or  OSDistribution == \"CiscoXE\"\r\n| project DeviceId, DeviceName, OSVersion, DeviceSubtype, Model, OSDistribution"
query_type: kql
severity: medium
tactics:
    - TA0043
    - TA0042
techniques:
    - T1595.002
    - T1588.006
tags:
    - kql
author: Steven Lim
version: "2"
