id: 019ab074-aa9f-74f0-9a2e-997623c35512
name: Tycoon2FA default URL pattern
description: This query identifies an anomalous pattern associated with behavior performed using the PhaaS platform with adversary-in-the-middle (AiTM) capabilities, Tycoon2FA.
query: |-
    id: aa882f32-0c08-4362-aff6-f793b60a6c24
    name: Tycoon2FA default URL pattern
    description: |
      'This query identifies an anomalous pattern associated with behavior performed using the PhaaS platform with adversary-in-the-middle (AiTM) capabilities, Tycoon2FA.
      Ref: https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/phaas-the-secrets-the-hidden-ties-between-tycoon2fa-and-dadsecs-operations/'
    requiredDataConnectors:
      - connectorId: MicrosoftThreatProtection
        dataTypes:
        - DeviceNetworkEvents
      - connectorId: PaloAltoNetworks
        dataTypes:
          - CommonSecurityLog
    tactics:
      - Credential Access
    relevantTechniques:
      - T1557
    query: |
      let starttime = ago(90d);
      let endtime = now();
      let tycoon2faPhpFiles = dynamic(['res444.php', 'cllascio.php', '.000.php']);
      let DeviceNetworkEvents = materialize(DeviceProcessEvents
        | where TimeGenerated >= starttime
        | where TimeGenerated <= endtime
        | where RemoteUrl has_any (tycoon2faPhpFiles));
      let CommonSecurityLog = materialize(CommonSecurityLog
        | where TimeGenerated >= starttime
        | where TimeGenerated <= endtime
        | where DeviceVendor =~ 'palo alto networks'
        | where DeviceEventClassID =~ 'url'
        | where RequestURL has_any (tycoon2faPhpFiles));
      union DeviceNetworkEvents, CommonSecurityLog
      | project-reorder TimeGenerated, Type
      | sort by TimeGenerated asc
    version: 1.0.1
query_type: kql
severity: medium
tactics:
    - TA0006
techniques:
    - T1557
tags:
    - kql
    - tactic:Credential Access
    - technique:T1557
version: "5"
references:
    - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/phaas-the-secrets-the-hidden-ties-between-tycoon2fa-and-dadsecs-operations/
data_sources:
    - DeviceNetworkEvents
    - CommonSecurityLog
