id: 019a5e76-ab1d-709f-9e2f-91ecffdf9c4e
name: LANDFALL Android Spyware SELinux Policy Manipulation
description: Detects the LANDFALL Android spyware manipulating SELinux policy by preloading a malicious shared object and passing a path to the 'l.so' policy manipulator component via the PRELOAD_PATH environment variable.
query: "DeviceProcessEvents\r\n| where ProcessCommandLine has_all (\"LD_PRELOAD=\",\"PRELOAD_PATH=/data/data/com.samsung.ipservice/files/l.so\",\"/system/bin/id\")"
query_type: kql
severity: medium
tactics:
    - TA0003
    - TA0004
    - TA0005
    - TA0002
techniques:
    - T1574.006
    - T1106
tags:
    - kql
version: "1"
