id: 019a04ad-2499-757f-a1f9-ed0d79072444
name: Suspicious Azure Resource Access by User Account
description: This rule detects suspicious resource access patterns in Azure. Specifically, it flags instances where an 'Account' type actor (identified by a username) accesses resources that are not explicitly allowed for security monitoring (SecMon) or security orchestration, automation, and response (SecSoar) purposes. The rule also filters out activities from 'Microsoft-WindowsAzure-Frontdoor' and specific 'Microsoft.Resources' actions to reduce false positives. The primary goal is to identify unauthorized or unusual access to Azure resources by user accounts that fall outside defined security operational scopes.
query: "let allowedApplication = 'Microsoft-WindowsAzure-Frontdoor';\r\nlet allowedSecMonResources = dynamic([\r\n    'Microsoft.Insights/workbooks',\r\n    'Microsoft.Insights/workbooktemplate',\r\n    'Microsoft.Insights/components',\r\n    'Microsoft.Insights/dataCollectionRules',\r\n    'Microsoft.Insights/dataCollectionEndpoints',\r\n    'Microsoft.Insights/dataCollectionRuleAssociations',\r\n    'Microsoft.Insights/metricAlerts',\r\n    'Microsoft.Insights/webtests',\r\n    'Microsoft.KeyVault/vaults',\r\n    'Microsoft.KeyVault/vaults/accessPolicies',\r\n    'Microsoft.ManagedIdentity/userAssignedIdentities',\r\n    'Microsoft.Network/applicationGateways',\r\n    'Microsoft.Network/ApplicationGatewayWebApplicationFirewallPolicies',\r\n    'Microsoft.Network/publicIPAddresses',\r\n    'Microsoft.OperationalInsights/queryPacks',\r\n    'Microsoft.OperationalInsights/queryPacks/queries',\r\n    'Microsoft.OperationalInsights/workspaces/savedSearches',\r\n    'Microsoft.OperationalInsights/workspaces/tables',\r\n    'Microsoft.Resources/deployments',\r\n    'Microsoft.SecurityInsights/alertRules',\r\n    'Microsoft.SecurityInsights/automationRules',\r\n    'Microsoft.SecurityInsights/watchlists',\r\n    'Microsoft.Storage/storageAccounts',\r\n    'Microsoft.Storage/storageAccounts/blobServices',\r\n    'Microsoft.Storage/storageAccounts/blobServices/containers',\r\n    'Microsoft.Compute/virtualMachines',\r\n    'Microsoft.Compute/virtualMachines/extensions',\r\n    'Microsoft.Compute/virtualMachines/runCommands'\r\n    ]);\r\nlet allowedSecSoarResources = dynamic([\r\n    'Microsoft.CognitiveServices/accounts',\r\n    'Microsoft.CognitiveServices/accounts/deployments',\r\n    'Microsoft.Insights/components',\r\n    'Microsoft.Insights/diagnosticSettings',\r\n    'Microsoft.KeyVault/vaults',\r\n    'Microsoft.Logic/workflows',\r\n    'Microsoft.Resources/deployments',\r\n    'Microsoft.Resources/subscriptions/resourcegroups',\r\n    'Microsoft.SecurityInsights/automationRules',\r\n    'Microsoft.Storage/storageAccounts',\r\n    'Microsoft.Storage/storageAccounts/blobServices',\r\n    'Microsoft.Storage/storageAccounts/blobServices/containers',\r\n    'Microsoft.Web/connections',\r\n    'Microsoft.Web/serverfarms',\r\n    'Microsoft.Web/sites',\r\n    'Microsoft.Web/sites/host'\r\n    ]);\r\nlet ResourceAppEvents = CloudAppEvents\r\n    | where ObjectType == \"Resource\"\r\n    | extend\r\n        ActorName = tostring(ActivityObjects[5].Name),\r\n        ActorType = tostring(ActivityObjects[5].Type),\r\n        ProviderName = tostring(RawEventData.ProviderName),\r\n        ResourceType = tostring(ActivityObjects[1].Name)\r\n    | where ActorType == 'Account';\r\nResourceAppEvents\r\n| where (ActorName contains '*username*' and ResourceType !in~ (allowedSecMonResources)) or (ActorName contains '*username*' and ResourceType !in~ (allowedSecSoarResources))\r\n| where ProviderName !~ allowedApplication or not(ResourceType =~ 'Microsoft.Resources/' and ActionType =~ 'NotifyResourceJobs Microsoft.Resources')\r\n| project\r\n    TimeGenerated,\r\n    ResourceType,\r\n    ServiceConnectionCustomEntity = ActorName,\r\n    AzureResourceCustomEntity = ObjectId,\r\n    CloudApplicationCustomEntity = ProviderName,\r\n    IPAddressCustomEntity = IPAddress,\r\n    ActionType"
query_type: kql
severity: medium
tactics:
    - TA0007
techniques:
    - T1526
tags:
    - kql
author: rudra verma
version: "22"
