id: 019a4a0a-068b-7338-b213-5eefdafc0ff6
name: Azure AD Device Registration from New IP Address
description: This rule detects new device registrations in Azure Active Directory (AAD) that originate from an IP address not previously associated with the user's account within the last 29 days. It filters out registrations from corporate IP ranges and common mobile operating systems (iOS, Android) to reduce noise. The rule categorizes the risk level of the IP address based on historical sign-in counts, focusing on 'High Risk - New IP' events. It then enriches these events with additional sign-in details like device name, risk level during sign-in, country, and city.
query: "let ExcludedOS = datatable( OperatingSystem: string) [\"iOS\", \"Android\"];\r\nlet CorporateIPRange   = \"xx.xx.\";\r\n// List of new Device Registrations\r\nlet DeviceRegistration = AuditLogs\r\n| where TimeGenerated >ago(2h)\r\n| where Category == \"Device\"\r\n| where OperationName in (\"Register device\")\r\n| extend Additional = todynamic(AdditionalDetails)\r\n| mv-expand Additional\r\n| extend DetailKey = tostring(Additional.key), \r\n         DetailValue = tostring(Additional.value)\r\n| where DetailKey == \"Device OS\"\r\n| project TimeGenerated,\r\n          OperationName,\r\n          InitiatedBy = tostring(InitiatedBy.user.displayName),\r\n          AccountUpn = tostring(InitiatedBy.user.userPrincipalName),\r\n          TargetDevice = tostring(TargetResources[0].displayName),\r\n          DeviceId = tostring(TargetResources[0].id),\r\n          Result = tostring(Result),\r\n          IPAddress = tostring(InitiatedBy.user.ipAddress),\r\n          OperatingSystem = DetailValue\r\n| where OperatingSystem !in (ExcludedOS)\r\n| where isnotempty( AccountUpn)\r\n| sort by TimeGenerated desc\r\n| where IPAddress !startswith (CorporateIPRange)\r\n| summarize arg_max(TimeGenerated, *) by AccountUpn\r\n| project TimeGenerated, AccountUpn, TargetDevice, IPAddress, OperatingSystem;\r\nlet HistoricalIPCounts = AADSignInEventsBeta\r\n| where ErrorCode == 0\r\n| where Timestamp >= ago(29d)\r\n| summarize IPSeenCount = count() by AccountUpn, IPAddress;\r\n// Build the IP list per account\r\nlet HistoricalIPs = AADSignInEventsBeta\r\n| where ErrorCode == 0\r\n| where Timestamp >= ago(29d)\r\n| summarize HistoricalIPs = make_set(IPAddress) by AccountUpn;\r\n// Join with RiskySignIns and Counts\r\nDeviceRegistration\r\n| join kind=leftouter HistoricalIPs on AccountUpn\r\n| join kind=leftouter HistoricalIPCounts on AccountUpn, IPAddress\r\n| extend \r\n    IPSeenBefore = iff(isnotempty(IPSeenCount), true, false),\r\n    IPSeenCount = coalesce(IPSeenCount, 0)\r\n| extend IPRiskLevel = case(\r\n        IPSeenBefore == false, \"High Risk - New IP\",\r\n        IPSeenBefore == true and IPSeenCount < 3, \"Medium Risk - Rare IP\",\r\n        IPSeenBefore == true and IPSeenCount >= 3, \"Lower Risk - Frequent IP\",\r\n        \"Unknown\"\r\n    )\r\n// Filter for only New IPs. here you can adapt the value\r\n| where IPRiskLevel startswith \"High\"\r\n| join kind=leftouter ( AADSignInEventsBeta\r\n        | summarize arg_max(TimeGenerated, DeviceName, RiskLevelDuringSignIn, Country, City) by AccountUpn, IPAddress ) on AccountUpn, IPAddress"
query_type: kql
severity: medium
tactics:
    - TA0003
    - TA0001
    - TA0004
techniques:
    - T1098.005
tags:
    - kql
author: Benjamin Zulliger
version: "2"
