id: 019a993b-388c-741f-9884-6140c394e570
name: Finger Protocol  Abuse
description: Detects Finger Protocol usage
query: "//based on https://www.bleepingcomputer.com/news/security/decades-old-finger-protocol-abused-in-clickfix-malware-attacks/\r\nunion DeviceEvents,DeviceProcessEvents\r\n| where FileName in (\"finger\",\"bash\",\"finger.exe\",\"cmd.exe\",\"powershell.exe\")\r\n| where ProcessCommandLine contains \"finger\" or ProcessCommandLine contains \"cmd /c start \"\" /min cmd /c\""
query_type: kql
severity: medium
tags:
    - kql
version: "1"
references:
    - https://www.bleepingcomputer.com/news/security/decades-old-finger-protocol-abused-in-clickfix-malware-attacks/
