id: 019a14af-6259-71e7-befa-1abb870b8e67
name: '[IC] - Detecting Modification of Windows Security Audit Policy (Auditpol.exe)'
description: Monitoring the execution of auditpol.exe can be crutial to detect first-stage of a real attack because they will be shown as previous steps to obfuscate the next execution such a ransomware.
query: |-
    DeviceRegistryEvents
    | where RegistryValueData startswith "auditpol"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1562.001
tags:
    - kql
author: Sergio Albea
version: "1"
references:
    - https://medium.com/detect-fyi/detecting-tampering-of-windows-security-audit-policy-42e66aac993c
