id: 019a2ae5-501a-747e-bb38-69bd0a412336
name: MDE Offboarding Package Download Detected
description: "This rule detects when an MDE offboarding package is downloaded. \nThis activity could indicate an attempt to remove an endpoint from security monitoring or management, potentially by an insider threat or an attacker attempting to evade detection."
query: "CloudAppEvents\r\n| where ActionType == \"DownloadOffboardingPkg\"\r\n| extend RawData = parse_json(RawEventData)\r\n| extend\r\nAccountUpn = tostring(RawData.UserId),\r\nOrgId = tostring(RawData.OrganizationId),\r\nClientIP = tostring(RawData.ClientIP),\r\nDeploymentMethod = tostring(RawData.DeploymentMethod),\r\nOsFamily = tostring(RawData.OsFamily),\r\nPackageExpiration = tostring(RawData.PackageExpiration)\r\n| project Timestamp, AccountUpn, AccountDisplayName, DeploymentMethod, OsFamily, PackageExpiration, ClientIP, OrgId, ReportId"
query_type: kql
severity: medium
tactics:
    - TA0003
    - TA0004
techniques:
    - T1098
tags:
    - kql
author: Stanislas MEDRANO
version: "1"
