id: 019a2ae9-65ca-75c3-b830-d034b795250c
name: MDI Sensor Deleted
description: This rule detects when an MDI (Microsoft Defender for Identity) sensor is deleted. This could indicate an adversary attempting to impair defenses by removing security monitoring tools.
query: "CloudAppEvents\r\n| where ActionType == \"SensorDeleted\"\r\n| extend Sensor = tostring(parse_json(RawEventData).ResultDescription), AccountUpn = tostring(parse_json(RawEventData).UserId)\r\n| project Timestamp, Sensor, AccountObjectId, AccountUpn, AccountDisplayName, AccountType, ReportId"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1562
    - T1562.001
tags:
    - kql
author: Stanislas MEDRANO
version: "2"
