id: 019ade17-f9de-74ea-a1b2-90f9ea188788
name: Sha1-Hulud Detection
description: 'This rule detects 3 types of suspicious activities: first, the presence of files matching a list of known malicious SHA256 hashes associated with Sha1-Hulud; second, suspicious process behavior involving file deletion commands and third traffic towards potential C2. '
query: "let IOC_hashes=pack_array(\"62ee164b9b306250c1172583f138c9614139264f889fa99614903c12755468d0\",\"f099c5d9ec417d4445a0328ac0ada9cde79fc37410914103ae9c609cbc0ee068\",\"cbb9bc5a8496243e02f3cc080efbe3e4a1430ba0671f2e43a202bf45b05479cd\",\"a3894003ad1d293ba96d77881ccd2071446dc3f65f434669b49b3da92421901a\");\r\nlet q1=DeviceFileEvents| where SHA256 in (IOC_hashes)|extend comment=\"File IOC detected\";//file hash based\r\nlet q2=DeviceProcessEvents //process behaviour based\r\n| where (InitiatingProcessFileName has_any (\"setup_bun.js\",\"bun_environment.js\")) or (InitiatingProcessSHA256 in (IOC_hashes)) or (InitiatingProcessParentFileName has_any (\"setup_bun.js\",\"bun_environment.js\"))\r\n| where (ProcessCommandLine has_all (\"del\",\"do\",\"for\")) or (ProcessCommandLine has_all (\"shred\",\"-delete\",\"-empty\"))\r\n|extend comment=\"Suspicious behaviour detected\";\r\nlet q3=DeviceNetworkEvents\r\n| where RemoteUrl has \"bun.sh\" // network event based\r\n| where InitiatingProcessCommandLine has \"setup_bun.js\"\r\n|extend comment=\"Suspicious traffic detected\";\r\nunion q1,q2,q3"
query_type: kql
severity: medium
tactics:
    - TA0005
    - TA0040
    - TA0002
techniques:
    - T1204.002
    - T1485
tags:
    - kql
author: Vaasudev Kala
version: "8"
references:
    - https://securitylabs.datadoghq.com/articles/shai-hulud-2.0-npm-worm/
