id: 019a3150-350e-750e-b1ce-be4b9630df2c
name: Hotmtail Phish where emabeded URL contain googlecontent
description: Where emabeded URL contain googlecontent
query: "EmailEvents\r\n| join kind=inner EmailUrlInfo on $left.NetworkMessageId == $right.NetworkMessageId\r\n| where SenderFromDomain contains \"hotmail\" and Url contains \"googleusercontent\" and Subject !contains \"Re\" and Subject !contains \"Fwd\" and ThreatTypes has_any ('phish' , 'spam')\r\n| project Timestamp , NetworkMessageId"
query_type: kql
severity: medium
tactics:
    - TA0001
tags:
    - kql
author: Declan Byrne
version: "1"
