id: 019a0364-e3fe-7489-ab3e-380a75c29783
name: LNK File Execution from ZIP Archive via rundll32.exe
description: Detects a process execution where the parent process is explorer.exe and its command line indicates it is launching an LNK file from within a ZIP archive. This is a common TTP for initial access, where users are tricked into opening malicious LNK files embedded in ZIP archives. This version specifically looks for rundll32.exe as the child process, which is a common technique for proxy execution.
query: |
    // title: LNK File Execution from ZIP Archive
    // id: 119c766e-3d2f-4ddb-8d03-e0dd1d99be83
    // status: experimental
    // description: Detects a process execution where the parent process is explorer.exe and its command line indicates it is launching an LNK file from within a ZIP archive. This is a common TTP for initial access, where users are tricked into opening malicious LNK files embedded in ZIP archives. This version specifically looks for rundll32.exe as the child process.
    // references:
    //   - https://malware.news/t/operation-motorbeacon-threat-actor-targets-russian-automotive-sector-using-net-implant/100263
    //   - https://securityaffairs.com/183628/uncategorized/capi-backdoor-targets-russias-auto-and-e-commerce-sectors.html
    // author: detections.ai
    // date: 2025-10-21
    // tags:
    //   - attack.initial_access
    //   - attack.t1566.001
    //   - attack.t1204.002
    DeviceProcessEvents
    | where
        // Parent process is explorer.exe, indicating user interaction.
        InitiatingProcessFileName endswith @"\explorer.exe"
        // Parent command line shows a .lnk file being opened from a .zip path.
        and InitiatingProcessCommandLine has ".zip\\" and InitiatingProcessCommandLine has ".lnk"
        // The process created by the LNK file is rundll32.exe, a common technique for proxy execution.
        and FileName endswith @"\rundll32.exe"
query_type: kql
severity: medium
tactics:
    - TA0001
    - TA0002
    - TA0005
techniques:
    - T1204.002
    - T1218.011
    - T1566.001
tags:
    - kql
version: "3"
references:
    - https://malware.news/t/operation-motorbeacon-threat-actor-targets-russian-automotive-sector-using-net-implant/100263
    - https://securityaffairs.com/183628/uncategorized/capi-backdoor-targets-russias-auto-and-e-commerce-sectors.html
