id: 019a714e-f1f6-720f-ab4e-4bbc5e231df4
name: Find Isolated Devices list
description: |
    This query retrieves the most recent record for each device and filters the results to show devices that are currently isolated.
    • The DeviceInfo table contains details about each device and its status over time.
    • The summarize arg_max(Timestamp, *) by DeviceName part selects the latest entry (based on Timestamp) for every device.
    • The where MitigationStatus contains "Isolated" filter ensures that only devices with an isolation-related mitigation status are displayed.
query: |-
    DeviceInfo
    | where Timestamp > ago(30d)
    | summarize arg_max(Timestamp, *) by DeviceName
    | where MitigationStatus contains "Isolated"
query_type: kql
severity: medium
techniques:
    - T1070
    - T1059
tags:
    - kql
version: "3"
