id: 019ae693-9730-712c-afde-1b0c9a1c2adf
name: ShadyPanda Chrome & Edge Extension RCE
description: |
    Extremely basic & rough KQL for the purpose of finding if these extension id's are in any folders across your estate.
query: |-
    DeviceFileEvents
    | where FolderPath has_any (
    "eagiakjmjnblliacokhcalebgnhellfi",
    "ibiejjpajlfljcgjndbonclhcbdcamai",
    "ogjneoecnllmjcegcfpaamfpbiaaiekh",
    "jbnopeoocgbmnochaadfnhiiimfpbpmf",
    "cdgonefipacceedbkflolomdegncceid",
    "gipnpcencdgljnaecpekokmpgnhgpela",
    "bpgaffohfacaamplbbojgbiicfgedmoi",
    "ineempkjpmbdejmdgienaphomigjjiej",
    "nnnklgkfdfbdijeeglhjfleaoagiagig",
    "Mljmfnkjmcdmongjnnnbbnajjdbojoci",
    "llkncpcdceadgibhbedecmkencokjajg",
    "nmfbniajnpceakchicdhfofoejhgjefb",
    "ijcpbhmpbaafndchbjdjchogaogelnjl",
    "olaahjgjlhoehkpemnfognpgmkbedodk",
    "gnhgdhlkojnlgljamagoigaabdmfhfeg",
    "cihbmmokhmieaidfgamioabhhkggnehm",
    "lehjnmndiohfaphecnjhopgookigekdk",
    "hlcjkaoneihodfmonjnlnnfpdcopgfjk",
    "hmhifpbclhgklaaepgbabgcpfgidkoei",
    "lnlononncfdnhdfmgpkdfoibmfdehfoj",
    "nagbiboibhbjbclhcigklajjdefaiidc",
    "ofkopmlicnffaiiabnmnaajaimmenkjn",
    "ocffbdeldlbilgegmifiakciiicnoaeo",
    "eaokmbopbenbmgegkmoiogmpejlaikea",
    "lhiehjmkpbhhkfapacaiheolgejcifgd",
    "ondhgmkgppbdnogfiglikgpdkmkaiggk",
    "imdgpklnabbkghcbhmkbjbhcomnfdige",
    "bpelnogcookhocnaokfpoeinibimbeff",
    "enkihkfondbngohnmlefmobdgkpmejha",
    "hajlmbnnniemimmaehcefkamdadpjlfa",
    "aadnmeanpbokjjahcnikajejglihibpd",
    "ipnidmjhnoipibbinllilgeohohehabl",
    "fnnigcfbmghcefaboigkhfimeolhhbcp",
    "nlcebdoehkdiojeahkofcfnolkleembf",
    "fhababnomjcnhmobbemagohkldaeicad",
    "nokknhlkpdfppefncfkdebhgfpfilieo",
    "ljmcneongnlaecabgneiippeacdoimaa",
    "onifebiiejdjncjpjnojlebibonmnhog",
    "dbagndmcddecodlmnlcmhheicgkaglpk",
    "fmgfcpjmmapcjlknncjgmbolgaecngfo",
    "kgmlodoegkmpfkbepkfhgeldidodgohd",
    "hegpgapbnfiibpbkanjemgmdpmmlecbc",
    "gkanlgbbnncfafkhlchnadcopcgjkfli",
    "oghgaghnofhhoolfneepjneedejcpiic",
    "fcidgbgogbfdcgijkcfdjcagmhcelpbc",
    "nnceocbiolncfljcmajijmeakcdlffnh",
    "domfmjgbmkckapepjahpedlpdedmckbj",
    "cbkogccidanmoaicgphipbdofakomlak",
    "bmlifknbfonkgphkpmkeoahgbhbdhebh",
    "ghaggkcfafofhcfppignflhlocmcfimd",
    "hfeialplaojonefabmojhobdmghnjkmf",
    "boiciofdokedkpmopjnghpkgdakmcpmb",
    "ibfpbjfnpcgmiggfildbcngccoomddmj",
    "idjhfmgaddmdojcfmhcjnnbhnhbmhipd",
    "jhgfinhjcamijjoikplacnfknpchndgb",
    "cgjgmbppcoolfkbkjhoogdpkboohhgel",
    "afooldonhjnhddgnfahlepchipjennab",
    "fkbcbgffcclobgbombinljckbelhnpif",
    "fpokgjmlcemklhmilomcljolhnbaaajk",
    "hadkldcldaanpomhhllacdmglkoepaed",
    "iedkeilnpbkeecjpmkelnglnjpnacnlh",
    "hjfmkkelabjoojjmjljidocklbibphgl",
    "dhjmmcjnajkpnbnbpagglbbfpbacoffm",
    "cgehahdmoijenmnhinajnojmmlnipckl",
    "fjigdpmfeomndepihcinokhcphdojepm",
    "chmcepembfffejphepoongapnlchjgil",
    "googojfbnbhbbnpfpdnffnklipgifngn",
    "fodcokjckpkfpegbekkiallamhedahjd",
    "igiakpjhacibmaichhgbagdkjmjbnanl",
    "omkjakddaeljdfgekdjebbbiboljnalk",
    "llilhpmmhicmiaoancaafdgganakopfg",
    "nemkiffjklgaooligallbpmhdmmhepll",
    "papedehkgfhnagdiempdbhlgcnioofnd",
    "glfddenhiaacfmhoiebfeljnfkkkmbjb",
    "pkjfghocapckmendmgdmppjccbplccbg",
    "gbcjipmcpedgndgdnfofbhgnkmghoamm",
    "ncapkionddmdmfocnjfcfpnimepibggf",
    "klggeioacnkkpdcnapgcoicnblliidmf",
    "klgjbnheihgnmimajhohfcldhfpjnahe",
    "acogeoajdpgplfhidldckbjkkpgeebod",
    "ekndlocgcngbpebppapnpalpjfnkoffh",
    "elckfehnjdbghpoheamjffpdbbogjhie",
    "dmpceopfiajfdnoiebfankfoabfehdpn",
    "gpolcigkhldaighngmmmcjldkkiaonbg",
    "dfakjobhimnibdmkbgpkijoihplhcnil",
    "hbghbdhfibifdgnbpaogepnkekonkdgc",
    "fppchnhginnfabgenhihpncnphhafmac",
    "ghhddclfklljabeodmcejjjlhoaaiban",
    "bppelgkcnhfkicolffhlkbdghdnjdkhi",
    "ikgaleggljchgbihlaanjbkekmmgccam",
    "bdhjinjoglaijpffoamhhnhooeimgoap",
    "fjioinpkgmlcioajfnncgldldcnabffe",
    "opncjjhgbllenobgbfjbblhghmdpmpbj",
    "cbijiaccpnkbdpgbmiiipedpepbhioel",
    "fbbmnieefocnacnecccgmedmcbhlkcpm",
    "hmbacpfgehmmoloinfmkgkpjoagiogai",
    "paghkadkhiladedijgodgghaajppmpcg",
    "bafbmfpfepdlgnfkgfbobplkkaoakjcl",
    "kcpkoopmfjhdpgjohcbgkbjpmbjmhgoi",
    "jelgelidmodjpmohbapbghdgcpncahki",
    "lfgakdlafdenmaikccbojgcofkkhmolj",
    "hdfknlljfbdfjdjhfgoonpphpigjjjak",
    "kpfbijpdidioaomoecdbfaodhajbcjfl",
    "fckphkcbpgmappcgnfieaacjbknhkhin",
    "lhfdakoonenpbggbeephofdlflloghhi",
    "ljjngehkphcdnnapgciajcdbcpgmpknc",
    "ejfocpkjndmkbloiobcdhkkoeekcpkik",
    "ccdimkoieijdbgdlkfjjfncmihmlpanj",
    "agdlpnhabjfcbeiempefhpgikapcapjb",
    "mddfnhdadbofiifdebeiegecchpkbgdb",
    "alknmfpopohfpdpafdmobclioihdkhjh",
    "hlglicejgohbanllnmnjllajhmnhjjel",
    "iaccapfapbjahnhcmkgjjonlccbhdpjl",
    "ehmnkbambjnodfbjcebjffilahbfjdml",
    "ngbfciefgjgijkkmpalnmhikoojilkob",
    "laholcgeblfbgdhkbiidbpiofdcbpeeo",
    "njoedigapanaggiabjafnaklppphempm",
    "fomlombffdkflbliepgpgcnagolnegjn",
    "jpoofbjomdefajdjcimmaoildecebkjc",
    "nhdiopbebcklbkpfnhipecgfhdhdbfhb",
    "gdnhikbabcflemolpeaaknnieodgpiie",
    "bbdioggpbhhodagchciaeaggdponnhpa",
    "ikajognfijokhbgjdhgpemljgcjclpmn",
    "lmnjiioclbjphkggicmldippjojgmldk",
    "ffgihbmcfcihmpbegcfdkmafaplheknk",
    "lgnjdldkappogbkljaiedgogobcgemch",
    "hiodlpcelfelhpinhgngoopbmclcaghd",
    "mnophppbmlnlfobakddidbcgcjakipin",
    "jbajdpebknffiaenkdhopebkolgdlfaf",
    "ejdihbblcbdfobabjfebfjfopenohbjb",
    "ikkoanocgpdmmiamnkogipbpdpckcahn",
    "ileojfedpkdbkcchpnghhaebfoimamop",
    "akialmafcdmkelghnomeneinkcllnoih",
    "eholblediahnodlgigdkdhkkpmbiafoj",
    "ipokalojgdmhfpagmhnjokidnpjfnfik",
    "hdpmmcmblgbkllldbccfdejchjlpochf",
    "iphacjobmeoknlhenjfiilbkddgaljad",
    "jiiggekklbbojgfmdenimcdkmidnfofl",
    "gkhggnaplpjkghjjcmpmnmidjndojpcn",
    "opakkgodhhongnhbdkgjgdlcbknacpaa",
    "nkjomoafjgemogbdkhledkoeaflnmgfi",
    "ebileebbekdcpfjlekjapgmbgpfigled",
    "oaacndacaoelmkhfilennooagoelpjop",
    "ljkgnegaajfacghepjiajibgdpfmcfip",
    "hgolomhkdcpmbgckhebdhdknaemlbbaa",
    "bboeoilakaofjkdmekpgeigieokkpgfn",
    "dkkpollfhjoiapcenojlmgempmjekcla",
    "emiocjgakibimbopobplmfldkldhhiad",
    "nchdmembkfgkejljapneliogidkchiop",
    "lljplndkobdgkjilfmfiefpldkhkhbbd",
    "hofaaigdagglolgiefkbencchnekjejl",
    "hohobnhiiohgcipklpncfmjkjpmejjni",
    "jocnjcakendmllafpmjailfnlndaaklf",
    "bjdclfjlhgcdcpjhmhfggkkfacipilai",
    "ahebpkbnckhgjmndfjejibjjahjdlhdb",
    "enaigkcpmpohpbokbfllbkijmllmpafm",
    "bpngofombcjloljkoafhmpcjclkekfbh",
    "cacbflgkiidgcekflfgdnjdnaalfmkob",
    "ibmgdfenfldppaodbahpgcoebmmkdbac"
    )
    | project Timestamp, DeviceName, InitiatingProcessAccountName, FolderPath
query_type: kql
severity: medium
techniques:
    - T1189
    - T1195
tags:
    - kql
author: dmgsteve
version: "1"
references:
    - https://www.bleepingcomputer.com/news/security/shadypanda-browser-extensions-amass-43m-installs-in-malicious-campaign/amp/
