id: 019a14ad-e307-72c2-bd59-e54581cfde26
name: '[IC] - Detecting Execution of Windows Security Audit Policy (Auditpol.exe)'
description: Monitoring the execution of auditpol.exe can be crutial to detect first-stage of a real attack because they will be shown as previous steps to obfuscate the next execution such a ransomware.
query: |-
    DeviceProcessEvents
    | where AccountName !has "system" and FileName has "auditpol.exe"
    | summarize by Timestamp,DeviceName,DeviceId,FileName,AccountDomain,InitiatingProcessAccountName,AccountName, ProcessCommandLine, ReportId
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1562.002
    - T1562.001
tags:
    - kql
author: Sergio Albea
version: "1"
references:
    - https://medium.com/detect-fyi/detecting-tampering-of-windows-security-audit-policy-42e66aac993c
