id: 019a059e-4fb3-7251-b5e0-1c552e7b6f27
name: Office365 - Mass Email Attachment Download
description: |-
    This detection looks for cases where a user has downloaded an attachment from 3 or more separate emails over a 24 hour period. This activity could indicate an insider risk collecting documents prior to data exfiltration.

    The limit for this can be altered based on baseline company behaviour.
query: "let EmailWithAttachments =\r\n    EmailEvents\r\n    | summarize\r\n        EmailCount       = count(),\r\n        TotalAttachments = sum(AttachmentCount),\r\n        TotalUrls        = sum(UrlCount),\r\n        Subjects         = make_set(Subject, 1000)\r\n        by\r\n        SenderFromAddress,\r\n        RecipientEmailAddress,\r\n        HourBucket = bin(TimeGenerated, 1h),\r\n        NetworkMessageId\r\n    | join kind=inner (\r\n        EmailAttachmentInfo\r\n        | where not (\r\n            FileName matches regex @\"^image\\d{3,}\\.(png|jpg|jpeg|gif|bmp|tiff)$\" \r\n            and FileSize < 5000\r\n        )\r\n        | project NetworkMessageId, FileName, FileType, FileSize, SHA256\r\n        )\r\n        on NetworkMessageId\r\n    | summarize\r\n        EmailCount           = any(EmailCount),\r\n        TotalAttachments     = any(TotalAttachments),\r\n        TotalUrls            = any(TotalUrls),\r\n        Subjects             = any(Subjects),\r\n        SenderFromAddress    = any(SenderFromAddress),\r\n        RecipientEmailAddress= any(RecipientEmailAddress),\r\n        HourBucket           = any(HourBucket),\r\n        Attachments = make_set(\r\n                  pack(\r\n    \"AttachmentName\",\r\n    FileName,\r\n    \"FileType\",\r\n    FileType,\r\n    \"FileSize\",\r\n    FileSize,\r\n    \"SHA256\",\r\n    SHA256\r\n),\r\n                  200\r\n              )\r\n        by NetworkMessageId;\r\nlet DeviceFiles =\r\n    DeviceFileEvents\r\n    | project DeviceId, FileName, SHA256, FolderPath, FileSize, DeviceFileTime = TimeGenerated;\r\nlet EmailWithDeviceMatches =\r\n    EmailWithAttachments\r\n    | mv-expand Attachments\r\n    | extend\r\n        FileName      = tostring(Attachments.AttachmentName),\r\n        FileSize      = todynamic(Attachments.FileSize),\r\n        SHA256        = tostring(Attachments.SHA256),\r\n        UserFragment  = replace_regex(tostring(split(RecipientEmailAddress, \"@\")[0]), @\"[\\.\\-_]\", \"\")\r\n    | join kind=inner (DeviceFiles) on SHA256\r\n    | where tolower(FolderPath) has tolower(UserFragment)\r\n        and FolderPath !has @\"\\AppData\"\r\n    | extend FileEvidence = pack(\"DeviceId\", DeviceId, \"FolderPath\", FolderPath, \"DeviceFileTime\", DeviceFileTime)\r\n    | extend Attachments  = pack(\"AttachmentName\", FileName, \"FileSize\", FileSize, \"SHA256\", SHA256, \"DeviceEvidence\", FileEvidence)\r\n    | summarize\r\n        EmailCount        = any(EmailCount),\r\n        TotalUrls         = any(TotalUrls),\r\n        Subjects          = any(Subjects),\r\n        SenderFromAddress = any(SenderFromAddress),\r\n        RecipientEmailAddress = any(RecipientEmailAddress),\r\n        HourBucket        = any(HourBucket),\r\n        Attachments       = make_set(Attachments, 200)\r\n        by NetworkMessageId\r\n    | extend TotalAttachments = array_length(Attachments);\r\nEmailWithDeviceMatches\r\n| summarize\r\n    Emails           = dcount(NetworkMessageId),\r\n    TotalAttachments = sum(TotalAttachments),\r\n    AllSubjects      = make_set(Subjects, 1000),\r\n    AllAttachments   = make_set(Attachments, 2000)\r\n    by RecipientEmailAddress, SenderFromAddress, ThreeHourBucket = bin(HourBucket, 24h)\r\n| where Emails >= 3\r\n| project\r\n    ThreeHourBucket,\r\n    Emails,\r\n    SenderFromAddress,\r\n    RecipientEmailAddress,\r\n    TotalAttachments,\r\n    AllSubjects,\r\n    AllAttachments\r\n| order by TotalAttachments desc"
query_type: kql
severity: medium
tactics:
    - TA0009
techniques:
    - T1114
tags:
    - kql
version: "2"
