id: 019a1838-526a-770c-be3c-046575b28600
name: WSUS Remote Code Execution Vulnerability CVE-2025-59287
description: This rule detects the execution of command-line interpreters (cmd.exe or powershell.exe) by either the w3wp.exe process (IIS worker process) or the wsusservice.exe process (Windows Server Update Services). This behavior can indicate a compromise, potentially leveraging vulnerabilities in web applications or WSUS to achieve remote code execution.
query: "DeviceProcessEvents\r\n| where(InitiatingProcessFileName == \"w3wp.exe\" or InitiatingProcessFileName == \"wsusservice.exe\")\r\n| where FileName has_any (\"cmd.exe\", \"powershell.exe\")\r\n| project Timestamp, DeviceId, DeviceName, FileName, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessCommandLine, InitiatingProcessParentFileName\r\n\r\n"
query_type: kql
severity: medium
tactics:
    - TA0002
techniques:
    - T1059
tags:
    - kql
version: "2"
references:
    - https://www.huntress.com/blog/exploitation-of-windows-server-update-services-remote-code-execution-vulnerability?utm_source=linkedin&utm_medium=social&utm_campaign=cy25-10-rr-edr-global-broad-all-windows_server_update&utm_content=Image
