id: 019a1021-b041-7635-a1fc-0267136e22c3
name: Powershell History Logging Disabled KQL
description: 'KQL Query from file: Powershell History Logging Disabled KQL'
query: "DeviceProcessEvents\r\n| where FileName == \"powershell.exe\"\r\n| where ProcessCommandLine has_all (\"Set-PSReadlineOption\",\"HistorySaveStyle\",\"SaveNothing\")"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1562.003
tags:
    - kql
version: "2"
references:
    - https://www.sentinelone.com/labs/phantomcaptcha-multi-stage-websocket-rat-targets-ukraine-in-single-day-spearphishing-operation/
