id: 019a78a3-6dad-758c-b311-8ac1c2017281
name: Hunting Kimsuky to Detect North Korea’s Stealthy JavaScript Dropper
description: Kimsuky continues to evolve its espionage toolkit with stealthy, fileless techniques. Their latest JavaScript dropper, disguised as Themes.js, leverages LOLBins, C2 over legitimate domains, and scheduled task persistence — all while staying under the radar.
query: "// Kimsuky JS Dropper Hunting Query\r\nlet C2Domains = dynamic([\"medianewsonline.com\", \"iuh234.medianewsonline.com\"]);\r\nlet SuspiciousPaths = dynamic([\"%APPDATA%\\\\Microsoft\\\\Windows\\\\Themes\\\\Themes.js\", \"C:\\\\Users\\\\Public\\\\*.tmp\", \"%TEMP%\\\\*.tmp\"]);\r\nlet LOLBins = dynamic([\"certutil.exe\", \"wscript.exe\", \"cscript.exe\"]);\r\nlet SuspiciousTasks = dynamic([\"Windows Theme Manager\"]);\r\n// Network to C2\r\nlet NetworkHits = DeviceNetworkEvents\r\n| where RemoteUrl has_any (C2Domains) or RemoteUrl contains \"dwnkl.php\" or RemoteUrl contains \"umprl.php\"\r\n| where ActionType in (\"ConnectionSuccess\", \"ConnectionAttemptFailed\")\r\n| extend IndicatorType = \"Network\";\r\n// File Creation (Themes.js or .tmp files)\r\nlet FileHits = DeviceFileEvents\r\n| where FileName =~ \"Themes.js\"\r\n| where FolderPath contains \"APPDATA\" or FolderPath contains \"TEMP\" or FolderPath contains \"Public\"\r\n| where ActionType == \"FileCreated\"\r\n| extend IndicatorType = \"File\";\r\n// Process Execution (LOLBins with suspicious args)\r\nlet ProcessHits = DeviceProcessEvents\r\n| where FileName in~ (LOLBins)\r\n| where ProcessCommandLine has_any (\"-decode\",\"-encode\", \"Themes.js\", \"dwnkl.php\", \"umprl.php\")\r\n| extend IndicatorType = \"Process Certutil/Wscript/Cscript\";\r\n// Process Execution (cmd spawn from Java)\r\nlet CMDProcessHits = DeviceProcessEvents\r\n| where ProcessCommandLine has_any (\"cmd /c systeminfo > \",\"cmd / c tasklist > \") or ProcessCommandLine has_all (\"cmd /c cd /d\",\" > \") \r\n| extend IndicatorType = \"CMD /c arguments\";\r\n// Scheduled Task Creation\r\nlet TaskHits = DeviceEvents\r\n| where ActionType == \"ScheduledTaskCreated\"\r\n| where AdditionalFields has_any (\"Windows Theme Manager\", \"Themes.js\")\r\n| extend IndicatorType = \"Task\";\r\nNetworkHits\r\n| union FileHits , ProcessHits, CMDProcessHits, TaskHits\r\n| summarize by IndicatorType, DeviceName,InitiatingProcessParentFileName,InitiatingProcessFileName,FileName, AccountName,FolderPath, InitiatingProcessFolderPath, ProcessCommandLine,InitiatingProcessCommandLine, RemoteUrl, ActionType,SHA256,InitiatingProcessSHA256\r\n// https://blog.pulsedive.com/dissecting-the-infection-chain-technical-analysis-of-the-kimsuky-javascript-dropper/\r\n"
query_type: kql
severity: medium
tactics:
    - TA0002
techniques:
    - T1041
tags:
    - kql
author: Aamir Muhammad
version: "2"
references:
    - https://blog.pulsedive.com/dissecting-the-infection-chain-technical-analysis-of-the-kimsuky-javascript-dropper/
