id: 019b4f17-7118-734a-abd1-a0d48a21d4c7
name: Microsoft TOAD Scam Attack
description: This rule detects inbound emails that appear to be Microsoft Teams invitations but contain suspicious keywords in the subject line related to financial transactions (invoice, billing, payment, renewal, charge). This could indicate a phishing attempt where adversaries leverage legitimate-looking Microsoft invitation emails to deliver financially themed lures.
query: "EmailEvents\r\n| where EmailDirection == \"Inbound\"\r\n| where SenderFromAddress == \"invites@microsoft.com\"\r\n| where Subject contains \"invited you to access applications\"\r\n   or Subject contains \"invited you to access\"\r\n| where Subject has_any (\"invoice\",\"billing\",\"payment\",\"renewal\",\"charge\")\r\n| project TimeGenerated, SenderFromAddress, SenderFromDomain, RecipientEmailAddress, Subject, ThreatTypes, DeliveryAction"
query_type: kql
severity: medium
tactics:
    - TA0001
techniques:
    - T1566
tags:
    - kql
version: "2"
