id: 019bc752-c0e7-71ce-8e70-7b18b9f231de
name: 'Detecting ConsentFix: The OAuth Phishing Attack That Bypasses MFA'
description: 'This attack shares a lot of similarities with ClickFix/FileFix, AiTM phishing, and OAuth Consent Phishing. You can think of this as a browser-native ClickFix attack that phishes an OAuth token on a target app by getting the victim to copy and paste a URL containing OAuth key material into a phishing page. '
query: "// 1. List of vulnerable apps\r\nlet VulnerableApps = datatable(AppName:string, TargetAppId:string)[\r\n    \"Microsoft Azure CLI\", \"04b07795-8ddb-461a-bbee-02f9e1bf7b46\",\r\n    \"Microsoft Azure PowerShell\", \"1950a258-227b-4e31-a9cf-717495945fc2\",\r\n    \"Microsoft Teams\", \"1fec8e78-bce4-4aaf-ab1b-5451cc387264\",\r\n    \"Microsoft Whiteboard Client\", \"57336123-6e14-4acc-8dcf-287b6088aa28\",\r\n    \"Microsoft Flow Mobile (GCCH/CN)\", \"57fcbcfa-7cee-4eb1-8b25-12d2030b4ee0\",\r\n    \"Enterprise Roaming and Backup\", \"60c8bde5-3167-4f92-8fdb-059f6176dc0\", \r\n    \"Visual Studio\", \"872cd9fa-d31f-45e0-9eab-6e460a02d1f1\",\r\n    \"Aadrm Admin Powershell\", \"90f610bf-206d-4950-b61d-37fa6fd1b224\",\r\n    \"Microsoft SharePoint Online Management Shell\", \"9bc3ab49-b65d-410a-85ad-de819febfddc\",\r\n    \"Microsoft Power Query for Excel\", \"a672d62c-fc7b-4e81-a576-e60dc46e951d\",\r\n    \"Visual Studio Code\", \"aebc6443-996d-45c2-90f0-388ff96faa56\"\r\n];\r\nlet Lookback = 1h; \r\nlet CorrelationWindow = 10m;\r\n//\r\n// 2. Gather Interactive Logins for ANY of the target apps\r\nlet InteractiveSignins = \r\n    SigninLogs\r\n    | where TimeGenerated > ago(Lookback)\r\n    // Filter strictly to our list of vulnerable apps\r\n    | where AppId in ((VulnerableApps | project TargetAppId))\r\n    | where ResultType == 0\r\n    | where IsInteractive == true\r\n    | project InteractiveTime = TimeGenerated, UserPrincipalName, VictimIP = IPAddress, VictimLocation = Location, AppId, SessionId, CorrelationId;\r\n// 3. Gather Non-Interactive Logins (Token Redemption)\r\nlet NonInteractiveSignins = \r\n    SigninLogs // Or AADNonInteractiveUserSignInLogs depending on your settings\r\n    | where TimeGenerated > ago(Lookback)\r\n    | where AppId in ((VulnerableApps | project TargetAppId))\r\n    | where ResultType == 0\r\n    | where IsInteractive == false\r\n    | project NonInteractiveTime = TimeGenerated, UserPrincipalName, AttackerIP = IPAddress, AttackerLocation = Location, AppId, SessionId, CorrelationId;\r\n// 4. Join and detect the IP mismatch\r\nInteractiveSignins\r\n| join kind=inner (NonInteractiveSignins) on UserPrincipalName, AppId\r\n| where NonInteractiveTime between (InteractiveTime .. (InteractiveTime + CorrelationWindow))\r\n| where VictimIP != AttackerIP\r\n// Join back to the datatable to get the friendly App Name\r\n| join kind=leftouter VulnerableApps on $left.AppId == $right.TargetAppId\r\n| extend TimeDelta = NonInteractiveTime - InteractiveTime\r\n| project \r\n    InteractiveTime,\r\n    NonInteractiveTime,\r\n    TimeDelta,\r\n    AppName, \r\n    AppId,\r\n    UserPrincipalName,\r\n    VictimIP,\r\n    VictimLocation,\r\n    AttackerIP,\r\n    AttackerLocation\r\n| sort by InteractiveTime desc"
query_type: kql
severity: medium
techniques:
    - T1190
    - T1649
    - T1556.009
    - T1078
tags:
    - kql
version: "2"
references:
    - https://pushsecurity.com/blog/consentfix
