id: 019b2cab-bfa3-7111-bbad-6ab394c7aafc
name: Suspicious Log.zip Created in TEMP (Infostealer Pattern)
description: Technique commonly used by Infostealers to compress data before its exfiltration
query: "DeviceFileEvents\r\n| where ActionType == \"FileCreated\"\r\n| where FileName =~ \"Log.zip\"\r\n| where FolderPath has_any (\"\\\\Temp\\\\\", \"\\\\AppData\\\\Local\\\\Temp\\\\\", \"%TEMP%\")\r\n| project Timestamp, DeviceName, FileName, FolderPath, FileSize,\r\n          InitiatingProcessFileName, InitiatingProcessCommandLine\r\n| extend AlertTitle = \"Suspicious Log.zip Created in TEMP (Infostealer Pattern)\",\r\n         Severity = \"High\",\r\n         MITRE_Technique = \"T1560.002 - Archive via Library\""
query_type: kql
severity: medium
techniques:
    - T1560.002
tags:
    - kql
version: "2"
references:
    - https://www.rapid7.com/blog/post/tr-santastealer-is-coming-to-town-a-new-ambitious-infostealer-advertised-on-underground-forums/
