id: 019ba04a-2bbf-75a8-ad5c-4c640b9d8e89
name: IOCs based Malicious email detection
description: This KQL look for any IOCs from the given list and compare against EmailEvents on Defender for Email
query: "let url = (externaldata(url: string )\r\n[@\"https://urlhaus.abuse.ch/downloads/text_online/\"]\r\nwith (format=\"txt\"))\r\n| project url;\r\nurl\r\n| join (EmailUrlInfo\r\n| where Timestamp > ago(2h) \r\n) on $left.url == $right.Url\r\n|join EmailEvents on NetworkMessageId\r\n|project Timestamp, NetworkMessageId, Url, UrlLocation, UrlDomain, SenderFromAddress, SenderDisplayName, SenderIPv4, Subject,RecipientEmailAddress, RecipientObjectId, LatestDeliveryAction, ThreatNames, ThreatTypes, DetectionMethods, DeliveryAction,ReportId\r\n\r\n"
query_type: kql
severity: medium
tags:
    - kql
version: "1"
