id: 019bfae2-6e9e-7251-84b3-bb95d0751c60
name: PDF24 DLL Side-Loading of Cryptbase.dll
description: |-
    Detects the legitimate 'pdf24.exe' process loading 'cryptbase.dll'
      from a non-standard directory. This is indicative of a DLL side-loading
      attack, a technique used by the PDFSIDER malware to achieve execution and
      bypass security controls.
query: |-
    // title: PDF24 DLL Side-Loading of Cryptbase.dll
    // description: Detects the legitimate 'pdf24.exe' process loading 'cryptbase.dll'
    //   from a non-standard directory. This is indicative of a DLL side-loading
    //   attack, a technique used by the PDFSIDER malware to achieve execution and
    //   bypass security controls.
    // author: Ramzi Z
    // falsepositives:
    //   - Legitimate use of PDF24, you need to check the DLL Hash
    // references:
    //   - https://www.resecurity.com/es/blog/article/pdfsider-malware-exploitation-of-dll-side-loading-for-av-and-edr-evasion
    //   - https://teams.microsoft.com/l/message/19:meeting_OTY5ZmVjYzYtZjAzYy00MTBmLTg2N2MtYjljMjY3YzA3Y2Q0@thread.v2/1769435725445?context=%7B%22contextType%22%3A%22chat%22%7D
    DeviceImageLoadEvents
    | where FileName has "cryptbase.dll" and InitiatingProcessFileName has "pdf24.exe"
query_type: kql
severity: medium
tags:
    - kql
author: Ramzi Z
version: "2"
references:
    - https://www.resecurity.com/es/blog/article/pdfsider-malware-exploitation-of-dll-side-loading-for-av-and-edr-evasion
    - https://teams.microsoft.com/l/message/19:meeting_OTY5ZmVjYzYtZjAzYy00MTBmLTg2N2MtYjljMjY3YzA3Y2Q0@thread.v2/1769435725445?context=%7B%22contextType%22%3A%22chat%22%7D
