id: 019bd1ab-9c9d-702d-942e-63355a3a3d19
name: malwarebytes-windows-github-io virustotal
description: This rule detects the presence or execution of known malicious infostealer files based on their SHA256 hash values or a specific filename pattern. The SHA256 hashes are associated with infostealer malware as referenced in a VirusTotal blog post. The filename pattern 'malwarebytes-windows-github-io' also indicates potential malicious activity, likely related to a deceptive download or execution.
query: "//https://blog.virustotal.com/2026/01/malicious-infostealer-january-26.html\r\n\r\nlet Sha256Indicators = dynamic([\r\n    \"6773af31bd7891852c3d8170085dd4bf2d68ea24a165e4b604d777bd083caeaa\",\r\n    \"4294d6e8f1a63b88c473fce71b665bbc713e3ee88d95f286e058f1a37d4162be\",\r\n    \"5591156d120934f19f2bb92d9f9b1b32cb022134befef9b63c2191460be36899\",\r\n    \"42d53bf0ed5880616aa995cad357d27e102fb66b2fca89b17f92709b38706706\",\r\n    \"5aa6f4a57fb86759bbcc9fc6c61b5f74c0ca74604a22084f9e0310840aa73664\",\r\n    \"84021dcfad522a75bf00a07e6b5cb4e17063bd715a877ed01ba5d1631cd3ad71\",\r\n    \"ca8467ae9527ed908e9478c3f0891c52c0266577ca59e4c80a029c256c1d4fce\",\r\n    \"9619331ef9ff6b2d40e77a67ec86fc81b050eeb96c4b5f735eb9472c54da6735\",\r\n    \"a2842c7cfaadfba90b29e0b9873a592dd5dbea0ef78883d240baf3ee2d5670c5\",\r\n    \"4705fd47bf0617b60baef8401c47d21afb3796666092ce40fbb7fe51782ae280\",\r\n    \"580d37fc9d9cc95dc615d41fa2272f8e86c9b4da2988a336a8b3a3f90f4363c2\",\r\n    \"d47fd17d1d82ea61d850ccc2af3bee54adce6975d762fb4dee8f4006692c5ef7\",\r\n    \"606baa263e87d32a64a9b191fc7e96ca066708b2f003bde35391908d3311a463\",\r\n    \"fd855aa20467708d004d4aab5203dd5ecdf4db2b3cb2ed7e83c27368368f02bb\",\r\n    \"a0687834ce9cb8a40b2bb30b18322298aff74147771896787609afad9016f4ea\",\r\n    \"4235732440506e626fd4d0fffad85700a8fcf3e83ba5c5bc8e19ada508a6498e\",\r\n    \"cd1fe2762acf3fb0784b17e23e1751ca9e81a6c0518c6be4729e2bc369040ca5\",\r\n    \"f798c24a688d7858efd6efeaa8641822ad269feeb3a74962c2f7c523cf8563ff\",\r\n    \"0698a2c6401059a3979d931b84d2d4b011d38566f20558ee7950a8bf475a6959\",\r\n    \"1b3bee041f2fffcb9c216522afa67791d4c658f257705e0feccc7573489ec06f\",\r\n    \"231c05f4db4027c131259d1acf940e87e15261bb8cb443c7521294512154379b\",\r\n    \"ec2e30d8e5cacecdf26c713e3ee3a45ebc512059a64ba4062b20ca8bec2eb9e7\",\r\n    \"58bd2e6932270921028ab54e5ff4b0dbd1bf67424d4a5d83883c429cadeef662\",\r\n    \"57ed35e6d2f2d0c9bbc3f17ce2c94946cc857809f4ab5c53d7cb04a4e48c8b14\",\r\n    \"cfcf3d248100228905ad1e8c5849bf44757dd490a0b323a10938449946eabeee\",\r\n    \"f02be238d14f8e248ad9516a896da7f49933adc7b36db7f52a7e12d1c2ddc6af\",\r\n    \"f60802c7bec15da6d84d03aad3457e76c5760e4556db7c2212f08e3301dc0d92\",\r\n    \"02dc9217f870790b96e1069acd381ae58c2335b15af32310f38198b5ee10b158\",\r\n    \"f9549e382faf0033b12298b4fd7cd10e86c680fe93f7af99291b75fd3d0c9842\",\r\n    \"92f4d95938789a69e0343b98240109934c0502f73d8b6c04e8ee856f606015c8\",\r\n    \"66fba00b3496d61ca43ec3eae02527eb5222892186c8223b9802060a932a5a7a\",\r\n    \"e5dd464a2c90a8c965db655906d0dc84a9ac84701a13267d3d0c89a3c97e1e9b\",\r\n    \"35211074b59417dd5a205618fed3402d4ac9ca419374ff2d7349e70a3a462a15\",\r\n    \"6863b4906e0bd4961369b8784b968b443f745869dbe19c6d97e2287837849385\",\r\n    \"a83c478f075a3623da5684c52993293d38ecaa17f4a1ddca10f95335865ef1e2\",\r\n    \"43e2936e4a97d9bc43b423841b137fde1dd5b2f291abf20d3ba57b8f198d9fab\",\r\n    \"f001ae3318ba29a3b663d72b5375d10da5207163c6b2746cfae9e46a37d975cf\",\r\n    \"c67403d3b6e7750222f20fa97daa3c05a9a8cce39db16455e196cd81d087b54d\",\r\n    \"5ee9d4636b01fd3a35bd8e3dce86a8c114d8b0aa6b68b1d26ace7ef0f85b438a\",\r\n    \"e84b0dadb0b6be9b00a063ed82c8ddba06a2bd13f07d510d14e6fd73cd613fba\"\r\n]);\r\nunion isfuzzy=true\r\n    DeviceFileEvents,\r\n    DeviceProcessEvents\r\n| where SHA256 in (Sha256Indicators) or FileName startswith \"malwarebytes-windows-github-io\"\r\n| project\r\n    Timestamp,\r\n    DeviceName,\r\n    FileName,\r\n    FolderPath,\r\n    SHA256,\r\n    InitiatingProcessFileName,\r\n    InitiatingProcessFolderPath,\r\n    ActionType\r\n| order by Timestamp desc"
query_type: kql
severity: medium
tactics:
    - TA0006
    - TA0009
techniques:
    - T1003
    - T1056
    - T1552
tags:
    - kql
version: "2"
references:
    - https://blog.virustotal.com/2026/01/malicious-infostealer-january-26.html
