id: 019b2659-4603-735d-b0a4-d810f8035684
name: Tracking USB Data Transfers with Microsoft Defender
description: "Visibility into how much data is being copied to USB devices in your environment? Here’s a KQL query that correlates USB mount events with file creation activity to identify potential data exfiltration.\n\n\U0001F449 What this query does:\n\n1. Detects when a USB drive is mounted\n2. Correlates it with file creation events on removable media\n3. Calculates the total data transferred per user\n4. Highlights the Top 5 users by data volume\n5. Visualizes the result as a pie chart for quick insights \n\n\U0001F575\U0001F3FB‍♀️This is especially useful for:\n\n1. Insider risk investigations\n2. DLP and data exfiltration monitoring\n3. Threat hunting scenarios\n\n\U0001F4A1 Pro tip:\nIf you remove the last three lines (the summarize, top, and render piechart), the query becomes compatible with a Custom Detection Rule in Microsoft Defender.\n\n\U0001F511That means you can:\n\n1. Trigger alerts automatically\n2. Enable remediation actions (like isolating a device or initiating investigation)"
query: "let UsbDriveMount = DeviceEvents \n| where Timestamp > ago(7d) \n| where ActionType == \"UsbDriveMounted\" \n| extend ParsedFields =parse_json(AdditionalFields) \n| project DeviceId, DeviceName, DriveLetter = ParsedFields.DriveLetter, MountTime = Timestamp, ProductName = ParsedFields.ProductName, SerialNumber = ParsedFields.SerialNumber, Manufacturer = ParsedFields.Manufacturer \n| order by DeviceId asc, MountTime desc; let FileCreation = DeviceFileEvents \n| where InitiatingProcessAccountName != \"system\" | where ActionType == \"FileCreated\" \n| where FolderPath !startswith \"C:\\\\\" | where FolderPath !startswith \"\\\\\" \n| project ReportId, DeviceId, InitiatingProcessAccountDomain, InitiatingProcessAccountName, InitiatingProcessAccountUpn, FileName, FolderPath, SHA256, Timestamp, SensitivityLabel, IsAzureInfoProtectionApplied, FileSize \n| extend GB = FileSize / (1024 * 1024 * 1024) \n| order by DeviceId asc, Timestamp desc; FileCreation \n| lookup kind=inner (UsbDriveMount) on DeviceId \n| where FolderPath startswith DriveLetter \n| where Timestamp >= MountTime \n| summarize totalFileSize = sum(FileSize), min(Timestamp) by InitiatingProcessAccountUpn, DeviceId, ReportId, Timestamp, FolderPath, FileSize | where totalFileSize > 1000000000 \n| project InitiatingProcessAccountUpn, FolderPath, FileSize, DeviceId, Timestamp, ReportId, totalFileSize \n| summarize TotalBytes = sum(FileSize) by InitiatingProcessAccountUpn \n| extend TotalGB = round(TotalBytes / 1024 / 1024 / 1024, 2) \n| top 5 by TotalGB desc \n| render piechart"
query_type: kql
severity: medium
tags:
    - kql
version: "15"
