id: 019b9dfa-9b56-7345-b8fc-135bc1c0d562
name: AI-Generated Detection Rule
description: Detection rule generated by AI system
query: "DeviceProcessEvents\r\n| where \r\n    (InitiatingProcessFileName == @\"powershell.exe\" and \r\n     (ProcessCommandLine contains \"iwr https://2fa-bns.com/\" or \r\n      ProcessCommandLine contains \"Start-BitsTransfer -Source 'https://2fa-bns.com/\" or \r\n      ProcessCommandLine contains \"Set-MpPreference -DisableRealtimeMonitoring\" or \r\n      ProcessCommandLine contains \"Add-MpPreference -ExclusionPath\" or \r\n      ProcessCommandLine contains \"Add-MpPreference -ExclusionExtension\" or \r\n      ProcessCommandLine contains \"start https://admin.booking.com\" or \r\n      ProcessCommandLine contains \"gci C:\\\\ -filter msbuild.exe\")) \r\n    or \r\n    (FileName == @\"msbuild.exe\" and ProcessCommandLine contains \"v.proj\" and FolderPath contains \"ProgramData\") \r\n    or \r\n    (FileName in~ (\"staxs.exe\", \"tybd7.exe\", \"Wwigu.exe\") and (FolderPath contains \"ProgramData\" or FolderPath contains \"Temp\")) \r\n    or \r\n    (FileName == @\"aspnet_compiler.exe\" and InitiatingProcessFileName in~ (\"staxs.exe\", \"tybd7.exe\"))\r\n| project Timestamp, DeviceName, FileName, FolderPath, ProcessCommandLine, InitiatingProcessFileName, SHA256\r\n| union (\r\n    DeviceNetworkEvents\r\n    | where \r\n        (RemoteUrl contains \"low-house.com\" or \r\n         RemoteUrl contains \"oncameraworkout.com\" or \r\n         RemoteUrl contains \"2fa-bns.com\" or \r\n         RemoteUrl contains \"asj77.com\" or \r\n         RemoteUrl contains \"asj88.com\" or \r\n         RemoteUrl contains \"asj99.com\" or \r\n         RemoteUrl contains \"wmk77.com\" or \r\n         RemoteUrl contains \"8eh18dhq9wd.click\") \r\n        or \r\n        (RemoteIP in~ (\"194.169.163.140\", \"193.221.200.233\", \"13.223.25.84\") and RemotePort == 3535)\r\n    | project Timestamp, DeviceName, RemoteUrl, RemoteIP, RemotePort, InitiatingProcessFileName\r\n)\r\n| union (\r\n    DeviceFileEvents\r\n    | where \r\n        (FileName =~ \"v.proj\" and FolderPath contains \"ProgramData\") or \r\n        (FileName in~ (\"staxs.exe\", \"tybd7.exe\", \"Wwigu.exe\", \"Lbpyjxefa.dll\") and (FolderPath contains \"ProgramData\" or FolderPath contains \"Temp\")) or \r\n        (FileName in~ (\"DeleteApp.url\", \"update.lnk\") and (FolderPath contains \"Startup\")) or \r\n        (FileName == @\"pins.dat\" and FolderPath contains \"ProgramData\") or \r\n        SHA256 in~ (\"cd3604fb9fe210261de11921ff1bea0a7bf948ad477d063e17863cede1fadc41\", \"bf374d8e2a37ff28b4dc9338b45bbf396b8bf088449d05f00aba3c39c54a3731\", \"91696f9b909c479be23440a9e4072dd8c11716f2ad3241607b542b202ab831ce\")\r\n    | project Timestamp, DeviceName, FileName, FolderPath, SHA256, InitiatingProcessFileName\r\n)\r\n| order by Timestamp desc"
query_type: kql
severity: medium
tags:
    - kql
author: AwaisM
version: "3"
