id: 019b0ce0-f4f6-71a8-a3b2-94869425ea01
name: Executable with Single Character Filename
description: This rule detects the creation or modification of executable files with a single-character filename followed by '.exe' (e.g., 'a.exe', 'b.exe'). This pattern is often used by adversaries to evade detection or to make malicious files less conspicuous. The rule specifically excludes 'R for Windows front-end' to reduce false positives related to legitimate software.
query: "DeviceProcessEvents\r\n|where Timestamp > ago(30d)\r\n| where FileName matches regex @\"^.\\.exe$\"  // Single char + .exe\r\n|invoke FileProfile(SHA256,1000)\r\n| where ProcessVersionInfoFileDescription != @\"R for Windows front-end\""
query_type: kql
severity: medium
tactics:
    - TA0002
techniques:
    - DS0009
    - DS0022
tags:
    - kql
version: "1"
