id: 019b7c56-df35-73b5-97cf-47a1c247e957
name: Suspicious Browser Popups from Windows Toast Notification
description: |-
    This detection aims to identify suspicious popup activity on devices by analyzing process events that launch notifications. The query focuses on detecting referrers that generate multiple unique popup URLs, which could indicate potentially malicious behavior.

    You can use this to check for potential browser popups generated by malicious sites gaining notification permission on a browser before they lead to further compromise of a host.
query: "let Exclusions = dynamic([\"web.whatsapp.com\",\"www.youtube.com\"]); // Exclude known legitimate referrers to reduce false positives\r\nlet Timeframe = 30d; // Limit the analysis to a specific timeframe for relevance and performance\r\nlet SuspiciousPopup = DeviceProcessEvents\r\n| where TimeGenerated >= ago(Timeframe) // Focus on recent events within the specified timeframe\r\n| where ProcessCommandLine contains \"--notification-launch-\" // Identify processes launching notifications, which could indicate suspicious popups\r\n| extend parsedurl = parse_url(ProcessCommandLine) // Extract URL components for further analysis\r\n| extend Referrer = tostring(parsedurl.Host) // Identify the referrer domain to track the source of popups\r\n| where not(Referrer has_any (Exclusions)) // Remove known legitimate referrers to focus on potentially malicious ones\r\n| extend PopupURL = tostring(parsedurl.Fragment) // Extract the specific popup URL for analysis and comparison\r\n| project Timestamp, Referrer, PopupURL, DeviceName, DeviceId, ReportId // Select relevant columns for the analysis\r\n| extend DestinationParse = parse_url(PopupURL) // Extract URL components of the popup URL for further analysis\r\n| extend DestinationDomain = tostring(DestinationParse.Host) // Identify the destination domain of the popup URL\r\n| extend DestinationMismatch = iif(Referrer != DestinationDomain, true, false) // Check if the referrer and destination domains are different, which could indicate suspicious behavior\r\n| summarize DistinctURIs=dcount(PopupURL) by Referrer, DeviceId, DeviceName // Count distinct popup URLs for each referrer and device to identify patterns\r\n| where DistinctURIs > 2; // Filter referrers with more than 2 distinct popup URLs, as multiple unique popups from the same referrer are more likely to be suspicious\r\nSuspiciousPopup\r\n| join ( // Join with a subquery to gather additional details about the suspicious popups\r\n    DeviceProcessEvents\r\n        | where TimeGenerated >= ago(Timeframe) // Ensure the subquery is also limited to the specified timeframe\r\n        | where ProcessCommandLine contains \"--notification-launch-\" // Identify processes launching notifications, consistent with the main query\r\n        | extend parsedurl = parse_url(ProcessCommandLine) // Extract URL components for further analysis\r\n        | project Referrer2 = tostring(parsedurl.Host), Fragment = tostring(parsedurl.Fragment) // Select the referrer and fragment columns for joining and aggregation\r\n        )\r\n        on $left.Referrer == $right.Referrer2 // Join the main query with the subquery based on the referrer to combine related information\r\n        | summarize UniqueURIs=make_set(Fragment) by Referrer, DeviceId, DeviceName // Aggregate the unique popup URLs for each referrer and device, along with the count of distinct URIs\r\n        | extend UniqueURICount=array_length(UniqueURIs) //show a count for the number of unique URIs seen"
query_type: kql
severity: medium
techniques:
    - T1566.002
    - T1176
    - T1036
tags:
    - kql
author: Chris Scott
version: "4"
