id: 019bff20-0646-779c-a48a-0958eb19a56b
name: ' CoolClient Clipboard Monitor Storage AppxProvisioning.xml File Creation '
description: Monitors for the creation of 'C:\ProgramData\AppxProvisioning.xml'. The updated CoolClient backdoor, used by the HoneyMyte APT group, uses this specific file path to store XOR-encrypted clipboard and active window monitoring data.
query: "DeviceFileEvents\r\n| where ActionType == \"FileCreated\"\r\n| where FolderPath =~ 'C:\\\\ProgramData\\\\AppxProvisioning.xml'\r\n| project\r\n    TimeGenerated,\r\n    DeviceName,\r\n    ActionType,\r\n    FileName,\r\n    FolderPath,\r\n    InitiatingProcessFileName,\r\n    InitiatingProcessCommandLine,\r\n    InitiatingProcessParentFileName,\r\n    SHA1,\r\n    SHA256\r\n"
query_type: kql
severity: medium
techniques:
    - T1115
    - T1056.001
tags:
    - kql
author: Kaung Khant Ko
version: "1"
references:
    - https://securelist.com/honeymyte-updates-coolclient-uses-browser-stealers-and-scripts/118664/
