id: 019cd69e-9a22-723a-b784-444c730e7875
name: Possible ASUS Malware Mutex Detection
description: This rule detects the creation or interaction with mutexes that contain both 'asus_' and '_v' in their names. This pattern has been observed in malware associated with ASUS systems, potentially indicating the presence of malicious software attempting to establish a unique identifier on the compromised system.
query: "DeviceEvents\r\n| where ActionType contains \"Mutex\"\r\n| where AdditionalFields has \"asus_\" and AdditionalFields has \"_v\"\r\n| project TimeGenerated, DeviceName, ActionType, InitiatingProcessFileName, InitiatingProcessCommandLine, AdditionalFields\r\n"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1480.002
tags:
    - kql
version: "2"
