id: 019c5143-2be7-765f-9d0b-4d41499ff6d6
name: Notepad.exe Executing Markdown from WindowsApps (Excluding Specific Version)
description: This rule detects the execution of 'notepad.exe' specifically when it is launched from the WindowsApps directory (excluding version '11.2510') and its command line arguments include the string '.md'. This combination suggests an attempt to open or process Markdown files using a specific, potentially non-standard, version of Notepad. This could indicate unusual user activity, a misconfigured application, or potentially malicious activity involving Markdown files, such as data exfiltration or execution of embedded content.
query: "DeviceProcessEvents\r\n| where Timestamp > ago(1h)\r\n| where InitiatingProcessFileName has \"notepad.exe\"\r\n| where FolderPath has \"\\\\Program Files\\\\WindowsApps\\\\Microsoft.WindowsNotepad\" \r\n and FolderPath !has \"11.2510\"\r\n| where InitiatingProcessCommandLine has \".md\""
query_type: kql
severity: medium
tactics:
    - TA0002
techniques:
    - T1204
tags:
    - kql
author: Steven Lim
version: "5"
