id: 019c6c62-cfa9-77cc-931f-fd67fbd303a6
name: Nslookup and Findstr Combination for Remote System Discovery
description: This rule detects the execution of `nslookup` and `findstr` together in a command line, specifically looking for non-private IP addresses. This combination can indicate an adversary attempting to discover remote systems or exfiltrate data by encoding it within DNS queries, often seen in DNS tunneling or data staging activities.
query: "DeviceProcessEvents\r\n| where Timestamp > ago(1h)\r\n| extend DeobfuscatedCL = tostring(parse_command_line(tolower(InitiatingProcessCommandLine),\"windows\"))\r\n| where DeobfuscatedCL has \"nslookup\" and DeobfuscatedCL has \"findstr\"\r\n| extend IP = extract(\"([0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3})\", 1, DeobfuscatedCL)\r\n| where isnotempty(IP) and not(ipv4_is_private(IP))"
query_type: kql
severity: medium
tactics:
    - TA0007
techniques:
    - T1018
tags:
    - kql
author: Steven Lim
version: "9"
