id: 019c8bfb-3c8e-73d6-bed9-544cd83990f3
name: 'Devices with Specified Vulnerable Software Installed '
description: This query identifies devices that have specific software installed, enriching this information with device details like OS, exposure level, and internet-facing status. This is useful for asset inventory and identifying potentially exposed endpoints, especially when vulnerability information might not be immediately available through other means. The current rule is configured to detect "Acronis Cyber Protect" software.
query: "// Name: Devices with  any specified vulnerable software Installed.\n// Author: Subash Ghimire\n// Description: This query identifies devices that have  any specified software installed. It enriches this information with device details like OS, exposure level, and internet-facing status. This is useful for asset inventory and identifying potentially exposed endpoints. This KQl can be useful in a scenario where defender is not updated on the vulnerability and it not able to give the list of affected devices with the affected software in use that has the vulnerability.\nDeviceTvmSoftwareInventory\n// Filter for the specific software that you wish to identify. \n| where SoftwareVendor has \"Acronis\" and SoftwareName has \"cyber_protect\"\n| join kind=inner (\n    DeviceInfo\n    | where IsInternetFacing == true    //Comment this out if you want to see all the devices affected that are not internet facing.\n    | project DeviceId, DeviceName, OSPlatform, ExposureLevel, IsInternetFacing, RegistryDeviceTag\n) on DeviceId\n// Aggregate results to show one line per device, summarizing the findings.\n| summarize\n    AffectedSoftware = make_set(\n        // Combine software name and version into a single string.\n        strcat(SoftwareName, iff(isnotempty(SoftwareVersion), strcat(\" v\", SoftwareVersion), \"\"))\n    ),\n    OSPlatform = take_any(OSPlatform),\n    // Use max() to highlight the highest exposure level and to flag if the device is internet-facing (true > false).\n    ExposureLevel = max(ExposureLevel),\n    IsInternetFacing = max(IsInternetFacing),\n    RegistryDeviceTag = take_any(RegistryDeviceTag)\n  by DeviceId, DeviceName\n| project-reorder DeviceName, DeviceId, AffectedSoftware, OSPlatform, ExposureLevel, IsInternetFacing, RegistryDeviceTag\n"
query_type: kql
severity: medium
tags:
    - kql
version: "6"
