id: 019c8e3e-745b-72cd-ad40-712d366d26c8
name: AiFrame Malicious Browser Extension Activity
description: This query detects network traffic and file events associated with the "AiFrame" malicious browser extension campaign. These extensions pose as AI assistants but exfiltrate user data via remotely controlled iframes.
query: "let MaliciousDomains = dynamic([\r\n    \"tapnetic.pro\",\r\n    \"onlineapp.pro\"\r\n]);\r\nlet MaliciousExtensionIDs = dynamic([\r\n    \"nlhpidbjmmffhoogcennoiopekbiglbp\", \"gcfianbpjcfkafpiadmheejkokcmdkjl\", \"fppbiomdkfbhgjjdmojlogeceejinadg\",\r\n    \"djhjckkfgancelbmgcamjimgphaphjdl\", \"llojfncgbabajmdglnkbhmiebiinohek\", \"gghdfkafnhfpaooiolhncejnlgglhkhe\",\r\n    \"cgmmcoandmabammnhfnjcakdeejbfimn\", \"phiphcloddhmndjbdedgfbglhpkjcffh\", \"pgfibniplgcnccdnkhblpmmlfodijppg\",\r\n    \"nkgbfengofophpmonladgaldioelckbe\", \"gcdfailafdfjbailcdcbjmeginhncjkb\", \"ebmmjmakencgmgoijdfnbailknaaiffh\",\r\n    \"baonbjckakcpgliaafcodddkoednpjgf\", \"fdlagfnfaheppaigholhoojabfaapnhb\", \"gnaekhndaddbimfllbgmecjijbbfpabc\",\r\n    \"hgnjolbjpjmhepcbjgeeallnamkjnfgi\", \"lodlcpnbppgipaimgbjgniokjcnpiiad\", \"cmpmhhjahlioglkleiofbjodhhiejhei\",\r\n    \"bilfflcophfehljhpnklmcelkoiffapb\", \"cicjlpmjmimeoempffghfglndokjihhn\", \"ckneindgfbjnbbiggcmnjeofelhflhaj\",\r\n    \"dbclhjpifdfkofnmjfpheiondafpkoed\", \"ecikmpoikkcelnakpgaeplcjoickgacj\", \"kepibgehhljlecgaeihhnmibnmikbnga\",\r\n    \"ckicoadchmmndbakbokhapncehanaeni\", \"fnjinbdmidgjkpmlihcginjipjaoapol\", \"gohgeedemmaohocbaccllpkabadoogpl\",\r\n    \"flnecpdpbhdblkpnegekobahlijbmfok\", \"acaeafediijmccnjlokgcdiojiljfpbe\", \"kblengdlefjpjkekanpoidgoghdngdgl\",\r\n    \"idhknpoceajhnjokpnbicildeoligdgh\", \"fpmkabpaklbhbhegegapfkenkmpipick\"\r\n]);\r\nunion isfuzzy=true (\r\n    DeviceNetworkEvents\r\n    | where InitiatingProcessFileName in~ (\"chrome.exe\", \"msedge.exe\", \"firefox.exe\", \"brave.exe\")\r\n    | where RemoteUrl has_any (MaliciousDomains) or RemoteIP has_any (MaliciousDomains) // has_any is used to catch subdomains\r\n    | extend MatchedIOC = RemoteUrl, DetectionMethod = \"Network Connection to C2 Domain\"\r\n    | project-reorder Timestamp, DeviceName, DetectionMethod, MatchedIOC, InitiatingProcessFileName, RemoteUrl, RemoteIP, InitiatingProcessCommandLine\r\n),\r\n(\r\n    DeviceFileEvents\r\n    | where ActionType in (\"FileCreated\", \"FileRenamed\")\r\n    | where FolderPath has_any (MaliciousExtensionIDs)\r\n    | extend MatchedIOC = extract(\"([a-z]{32})\", 1, FolderPath), DetectionMethod = \"Malicious Extension File Detected\"\r\n    | project-reorder Timestamp, DeviceName, DetectionMethod, MatchedIOC, FileName, FolderPath, InitiatingProcessFileName\r\n)\r\n| summarize\r\n    StartTime = min(Timestamp),\r\n    EndTime = max(Timestamp),\r\n    any(DetectionMethod),\r\n    make_set(MatchedIOC),\r\n    make_set(InitiatingProcessFileName),\r\n    any(InitiatingProcessCommandLine),\r\n    any(RemoteUrl),\r\n    any(RemoteIP),\r\n    any(FileName),\r\n    any(FolderPath)\r\n    by DeviceName, bin(Timestamp, 1h)\r\n"
query_type: kql
severity: medium
techniques:
    - T1189
tags:
    - kql
version: "2"
references:
    - https://layerxsecurity.com/blog/aiframe-fake-ai-assistant-extensions-targeting-260000-chrome-users-via-injected-iframes/
