id: 019c676b-4007-7468-b5d0-ab13426f42c2
name: ClickFix Nslookup Abuse Detection
description: https://www.bleepingcomputer.com/news/security/new-clickfix-attack-abuses-nslookup-to-retrieve-powershell-payload-via-dns/
query: "DeviceProcessEvents\r\n| where Timestamp > ago(1h)\r\n| where InitiatingProcessCommandLine has \"nslookup\" and InitiatingProcessCommandLine has \"findstr\"\r\n| extend IP = extract(\"([0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3})\", 1, InitiatingProcessCommandLine)\r\n| where isnotempty(IP) and not(ipv4_is_private(IP))"
query_type: kql
severity: medium
tactics:
    - TA0011
    - TA0002
techniques:
    - T1071.004
    - T1059
tags:
    - kql
author: Steven Lim
version: "2"
