id: 019cbf71-a042-75fb-9670-c865563fd276
name: Untitled Detection
description: KQL Query
query: "SigninLogs\r\n| where TimeGenerated > ago(90d)\r\n| where tostring(UserAgent) has_any (\"azurehound\",\"bloodhound\",\"stormspotter\",\"graphrunner\",\"msolspray\",\"aadspray\",\"rubeus\",\"roadtools\",\"roadrecon\",\r\n\"azuread_decrypt\",\"dirscraper\",\"graphscrape\",\"graphprobe\",\"o365recon\",\"graphpowershell\",\"aadinternals\",\"axios\")\r\n| project Identity,ResultDescription,Location,AppDisplayName,AuthenticationRequirement,ClientAppUsed,IPAddress,RiskDetail,RiskEventTypes,UserAgent\r\n| summarize by Identity,ResultDescription,Location,AppDisplayName,AuthenticationRequirement,ClientAppUsed,IPAddress,RiskDetail,RiskEventTypes,UserAgent"
query_type: kql
severity: medium
tags:
    - kql
version: "1"
