id: 019cff99-545e-7099-969c-7a9d262b640b
name: LampoRAT – Payload Detection
description: |+
    Detects LampoRAT malware based on known file hash execution.

query: "DeviceFileEvents\r\n| where SHA256 == \"81a6e6416eb7ab6ce6367c6102c031e2ae2730c3c50ab9ce0b8668fec3487848\"\r\n| project TimeGenerated, DeviceName, FileName, FolderPath\r\n"
query_type: kql
severity: medium
tags:
    - kql
version: "1"
