id: 019c2a46-f2a3-769d-9e77-119c3118aab7
name: Successful Azure AD Sign-in from Suspicious User-Agent Outside ANZ
description: This rule detects successful sign-ins to Azure Active Directory (AAD) from IP addresses outside of New Zealand and Australia, where the User-Agent string matches a list of known suspicious User-Agents. It filters out many legitimate User-Agents to reduce false positives, including those from Microsoft applications, mobile devices, and common system services. The rule aims to identify potential unauthorized access attempts or compromised accounts leveraging unusual client software or scripts.
query: "let suspiciousUserAgents = externaldata(http_user_agent: string)[@\"https://raw.githubusercontent.com/mthcht/awesome-lists/main/Lists/suspicious_http_user_agents_list.csv\"] \r\n    with (format=\"csv\", ignoreFirstRecord=True)\r\n| project http_user_agent \r\n| extend http_user_agent = tostring(http_user_agent)\r\n| extend http_user_agent = replace_string(http_user_agent, \"/*\", \"\"); // Remove forward slashes and asterisks\r\nlet queryInterval = 1h;\r\nunion AADNonInteractiveUserSignInLogs, SigninLogs\r\n| where TimeGenerated >= ago(queryInterval)\r\n| where UserAgent has_any (suspiciousUserAgents) \r\n| extend AuthenticationResult = iff(ResultType == 0, \"Success\", \"Failure\")\r\n| where AuthenticationResult contains \"Success\"\r\n| extend geoinfo = geo_info_from_ip_address(IPAddress)\r\n| extend Country = tostring(geoinfo.country)\r\n| where Country !in (\"New Zealand\", \"Australia\")\r\n// Filter out known legitimate user agents\r\n| where not(UserAgent startswith \"Mozilla/\")\r\n| where not(UserAgent startswith \"azsdk-python-identity/\")\r\n| where not(UserAgent startswith \"azsdk-net-Identity/\")\r\n| where not(UserAgent startswith \"Microsoft%20Teams/\")\r\n| where not(UserAgent startswith \"Microsoft%20Teams%20classic/\")\r\n| where not(UserAgent startswith \"Microsoft.Data.Mashup\")\r\n| where not(UserAgent startswith \"Microsoft%20Authenticator/\")\r\n| where not(UserAgent startswith \"NONISV|SharePointPnP|PnPCore/\")\r\n| where not(UserAgent startswith \"Mac%20SSO%20Extension/\")\r\n| where not(UserAgent startswith \"Company%20Portal/\")\r\n| where not(UserAgent startswith \"Go-http-client/\")\r\n| where not(UserAgent startswith \"accountsd/\")\r\n| where not(UserAgent startswith \"PAN GlobalProtect/\")\r\n| where not(UserAgent startswith \"Microsoft ASP.NET Core OpenIdConnect handler\")\r\n| where not(UserAgent startswith \"BAV2ROPC\")\r\n| where not(UserAgent startswith \"Microsoft SkyDriveSync\" and UserAgent contains \"Windows NT\") //OneDrive sync agent\r\n| where not(UserAgent startswith \"lua-resty-http\" and UserAgent contains \"ngx_lua\") // ServiceNow Teams integration\r\n// Exclude mobile user agents\r\n| where not(UserAgent startswith \"Dalvik/\" and UserAgent contains \" (Linux; U; Android \")\r\n| where not(UserAgent startswith \"Outlook/\" and (UserAgent contains \" ;iPhone\" or UserAgent contains \" ;iPad\"))\r\n| where not(UserAgent startswith \"TeamSpaceShareExtension/\" and (UserAgent contains \" ;iPhone\" or UserAgent contains \" ;iPad\"))\r\n| where not(UserAgent startswith \"AuthenticatorSSOExtension/\" and (UserAgent contains \" ;iPhone\" or UserAgent contains \" ;iPad\"))\r\n| where not(UserAgent startswith \"SharePoint/\" and (UserAgent contains \" ;iPhone\" or UserAgent contains \" ;iPad\"))\r\n| where not(UserAgent startswith \"OneNote/\" and (UserAgent contains \" ;iPhone\" or UserAgent contains \" ;iPad\"))\r\n| where not(UserAgent startswith \"OfficeLens/\" and (UserAgent contains \" ;iPhone\" or UserAgent contains \" ;iPad\"))\r\n| where not(UserAgent startswith \"ControlFilter/\" and (UserAgent contains \" ;iPhone\" or UserAgent contains \" ;iPad\"))\r\n| where not(UserAgent startswith \"Settings/\" and (UserAgent contains \" ;iPhone\" or UserAgent contains \" ;iPad\" or UserAgent contains \"Darwin/\"))\r\n| where not(UserAgent startswith \"OneDrive/\" and (UserAgent contains \" ;iPhone\" or UserAgent contains \" ;iPad\" or UserAgent contains \"Darwin/\"))\r\n| where not(UserAgent startswith \"Designer/\" and (UserAgent contains \" ;iPhone\" or UserAgent contains \" ;iPad\" or UserAgent contains \"Darwin/\"))\r\n| where not(UserAgent startswith \"Office/\" and (UserAgent contains \" ;iPhone\" or UserAgent contains \" ;iPad\" or UserAgent contains \"Darwin/\"))\r\n| where not(UserAgent startswith \"Microsoft%20Defender%20for%20Endpoint/\" and (UserAgent contains \" ;iPhone\" or UserAgent contains \" ;iPad\" or UserAgent contains \"Darwin/\"))\r\n| where not(UserAgent startswith \"Cortex/\" and UserAgent contains \"Darwin/\")\r\n| where not(UserAgent startswith \"InternetAccountsSettingsExtension/\" and UserAgent contains \"Darwin/\")\r\n| where not(UserAgent startswith \"Calendar/\" and UserAgent contains \"Darwin/\")\r\n// project results\r\n| project TimeGenerated,Type,UserPrincipalName,UserAgent,IPAddress,Country,MfaDetail_dynamic"
query_type: kql
tactics:
    - TA0005
    - TA0003
    - TA0004
    - TA0001
    - TA0011
techniques:
    - T1078
    - T1133
    - T1071.001
tags:
    - kql
version: "3"
references:
    - https://raw.githubusercontent.com/mthcht/awesome-lists/main/Lists/suspicious_http_user_agents_list.csv
