id: 019c62b5-e674-753e-93ab-a26e91dedd8c
name: Suspicious File Creation in Temp Folder
description: This rule detects the creation of a file named "Screen.jpg" within a user's temporary directory (AppData\Local\Temp). This could indicate a screenshot being saved to a common temporary location, which might be suspicious depending on the context.
query: "DeviceFileEvents\r\n| where TimeGenerated > ago(30d)\r\n| where ActionType == \"FileCreated\"\r\n| where FileName == \"Screen.jpg\"\r\n| where FolderPath has @\"\\AppData\\Local\\Temp\\\"\r\n| project TimeGenerated, DeviceName, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, InitiatingProcessCommandLine, AdditionalFields"
query_type: kql
tags:
    - kql
version: "1"
