id: 019cd69c-b41c-741c-8523-569f7a6ab124
name: Registry Modification to User Shell Folders
description: Detects modifications to the 'User Shell Folders' registry key, which can be abused by adversaries to alter the location of special folders (e.g., Desktop, Documents) to point to attacker-controlled locations, potentially for persistence or data staging.
query: "DeviceRegistryEvents\r\n| where RegistryKey has @\"SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell\"\r\n| project TimeGenerated, DeviceName, RegistryKey, RegistryValueName, RegistryValueData, InitiatingProcessFileName, InitiatingProcessCommandLine\r\n"
query_type: kql
severity: medium
tags:
    - kql
version: "1"
