id: 019ce84f-fe54-73ec-ad5f-599acaa06b5b
name: Sign-in from Starlink IP Address
description: This rule detects sign-in attempts originating from IP addresses associated with Starlink (Space Exploration Technologies) autonomous system. This could indicate an unusual access vector, especially if Starlink is not a common or expected internet service provider for the organization's users.
query: "SigninLogs\r\n| where AutonomousSystemNumber == \"14593\"\r\n| where AutonomousSystemOrganization contains \"Space Exploration Technologies\"\r\n| project TimeGenerated, UserPrincipalName, IPAddress, Location, AppDisplayName\r\n| order by TimeGenerated desc"
query_type: kql
severity: medium
tags:
    - kql
version: "2"
