id: 019cd7b7-d1b9-742b-bded-a8575e189b20
name: Potential RDP Hijacking
description: |-
    This rule is designed to detect potential RDP session hijacking activity within the environment. RDP session hijacking occurs when an existing Remote Desktop session is taken over or reassigned without initiating a new authentication process.

    Monitoring this behavior helps identify suspicious attempts to interact with or assume control of active remote sessions.
query: "SecurityEvent\r\n| where EventID == 4688\r\n| where ((Account =~ \"NT AUTHORITY\\\\SYSTEM\" or MandatoryLabel =~ \"S-1-16-16384\") and Process =~ \"tscon.exe\") or CommandLine contains \"dest:rdp-tcp#\"\r\n| project TimeGenerated, Account, Process, CommandLine, NewProcessName, ParentProcessName, Computer\r\n"
query_type: kql
severity: medium
techniques:
    - T1563.002
tags:
    - kql
version: "1"
