id: 019c912d-3871-71da-a0a7-5794f03b9943
name: Detect Action Performed on RiskyUsers by Non-InfoSec Members
description: This query will work every 30 minutes to see if anyone that's not InfoSec performed any administrative Identity actions on users. This will also depend on your company policy, if only Information Security members are allowed to perform actions on risky users such as dismissing users, then this will trigger.
query: "//#######################################################################\r\n//##  PLATFORM: Entra ID\r\n//##  AUTHOR: IGOR OLIVEIRA (Pr0fiLeRR)\r\n//##  LOCATION: Microsoft Sentinel | Logs\r\n//##  TITLE: Detect Action Performed on RiskyUsers by Non-InfoSec Members\r\n//#######################################################################\r\nlet LookbackPeriod = 30min;\r\nlet AuditData = \r\n    AuditLogs\r\n    | where TimeGenerated > ago(LookbackPeriod)\r\n    | where Category == \"IdentityProtection\"// comment this one to see more user-related activities performed by I.S. and InfoSec members\r\n    | extend \r\n        TargetUser = tostring(TargetResources[0].userPrincipalName),\r\n        TargetUserId = tostring(TargetResources[0].id),\r\n        Admin = tostring(InitiatedBy.user.userPrincipalName),\r\n        AdminIPAddress = tostring(InitiatedBy.user.ipAddress),\r\n        Action = OperationName,\r\n        AdditionalDetails = tostring(AdditionalDetails)\r\n    | where isnotempty(Admin)\r\n    | where isnotempty(TargetUser)\r\n    | where Admin has_any (\".ca@\", \".ga@\")\r\n    | extend AdminLocalPart = tostring(split(Admin, \"@\")[0])\r\n    | extend AdminLastName = substring(AdminLocalPart, 1, indexof(AdminLocalPart, \".\") - 1);\r\n// Get Admin identity information (direct match by UPN)\r\nlet AdminIdentity = \r\n    IdentityInfo\r\n    | where TimeGenerated > ago(LookbackPeriod)\r\n    | summarize arg_max(TimeGenerated, *) by AccountUPN\r\n    | project \r\n        AdminUPN = AccountUPN,\r\n        AdminDisplayName = AccountDisplayName,\r\n        AdminDepartment = Department,\r\n        AdminJobTitle = JobTitle;\r\n// Get identity information by last name (for fallback matching)\r\nlet IdentityByLastName = \r\n    IdentityInfo\r\n    | where TimeGenerated > ago(LookbackPeriod)\r\n    | where isnotempty(AccountDisplayName)\r\n    | extend LastNameFromDisplay = tostring(split(AccountDisplayName, \" \")[-1])\r\n    | summarize arg_max(TimeGenerated, *) by LastNameFromDisplay\r\n    | project \r\n        LastNameFromDisplay,\r\n        FallbackDisplayName = AccountDisplayName,\r\n        FallbackDepartment = Department,\r\n        FallbackJobTitle = JobTitle;\r\n// NEW: Get identity information by full name (for CA/GA display name matching)\r\nlet IdentityByFullName = \r\n    IdentityInfo\r\n    | where TimeGenerated > ago(LookbackPeriod)\r\n    | where isnotempty(AccountDisplayName)\r\n    | summarize arg_max(TimeGenerated, *) by AccountDisplayName\r\n    | project \r\n        FullNameFromIdentity = AccountDisplayName,\r\n        FullNameDepartment = Department,\r\n        FullNameJobTitle = JobTitle;\r\n// Get TargetUser identity information\r\nlet TargetUserIdentity = \r\n    IdentityInfo\r\n    | where TimeGenerated > ago(LookbackPeriod)\r\n    | summarize arg_max(TimeGenerated, *) by AccountUPN\r\n    | project \r\n        TargetUserUPN = AccountUPN,\r\n        TargetUserDisplayName = AccountDisplayName,\r\n        TargetUserDepartment = Department,\r\n        TargetUserJobTitle = JobTitle;\r\n// Join all data\r\nAuditData\r\n| join kind=leftouter (AdminIdentity) on $left.Admin == $right.AdminUPN\r\n| join kind=leftouter (IdentityByLastName) on $left.AdminLastName == $right.LastNameFromDisplay\r\n| join kind=leftouter (TargetUserIdentity) on $left.TargetUser == $right.TargetUserUPN\r\n// Get initial display name (with fallback)\r\n| extend \r\n    InitialAdminDisplayName = iff(isempty(AdminDisplayName), FallbackDisplayName, AdminDisplayName),\r\n    InitialAdminDepartment = iff(isempty(AdminDepartment), FallbackDepartment, AdminDepartment),\r\n    InitialAdminJobTitle = iff(isempty(AdminJobTitle), FallbackJobTitle, AdminJobTitle)\r\n// NEW: Strip \"CA - \" or \"GA - \" prefix from display name\r\n| extend StrippedAdminName = case(\r\n    InitialAdminDisplayName startswith \"CA - \", substring(InitialAdminDisplayName, 5),\r\n    InitialAdminDisplayName startswith \"GA - \", substring(InitialAdminDisplayName, 5),\r\n    InitialAdminDisplayName  // No prefix, use as-is\r\n)\r\n// Join with IdentityByFullName to get department/job title by stripped name\r\n| join kind=leftouter (IdentityByFullName) on $left.StrippedAdminName == $right.FullNameFromIdentity\r\n// Final fallback logic: Use full name match if available, otherwise use previous values\r\n| extend \r\n    FinalAdminDisplayName = InitialAdminDisplayName,\r\n    FinalAdminDepartment = iff(isnotempty(FullNameDepartment), FullNameDepartment, InitialAdminDepartment),\r\n    FinalAdminJobTitle = iff(isnotempty(FullNameJobTitle), FullNameJobTitle, InitialAdminJobTitle)\r\n| where FinalAdminDepartment != \"Information Security\"\r\n| project\r\n    TimeGenerated,\r\n    ActivityDateTime,\r\n    StrippedAdminName,\r\n    FinalAdminDepartment,\r\n    FinalAdminJobTitle,\r\n    Identity,\r\n    Action,\r\n    TargetUserDisplayName,\r\n    TargetUserDepartment,\r\n    TargetUserJobTitle,\r\n    Result,\r\n    Category,\r\n    ResultDescription,\r\n    AdditionalDetails,\r\n    LoggedByService,\r\n    ResultReason,\r\n    TargetResources\r\n| sort by TimeGenerated desc"
query_type: kql
severity: medium
tags:
    - kql
author: Igor Oliveira
version: "3"
