id: 019cd69a-bf8c-742d-b1b5-709fd3f9fedb
name: Suspicious PDF Execution via Edge and Command Shell
description: Detects the execution of Microsoft Edge via the command shell to open a PDF file. This pattern can be indicative of malicious activity where an attacker attempts to bypass direct execution or leverage a browser vulnerability to open a malicious PDF.
query: "DeviceProcessEvents\r\n| where ProcessCommandLine contains \"cmd.exe /c start\"\r\n| where ProcessCommandLine contains \"msedge.exe\"\r\n| where ProcessCommandLine contains \".pdf\"\r\n| project TimeGenerated, DeviceName, FileName, ProcessCommandLine, InitiatingProcessFileName, AccountName\r\n"
query_type: kql
severity: medium
tactics:
    - TA0002
techniques:
    - T1059.003
    - T1204.002
tags:
    - kql
version: "1"
