id: 019c62b6-2054-750b-a13e-3418fc7897d3
name: Suspicious Telegram API Communication from Non-Telegram Process
description: This rule detects network connections to api.telegram.org on port 443 (HTTPS) initiated by an executable file, excluding common legitimate applications like telegram.exe and chrome.exe. This could indicate potential data exfiltration or command and control activity via Telegram by an unexpected process.
query: "DeviceNetworkEvents\r\n| where TimeGenerated > ago(30d)\r\n| where RemoteUrl has \"api.telegram.org\" \r\n| where RemotePort == 443\r\n| where InitiatingProcessFileName endswith \".exe\" and InitiatingProcessFileName !in~ (\"telegram.exe\", \"chrome.exe\")\r\n| project TimeGenerated, DeviceName, InitiatingProcessParentFileName, InitiatingProcessFileName, InitiatingProcessFolderPath, InitiatingProcessCommandLine, AdditionalFields"
query_type: kql
tags:
    - kql
version: "1"
