id: 019c77a7-c8d5-7538-bc17-101afb700cf2
name: Modification of Azure Break Glass Account Properties
description: This rule detects modifications to properties of 'break glass' accounts. It joins a watchlist of identity categories containing 'Break Glass' accounts with Azure Audit Logs to identify specific operations performed on these accounts. The rule focuses on changes to user principal names, operation names, activity display names, results, and AAD operation types.
query: "\r\n//Repo - T1078: Modification of the properties of a break glass account has been identified\r\n_GetWatchlist('identity')\r\n|where category contains \"Break Glass\"\r\n| join kind=inner (AuditLogs\r\n| extend userPrincipalName_ = tostring(TargetResources[0].userPrincipalName)) on $left.SearchKey == $right.userPrincipalName_\r\n|distinct TimeGenerated, userPrincipalName_, OperationName, ActivityDisplayName, Result, AADOperationType"
query_type: kql
severity: medium
tactics:
    - TA0005
    - TA0003
    - TA0004
    - TA0001
techniques:
    - T1078
    - T1078.004
    - T1098
tags:
    - kql
author: Rudra Verma - CyberHawk
version: "4"
