id: 019c7ee4-48e5-71de-8066-efb928f7c7dc
name: Registry Run Key Persistence via MonitoringService
description: This rule detects the creation of a registry key named 'MonitoringService' under 'HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Run'. This registry key is commonly used by adversaries to establish persistence, ensuring that a malicious program or script executes automatically each time a user logs on to the system.
query: "DeviceRegistryEvents\r\n| where Timestamp > ago(1h)\r\n| where ActionType == \"RegistryKeyCreated\"\r\n| where RegistryKey has \"\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\MonitoringService\""
query_type: kql
severity: medium
tactics:
    - TA0003
    - TA0004
techniques:
    - T1547.001
tags:
    - kql
author: Steven Lim
version: "4"
