id: 019c62b2-e167-7285-a282-ba930b9bf424
name: Chrome User Data File Access
description: This rule detects when sensitive Google Chrome user data files, such as 'Login Data', 'Cookies', 'Web Data', or 'Local State', are created or modified within the user's AppData directory. This activity could indicate an attempt to exfiltrate or tamper with browser data, potentially compromising user credentials, session information, or other personal data.
query: "DeviceFileEvents\r\n| where TimeGenerated > ago(30d)\r\n| where ActionType == \"FileCreated\" or ActionType == \"FileModified\"\r\n| where FolderPath has @\"\\AppData\\Local\\Google\\Chrome\\User Data\\\"\r\n| where FileName in~ (\"Login Data\", \"Cookies\", \"Web Data\", \"Local State\")\r\n| project TimeGenerated, DeviceName, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, InitiatingProcessCommandLine, AdditionalFields"
query_type: kql
tags:
    - kql
version: "1"
