id: 019c244f-7ae0-771c-a420-d069a4114085
name: Chrysalis Backdoor Notepad++ Rapid7 IOC Threat Hunt
description: This query utilizes the IOCs provided by Rapid7 and focuses on columns in the DeviceFileEvents, DeviceProcessEvents and DeviceNetworkEvents tables. This is a high FP query, however each event will require an investigation to its legitimacy. The query accounts for all devices that have installed notepad++ in the past 400d and only looking for IOCs within time of known compromise in order to save on resources. Some IOCs are commented out due to high FP rate.
query: "//IOCs provided by Rapid7, this is a high FP query and you will need to add exceptions in order to clean it up. Ideally, you have an inventory of devices that have had Notepad++ installed and you can uncomment and explicity define the devices on line 12-15 and comment out lines 10-11. 10-11 is a pretty wide approach.\nlet notepadDevices = DeviceFileEvents\n| where \n    TimeGenerated > ago(400d)\n| where \n    FileName == \"notepad++.exe\"\n| summarize by DeviceName\n;\nunion DeviceFileEvents, DeviceProcessEvents, DeviceNetworkEvents\n| where \n    TimeGenerated between (datetime(2025-06-01) .. datetime(2025-12-03))\n| where \n    DeviceName has_any (notepadDevices)\n// | where \n//     DeviceName has_any(\n//         \"exampleDevice\"\n//     )\n| extend \n    iocFlag = case(FileName has_any (\n        \"update.exe\",\n        \"[NSIS.nsi]\",\n        \"BluetoothService.exe\",\n        \"BluetoothService\",\n        \"log.dll\",\n        \"u.bat\",\n        \"conf.c\",\n        \"libtcc.dll\",\n        //admin is going to cause a lot of FP, SHA256 still added below\n        //\"admin\",\n        \"loader1\",\n        \"uffhxpSy\",\n        \"loader2\",\n        \"3yzr31vk\",\n        \"ConsoleApplication2.exe\",\n        //system is going to cause a lot of FP, SHA256 still added below\n        //\"system\",\n        \"s047t5g.exe\"\n        ), strcat(\"FileName: \", FileName),\n        ProcessCommandLine has_any (\n        \"update.exe\",\n        \"[NSIS.nsi]\",\n        \"BluetoothService.exe\",\n        \"BluetoothService\",\n        \"log.dll\",\n        \"u.bat\",\n        \"conf.c\",\n        \"libtcc.dll\",\n        //admin is going to cause a lot of FP, SHA256 still added below\n        //\"admin\",\n        \"loader1\",\n        \"uffhxpSy\",\n        \"loader2\",\n        \"3yzr31vk\",\n        \"ConsoleApplication2.exe\",\n        //system is going to cause a lot of FP, SHA256 still added below        \n        //\"system\",\n        \"s047t5g.exe\"\n        ), strcat(\"ProcessCommandLine: \", ProcessCommandLine),\n        InitiatingProcessCommandLine has_any (\n        \"update.exe\",\n        \"[NSIS.nsi]\",\n        \"BluetoothService.exe\",\n        \"BluetoothService\",\n        \"log.dll\",\n        \"u.bat\",\n        \"conf.c\",\n        \"libtcc.dll\",\n        //admin is going to cause a lot of FP, SHA256 still added below\n        //\"admin\",\n        \"loader1\",\n        \"uffhxpSy\",\n        \"loader2\",\n        \"3yzr31vk\",\n        \"ConsoleApplication2.exe\",\n        //system is going to cause a lot of FP, SHA256 still added below\n        //\"system\",\n        \"s047t5g.exe\"\n        ), strcat(\"InitiatingProcessCommandLine: \", InitiatingProcessCommandLine),\n         SHA256 has_any (\n        \"a511be5164dc1122fb5a7daa3eef9467e43d8458425b15a640235796006590c9\",\n        \"8ea8b83645fba6e23d48075a0d3fc73ad2ba515b4536710cda4f1f232718f53e\",\n        \"2da00de67720f5f13b17e9d985fe70f10f153da60c9ab1086fe58f069a156924\",\n        \"77bfea78def679aa1117f569a35e8fd1542df21f7e00e27f192c907e61d63a2e\",\n        \"3bdc4c0637591533f1d4198a72a33426c01f69bd2e15ceee547866f65e26b7ad\",\n        \"9276594e73cda1c69b7d265b3f08dc8fa84bf2d6599086b9acc0bb3745146600\",\n        \"f4d829739f2d6ba7e3ede83dad428a0ced1a703ec582fc73a4eee3df3704629a\",\n        \"4a52570eeaf9d27722377865df312e295a7a23c3b6eb991944c2ecd707cc9906\",\n        \"831e1ea13a1bd405f5bda2b9d8f2265f7b1db6c668dd2165ccc8a9c4c15ea7dd\",\n        \"0a9b8df968df41920b6ff07785cbfebe8bda29e6b512c94a3b2a83d10014d2fd\",\n        \"4c2ea8193f4a5db63b897a2d3ce127cc5d89687f380b97a1d91e0c8db542e4f8\",\n        \"e7cd605568c38bd6e0aba31045e1633205d0598c607a855e2e1bca4cca1c6eda\",\n        \"078a9e5c6c787e5532a7e728720cbafee9021bfec4a30e3c2be110748d7c43c5\",\n        \"b4169a831292e245ebdffedd5820584d73b129411546e7d3eccf4663d5fc5be3\",\n        \"7add554a98d3a99b319f2127688356c1283ed073a084805f14e33b4f6a6126fd\",\n        \"fcc2765305bcd213b7558025b2039df2265c3e0b6401e4833123c461df2de51a\"\n        ), strcat(\"SHA256: \", SHA256),\n        RemoteIP has_any (\n        \"95.179.213.0\",\n        \"61.4.102.97\",\n        \"59.110.7.32\",\n        \"124.222.137.114\"\n        ), strcat(\"RemoteIP: \", RemoteIP),\n        RemoteUrl has_any (\n        \"api.skycloudcenter.com\",\n        \"api.wiresguard.com\",\n        \"95.179.213.0\",\n        \"61.4.102.97\",\n        \"59.110.7.32\",\n        \"124.222.137.114\"\n        ), strcat(\"RemoteUrl: \", RemoteUrl),\n        \"\"\n        )\n| where iocFlag != \"\"\n//| project TimeGenerated, iocFlag, DeviceName"
query_type: kql
severity: medium
techniques:
    - T1204.002
    - T1036
    - T1027
    - T1027.007
    - T1140
    - T1106
    - T1055
    - T1620
    - T1059.003
    - T1083
    - T1005
    - T1105
    - T1041
    - T1071.001
    - T1573
    - T1547.001
    - T1543.003
    - T1480.002
    - T1070.004
tags:
    - kql
version: "1"
references:
    - https://www.rapid7.com/blog/post/tr-chrysalis-backdoor-dive-into-lotus-blossoms-toolkit/
