id: 019c62b5-fa32-735e-b9af-f81d4d56ef02
name: File Creation in Temp Folder with Ardent Zip Extension
description: This rule detects the creation of a file named "@ardent.zip" within the "AppData\Local\Temp\" folder. This specific file name and location could indicate the presence of a particular malware or a temporary file associated with a suspicious activity.
query: "DeviceFileEvents\r\n| where TimeGenerated > ago(30d)\r\n| where ActionType == \"FileCreated\"\r\n| where FolderPath has @\"\\AppData\\Local\\Temp\\\"\r\n| where FileName matches regex @\"@ardent\\.zip$\"\r\n| project TimeGenerated, DeviceName, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, InitiatingProcessCommandLine, AdditionalFields"
query_type: kql
tags:
    - kql
version: "1"
