id: 019cc842-87cf-7307-b0d0-ad5f29e1cb11
name: TrustConnect Known Hashes Detection
description: This rule detects the presence of specific file hashes associated with the TrustConnect campaign on devices. It directly identifies known malicious lure files by their SHA256 hash, providing a narrow and high-confidence detection for triage and initial checks.
query: |
    // Rule: TrustConnect Known Hashes
    // Author: Daniel Jeremiah
    // Date: 2026-03-07
    // Description:
    // This hunt checks for the known file hashes published in the TrustConnect report. It is the most direct and narrow search in the set because it only matches files already tied to the campaign. In plain language, this query asks whether any of the exact known bad lure files were seen on a device. It is useful for fast checking and triage, especially when you want a very low-noise answer before moving on to broader behavior hunts.

    let TrustConnectHashes = dynamic([
      "ef7702ac5f574b2c046df6d5ab3e603abe57d981918cddedf4de6fe41b1d3288",
      "4c6251e1db72bdd00b64091013acb8b9cb889c768a4ca9b2ead3cc89362ac2ca",
      "86b788ce9379e02e1127779f6c4d91ee4c1755aae18575e2137fb82ce39e100f",
      "959509ef2fa29dfeeae688d05d31fff08bde42e2320971f4224537969f553070",
      "5701dabdba685b903a84de6977a9f946accc08acf2111e5d91bc189a83c3faea",
      "6641561ed47fdb2540a894eb983bcbc82d7ad8eafb4af1de24711380c9d38f8b",
      "98a4d09db3de140d251ea6afd30dcf3a08e8ae8e102fc44dd16c4356cc7ad8a6",
      "9827c2d623d2e3af840b04d5102ca5e4bd01af174131fc00731b0764878f00ca",
      "edde2673becdf84e3b1d823a985c7984fec42cb65c7666e68badce78bd0666c0",
      "c6097dfbdaf256d07ffe05b443f096c6c10d558ed36380baf6ab446e6f5e2bc3",
      "947bcb782c278da450c2e27ec29cb9119a687fd27485f2d03c3f2e133551102e",
      "36fdd4693b6df8f2de7b36dff745a3f41324a6dacb78b4159040c5d15e11acb7",
      "35f03708f590810be88dfb27c53d63cd6bb3fb93c110ca0d01bc23ecdf61f983",
      "af651ebcacd88d292eb2b6cbbe28b1e0afd1d418be862d9e34eacbd65337398c",
      "c862dbcada4472e55f8d1ffc3d5cfee65d1d5e06b59a724e4a93c7099dd37357"
    ]);
    DeviceFileEvents
    | where SHA256 has_any (TrustConnectHashes)
    | project Timestamp, DeviceName, FileName, FolderPath, SHA256
query_type: kql
severity: medium
tags:
    - kql
author: Daniel Jeremiah
version: "2"
