id: 019c48fe-ec50-724a-84bf-01d325696d62
name: Suspicious User-Agent Activity in Microsoft Graph Logs
description: This rule detects suspicious user-agent strings in Microsoft Graph activity logs that are commonly associated with reconnaissance and attack tools targeting Azure AD and Microsoft 365 environments. These tools include BloodHound, ROADtools, AADInternals, and various other utilities used for enumeration, credential spraying, and other malicious activities.
query: "MicrosoftGraphActivityLogs\r\n| where TimeGenerated > ago(1d)\r\n| summarize by UserAgent\r\n| where UserAgent has_any (\"azurehound\",\"bloodhound\",\"stormspotter\",\"graphrunner\",\"msolspray\",\"aadspray\",\"rubeus\",\"roadtools\",\"roadrecon\",\"graphrunner\",\"azuread_decrypt\",\"dirscraper\",\"graphscrape\",\"graphprobe\",\"o365recon\",\"graphpowershell\",\"aadinternals\")\r\n"
query_type: kql
severity: medium
tactics:
    - TA0007
    - TA0003
    - TA0004
    - TA0005
techniques:
    - T1069
    - T1526
    - T1098.005
    - T1484.002
tags:
    - kql
version: "1"
