id: 019cd69c-0f53-73bf-8ffe-eed49c09ab8f
name: UDPGangster – Mutex Detection
description: This rule detects the presence of the string "xhxhxhxhxhxpp" within the AdditionalFields of DeviceEvents. This string =represents a Mutex Indicator of Compromise (IOC).
query: "DeviceEvents\r\n| where AdditionalFields has \"xhxhxhxhxhxpp\"\r\n| project TimeGenerated, DeviceName, InitiatingProcessFileName, InitiatingProcessCommandLine, AdditionalFields\r\n"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1070
tags:
    - kql
version: "1"
