id: 019c4de4-0502-70ea-8c33-b289f0f3591b
name: Microsoft ClickFix - File Hash IOCs
description: This rule detects the presence of specific file hashes associated with the Microsoft ClickFix social engineering technique. It identifies files on devices that match a predefined list of SHA256 hashes, indicating potential compromise or interaction with the ClickFix malware.
query: |
    // Microsoft ClickFix - File hash IOCs from blog
    // Author: Daniel Jeremiah | Date: 2026/02/11
    // Ref: https://www.microsoft.com/en-us/security/blog/2025/08/21/think-before-you-clickfix-analyzing-the-clickfix-social-engineering-technique/

    let ioc_sha_hashes = dynamic([
        "061d378ffed42913d537da177de5321c67178e27e26fca9337e472384d2798c8",
        "592ef7705b9b91e37653f9d376b5492b08b2e033888ed54a0fd08ab043114718",
        "8fb329ae6b590c545c242f0bef98191965f7afed42352a0c84ca3ccc63f68629",
        "d9ffe7d433d715a2bf9a31168656e965b893535ab2e2d9cab81d99f0ce0d10c9",
        "f77c924244765351609777434e0e51603e7b84c5a13eef7d5ec730823fc5ebab"
    ]);

    DeviceFileEvents
    | where TimeGenerated > ago(30d)
    | where SHA256 has_any (ioc_sha_hashes)
    | project TimeGenerated, DeviceName, FileName, FolderPath, SHA256, InitiatingProcessFileName, ActionType
query_type: kql
tags:
    - kql
version: "2"
