id: 019c10bb-e55b-7329-9991-a81f62a8bd56
name: Hotta Killer Process Termination Command
description: Detects the execution of 'polers.dll' via rundll32.exe, a command-line pattern used by the Interlock ransomware group's 'Hotta Killer' tool to terminate security software by exploiting CVE-2025-61155.
query: |-
    DeviceProcessEvents
    | where (FolderPath endswith "\\rundll32.exe" and (ProcessCommandLine contains "polers.dll" and ProcessCommandLine contains "start ")) and (ProcessCommandLine contains " Forti" or ProcessCommandLine contains " Crowd" or ProcessCommandLine contains " Sentin" or ProcessCommandLine contains " Carbon" or ProcessCommandLine contains " Defender" or ProcessCommandLine contains " Sophos")
query_type: kql
severity: critical
tactics:
    - TA0005
techniques:
    - T1218.011
    - T1562.001
tags:
    - attack.t1218.011
    - attack.t1562.001
    - attack.defense_evasion
    - cve.2025.61155
author: detections.ai
version: "2"
references:
    - Internal Intel ID 84413e18dcc8ea039bcf512168e32d8d75169e2b971e642a21f38cfb31b32cd5
    - https://www.cisa.gov/sites/default/files/2025-07/aa25-203a-stopransomware-interlock-072225.pdf
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-203a
    - https://www.fortinet.com/blog/threat-research/interlock-ransomware-new-techniques-same-old-tricks
data_sources:
    - process_creation
    - windows
