id: 019cfb9d-c9e8-70c1-993a-66009e5a9abe
name: 'Payload Ransomware File Renamed '
description: Detects when a file is renamed to have the suffix ':payload' and the initiating process's file name is the same as the previous file name. This behavior can be indicative of Payload Ransomware to hide or modify files.
query: "DeviceFileEvents\r\n| where ActionType == \"FileRenamed\"\r\n| where FileName hassuffix \":payload\"\r\n| where InitiatingProcessFileName == PreviousFileName\r\n"
query_type: kql
severity: medium
techniques:
    - DS0022
tags:
    - kql
version: "1"
