id: 019cf5a0-a92d-7277-b69a-ca8b35496c19
name: Network Beaconing to Slopoly/Hive0163 C2 via Known IP or Cloudflare Tunnels
description: Detects network connections to a specific suspicious IP address (94.156.181.89) or to domains associated with Cloudflare Tunnel (.trycloudflare.com). This could indicate command and control activity, data exfiltration, or other malicious network communication.
query: "DeviceEvents\r\n| where ActionType startswith \"Network\" and (isnotempty(RemoteIP) or isnotempty(RemoteUrl))\r\n| where\r\n    RemoteIP == \"94.156.181.89\" or\r\n    RemoteUrl contains \".trycloudflare.com\"\r\n| project\r\n    Timestamp,\r\n    DeviceName,\r\n    ActionType,\r\n    InitiatingProcessFileName,\r\n    InitiatingProcessCommandLine,\r\n    RemoteIP,\r\n    RemoteUrl,\r\n    ReportId\r\n"
query_type: kql
severity: medium
tactics:
    - TA0042
techniques:
    - T1583.007
tags:
    - kql
version: "1"
