id: 019ca021-bba1-7546-98b6-461f33dcd99d
name: Network Connection to Dynamic IPv6 Reverse DNS Domain
description: This rule detects network connections to domains that appear to be dynamically generated IPv6 reverse DNS entries. These types of domains (e.g., 'xxxxxxxxxx.ip6.arpa') are often used in command and control (C2) communications or for exfiltration by malware to evade traditional domain-based detection. The regex specifically looks for a 10-character alphanumeric string followed by '.ip6.arpa'.
query: "DeviceNetworkEvents\r\n| where Timestamp > ago(1h)\r\n| where ActionType == \"ConnectionSuccess\"\r\n| extend fqdn = replace_string(RemoteUrl, \"https://\", \"\")\r\n| where fqdn matches regex @\"^[a-z]{10}\\.[0-9a-f\\.]+ip6\\.arpa$\""
query_type: kql
severity: medium
tactics:
    - TA0007
techniques:
    - T1016
tags:
    - kql
author: Steven Lim
version: "5"
