id: 019c62b6-0df2-722e-a20e-9bc4ee659625
name: Unsigned .NET Process Execution
description: This rule detects processes that are initiated by an executable, have command-line arguments containing .NET related keywords ('.NET', 'dotnet', 'mscorlib'), and have an unknown signature status. It excludes common .NET build tools like msbuild.exe, csc.exe, and vbc.exe to reduce false positives. This could indicate suspicious execution of unsigned .NET applications or scripts.
query: "DeviceProcessEvents\r\n| where TimeGenerated > ago(30d)\r\n| where InitiatingProcessFileName endswith \".exe\"\r\n| where InitiatingProcessCommandLine has_any (\".NET\", \"dotnet\", \"mscorlib\")\r\n| where InitiatingProcessSignatureStatus == \"Unknown\"\r\n| where FileName !in~ (\"msbuild.exe\", \"csc.exe\", \"vbc.exe\")\r\n| project TimeGenerated, DeviceName, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, InitiatingProcessCommandLine, ProcessCommandLine, InitiatingProcessSignatureStatus, AdditionalFields"
query_type: kql
tags:
    - kql
version: "1"
