id: 019c225d-96cc-7409-9332-ac6be53b48cf
name: Vulnerable Notepad++ Version Detected
description: This rule identifies devices running vulnerable versions of Notepad++. It parses the software version to determine if it is older than 8.9.1, which was identified as vulnerable in a security incident. The rule specifically looks for Notepad++ installations and flags any instances where the major version is less than 8, or if the major version is 8 and the minor version is less than 9, or if the major version is 8, the minor version is 9, and the patch version is less than 1.
query: |-
    //Identify Vulnerable versions of NOtepad++
    // https://notepad-plus-plus.org/news/hijacked-incident-info-update/
    DeviceTvmSoftwareInventory
    | where SoftwareName == @"notepad++"
    | extend Major = toint(split(SoftwareVersion, ".")[0]),
             Minor = toint(split(SoftwareVersion, ".")[1]),
             Patch = toint(split(SoftwareVersion, ".")[2])
    | extend VulnerabilityStatus = iff(Major < 8 or (Major == 8 and Minor < 9) or (Major == 8 and Minor == 9 and Patch < 1), "vulnerable", "not vulnerable")
    | where VulnerabilityStatus == "vulnerable"
    | project DeviceName, SoftwareName, SoftwareVersion, VulnerabilityStatus
query_type: kql
severity: medium
tactics:
    - TA0007
    - TA0043
techniques:
    - T1518
    - T1592.002
tags:
    - kql
author: AJ
version: "4"
references:
    - https://notepad-plus-plus.org/news/hijacked-incident-info-update/
