id: 019cff9b-8100-7348-904a-a86a77fc2fb0
name: GhostBackdoor – Malware Execution Detection
description: Detects GhostBackdoor malware execution via known file hash.
query: "DeviceFileEvents\r\n| where SHA256 == \"8d2227f2c53d7e22a57e12c45cecdd43dbec08dbc3ab93e74e6df52cdf80548b\"\r\n| project TimeGenerated, DeviceName, FileName, FolderPath\r\n"
query_type: kql
severity: medium
tags:
    - kql
version: "1"
