id: 019c7667-dc41-775a-ade5-1d989c4f8c3f
name: SyncAppvPublishingServer Powershell Execution
description: This detection identifies the execution of SyncAppvPublishingServer.vbs—a legitimate Microsoft App‑V script—when launched under wscript.exe or cscript.exe, which is abnormal outside of App‑V environments. Although the script is signed by Microsoft and intended to support application publishing workflows, threat actors have increasingly adopted it as a LOLScript-based execution proxy. By invoking this script directly and supplying crafted arguments, adversaries can cause it to spawn PowerShell or run additional commands on their behalf, often without ever calling powershell.exe explicitly. This evasion is highly effective against visibility controls that rely on direct process-name monitoring.
query: "DeviceProcessEvents\r\n| where ProcessVersionInfoOriginalFileName has_any (@\"WScript\", @\"cscript\")\r\n| where ProcessCommandLine contains \"SyncAppvPublishingServer.vbs\""
query_type: kql
severity: medium
techniques:
    - T1059.005
tags:
    - kql
version: "1"
references:
    - https://www.linkedin.com/feed/update/urn:li:activity:7429953431588659200/
    - https://lolbas-project.github.io/lolbas/Scripts/Syncappvpublishingserver/
