id: 019cd678-2c08-776e-b456-8d7353fb3f60
name: PowerShell Execution Policy Modification
description: Detects attempts to modify the PowerShell execution policy using 'Set-ExecutionPolicy'. This command can be used by adversaries to lower security restrictions and enable the execution of unsigned or malicious PowerShell scripts.
query: "DeviceEvents\r\n| where ActionType == \"PowerShellCommand\"\r\n| where InitiatingProcessFileName == \"powershell.exe\"\r\n| where InitiatingProcessAccountName != \"system\"\r\n| where AdditionalFields.Command == \"Set-ExecutionPolicy\"\r\n| project TimeGenerated, DeviceName, InitiatingProcessAccountName"
query_type: kql
severity: medium
tactics:
    - TA0002
techniques:
    - T1059.001
tags:
    - kql
version: "1"
