id: 019cd67c-911b-77ed-9b81-2bc55e725fce
name: User Account Control (UAC) Setting Change
description: This rule detects changes to a user account's User Account Control (UAC) settings, specifically when the 'NewUacValue' is set to '0x2080'. This value corresponds to the 'ACCOUNTDISABLE' flag, indicating that a user account has been disabled. Monitoring such changes can help identify potential malicious activity where an attacker might disable legitimate user accounts to disrupt operations or hinder incident response.
query: "SecurityEvent\r\n| where EventID == \"4742\"\r\n| parse EventData with * 'NewUacValue\">' NewUacValue '</Data>' *\r\n| parse EventData with * 'TargetUserName\">' ComputerName '</Data>' *\r\n| parse EventData with * 'SubjectUserName\">' Actor '</Data>' *\r\n| where NewUacValue == \"0x2080\"\r\n| project TimeGenerated, Activity, ComputerName, Actor"
query_type: kql
severity: medium
tactics:
    - TA0003
    - TA0004
techniques:
    - T1098
tags:
    - kql
version: "1"
