id: 019c62b6-6e69-70fe-b9f2-3d1f64b6dc41
name: Malware PupkinStealer - Suspicious Access to Telegram Desktop Data Folder
description: This rule detects file access events within the Telegram Desktop application's data folder (`tdata`) by processes other than `telegram.exe` or `explorer.exe`. This could indicate unauthorized access or manipulation of Telegram user data by malicious software or scripts.
query: "DeviceFileEvents\r\n| where TimeGenerated > ago(30d)\r\n| where ActionType == \"FileAccess\"\r\n| where FolderPath has @\"\\Telegram Desktop\\tdata\\\"\r\n| where InitiatingProcessFileName !in~ (\"telegram.exe\", \"explorer.exe\")\r\n| project TimeGenerated, DeviceName, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, InitiatingProcessCommandLine, AdditionalFields"
query_type: kql
severity: medium
tags:
    - kql
version: "2"
