id: 019c62b6-484d-7718-b13d-6047e567f483
name: Email Attachment Executable or DLL
description: This rule detects emails containing executable attachments (files ending with .exe or .dll) that are identified as Microsoft Windows executables. It joins information about email attachments with email event details to provide context such as the subject, sender, and recipient of the email.
query: "EmailAttachmentInfo\r\n| where TimeGenerated > ago(30d)\r\n| where FileName endswith \".exe\" or FileName endswith \".dll\"\r\n| where FileType == \"application/x-msdownload\" \r\n| join EmailEvents on $left.NetworkMessageId == $right.NetworkMessageId\r\n| project Subject, SenderFromAddress, RecipientEmailAddress, FileName, FileType"
query_type: kql
tags:
    - kql
version: "1"
