id: 019c89aa-01d2-77e2-9ab0-6f77506ec583
name: Full Antivirus Scan Status – Endpoint Verification
description: This detection is used to validate the execution status of a Full Antivirus Scan on a specific endpoint. It helps analysts confirm whether a full scan was completed or cancelled, which is commonly required during incident response, malware triage, or post‑remediation verification.
query: "DeviceEvents\r\n| where DeviceName contains \"1234\" // Replace the device name\r\n| where ActionType has_any (\"AntivirusScanCompleted\", \"AntivirusScanCancelled\")\r\n| extend AdditionalFields = parse_json(AdditionalFields)\r\n| extend ScanType = AdditionalFields[\"ScanTypeIndex\"]\r\n| where ScanType contains \"Full\"\r\n| project Timestamp, DeviceName, ActionType, InitiatingProcessCreationTime, ScanType"
query_type: kql
severity: medium
tags:
    - kql
author: Adarsh Pandey
version: "1"
