id: 019c4335-5225-710e-83eb-5a21462cbf4f
name: Hunting PayPal DKIM Replay Attacks
description: https://www.kaseya.com/blog/dkim-replay-attacks-apple-paypal-invoice-abuse/
query: "EmailEvents\r\n| where Timestamp > ago(1h)\r\n| where SenderFromAddress == \"service@paypal.com\"\r\n| where parse_json(AuthenticationDetails).DKIM == \"pass\" and \r\nparse_json(AuthenticationDetails).DMARC == \"pass\"\r\n| where not (ipv4_is_in_range(SenderIPv4,\"64.4.240.0/21\") or\r\nipv4_is_in_range(SenderIPv4,\"64.4.248.0/22\") or\r\nipv4_is_in_range(SenderIPv4,\"66.211.168.0/22\") or\r\nipv4_is_in_range(SenderIPv4,\"91.243.72.0/23\") or\r\nipv4_is_in_range(SenderIPv4,\"173.0.80.0/20\") or\r\nipv4_is_in_range(SenderIPv4,\"185.177.52.0/22\") or\r\nipv4_is_in_range(SenderIPv4,\"192.160.215.0/24\") or\r\nipv4_is_in_range(SenderIPv4,\"198.54.216.0/23\"))\r\n| where EmailDirection == \"Inbound\" and DeliveryAction != \"Blocked\""
query_type: kql
severity: medium
tactics:
    - TA0001
techniques:
    - T1566
tags:
    - kql
author: Steven Lim
version: "2"
