id: 019c117d-b1e6-736f-ad54-d4edddf8fafc
name: Account Elevated to a New Role (v2)
description: This rule detects when a user activates a high-risk PIM role for the first time within a 30-day window. It compares the last 24 hours of successful role elevations against a baseline of the previous 29 days, flagging any user/role combinations that haven't appeared before. The output includes the elevated user, the role they activated, who initiated the elevation, and the source IP for triage.
query: "let HighRiskRoles = dynamic([\"Global Administrator\", \"Privileged Role Administrator\", \"Privileged Authentication Administrator\", \"Security Administrator\", \"Exchange Administrator\", \"SharePoint Administrator\", \"Intune Administrator\", \"User Administrator\", \"Authentication Administrator\"]);\r\nlet auditList =\r\n    AuditLogs\r\n    | where TimeGenerated >= ago(30d)\r\n    | where OperationName =~ \"Add member to role completed (PIM activation)\"\r\n    | where Result =~ \"success\"\r\n    | extend TargetUserPrincipalName = tostring(TargetResources[2].userPrincipalName)\r\n    | extend displayName = tostring(TargetResources[0].displayName)\r\n    | extend displayName2 = tostring(TargetResources[3].displayName)\r\n    | extend ElevatedRole = iif(displayName =~ \"Member\", displayName2, displayName)\r\n    | where ElevatedRole in~ (HighRiskRoles)\r\n;\r\nlet lookbackList = auditList\r\n    | where TimeGenerated between(ago(30d)..ago(1d))\r\n;\r\nlet recentList = auditList\r\n    | where TimeGenerated > ago(1d)\r\n;\r\nlet newlyElevated = recentList\r\n    | join kind=leftanti lookbackList on ElevatedRole, TargetUserPrincipalName\r\n;\r\nnewlyElevated \r\n| project Id, AdditionalDetails\r\n| mv-expand bagexpansion=array AdditionalDetails\r\n| evaluate bag_unpack(AdditionalDetails)\r\n| extend key = column_ifexists(\"key\", ''), value = column_ifexists(\"value\", '')\r\n| evaluate pivot(key, make_set(value))\r\n| extend ipaddr = todynamic(column_ifexists(\"ipaddr\", \"\"))\r\n| mv-expand ipaddr\r\n| project Id, InitiatingIPAddress = tostring(ipaddr)\r\n| join kind=rightouter newlyElevated on Id\r\n| extend InitiatingAppName = tostring(InitiatedBy.app.displayName)\r\n| extend InitiatingAppServicePrincipalId = tostring(InitiatedBy.app.servicePrincipalId)\r\n| extend InitiatingUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)\r\n| extend InitiatingAadUserId = tostring(InitiatedBy.user.id)\r\n| extend InitiatingIPAddress = iff(isnotempty(tostring(InitiatedBy.user.ipAddress)), tostring(InitiatedBy.user.ipAddress), InitiatingIPAddress)\r\n| extend ElevatedBy = iff(isnotempty(InitiatingUserPrincipalName), InitiatingUserPrincipalName, InitiatingAppName)\r\n| extend ElevatedUser = TargetUserPrincipalName\r\n| extend InitiatingAccountName = tostring(split(InitiatingUserPrincipalName, \"@\")[0]), InitiatingAccountUPNSuffix = tostring(split(InitiatingUserPrincipalName, \"@\")[1])\r\n| extend TargetAccountName = tostring(split(TargetUserPrincipalName, \"@\")[0]), TargetAccountUPNSuffix = tostring(split(TargetUserPrincipalName, \"@\")[1])\r\n| project-reorder ElevatedUser, ElevatedRole, ResultReason, ElevatedBy, InitiatingUserPrincipalName, InitiatingAadUserId, InitiatingIPAddress, TargetUserPrincipalName"
query_type: kql
severity: medium
tags:
    - kql
author: rootghost99
version: "2"
