id: 019c0d5e-774a-739a-8dd9-712f7060e713
name: MKDOOR Defender Exclusion via WMI
description: Detects attempts to add file paths to Microsoft Defender's exclusion list using WMIC, a specific defense evasion technique identified in the MKDOOR backdoor associated with PeckBirdy campaigns.
query: "DeviceProcessEvents\r\n| where ActionType == \"ProcessCreated\"\r\n| where FileName =~ \"wmic.exe\"\r\n| where ProcessCommandLine has \"MSFT_MpPreference\" and ProcessCommandLine has \"Add\" and ProcessCommandLine has \"ExclusionPath\"\r\n| project\r\n    Timestamp,\r\n    DeviceName,\r\n    AccountName,\r\n    FileName,\r\n    ProcessCommandLine,\r\n    InitiatingProcessFileName,\r\n    InitiatingProcessCommandLine,\r\n    ProcessId"
query_type: kql
severity: medium
tactics:
    - TA0005
tags:
    - kql
author: Kaung Khant Ko
version: "1"
references:
    - https://www.trendmicro.com/en_us/research/26/a/peckbirdy-script-framework.html
