id: 019c62b6-5b7a-743c-9247-5ea38bdbc172
name: Discord Local Storage Access
description: This rule detects processes that are initiated by an executable and access the Discord local storage leveldb directory. This activity could indicate an attempt to exfiltrate Discord user data, such as authentication tokens, which are often stored in this location. Attackers frequently target these files to gain unauthorized access to user accounts.
query: "DeviceProcessEvents\r\n| where TimeGenerated > ago(30d)\r\n| where InitiatingProcessFileName endswith \".exe\"\r\n| where InitiatingProcessCommandLine has @\"\\Discord\\Local Storage\\leveldb\\\"\r\n| project TimeGenerated, DeviceName, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, InitiatingProcessCommandLine, AdditionalFields"
query_type: kql
tags:
    - kql
version: "1"
