id: 019cfb9c-d73a-723b-b0ce-6fe09a35f9e2
name: Payload Ransomware Mutex Detected
description: Detects the creation of a named object with the specific name 'MakeAmericaGreatAgain'. This string has been associated with various malware and potentially unwanted programs, often used as a mutex or other synchronization object to ensure only one instance of the malicious process is running.
query: "DeviceEvents\r\n| where ActionType == \"CreateHandle\"\r\n| where RegistryKey == \"\\\\BaseNamedObjects\\\\MakeAmericaGreatAgain\"\r\n"
query_type: kql
severity: medium
tactics:
    - TA0003
    - TA0004
techniques:
    - T1543.003
tags:
    - kql
version: "1"
