id: 019c03a3-3c03-7145-9370-80c4667f962c
name: PowerShell Get-Alias or Get-Command with Suspicious Parameters
description: Detects PowerShell processes executing with command-line arguments that suggest the use of 'Get-Alias' (gal) or 'Get-Command' (gcm) followed by suspicious patterns. This could indicate an adversary attempting to discover system capabilities or installed modules.
query: "DeviceProcessEvents\r\n| where ProcessVersionInfoOriginalFileName in~ (\"powershell.exe\", \"pwsh.exe\")\r\n| where \r\n    (ProcessCommandLine has \"gal\" and ProcessCommandLine matches regex @\"i\\S*x\")\r\n    or \r\n    (ProcessCommandLine has \"gcm\" and ProcessCommandLine matches regex @\"\\S*stM\\S*\")"
query_type: kql
severity: medium
tactics:
    - TA0002
techniques:
    - T1059.001
    - T1059
tags:
    - kql
version: "1"
