id: 019cfb30-1c78-732a-bdd2-caeef3f7ef78
name: Detect Users Clicking the Known Malicious Domains (Proxy/URL Logs)
description: Detects users clicking known malicious domains associated with a phishing campaign that abuses compromised WordPress websites to deliver fake Microsoft Teams, Xfinity, and UAE Pass login pages. Alerts when endpoints or users access any IOC domain linked to credential‑harvesting activity.
query: "EmailUrlInfo\r\n| where UrlDomain has_any (\r\n    \"skimresources.com\",\r\n    \"crsons.net\",\r\n    \"afghantarin.com\",\r\n    \"medinex.in\",\r\n    \"cabinetzeukeng.net\",\r\n    \"rnedinex.com\"\r\n)\r\n| project Timestamp, RecipientEmailAddress, Url, UrlDomain, NetworkMessageId"
query_type: kql
severity: medium
techniques:
    - T1566.002
tags:
    - kql
version: "1"
references:
    - https://cybersecuritynews.com/hijacking-websites-microsoft-teams-users/
