id: 019cdc1b-d063-72e8-b6a5-5c167e644d2d
name: 'CVE-2026-26117: Hijacking Azure Arc on Windows for Local Privilege Escalation & Cloud Identity Takeover'
description: KQL Query
query: "DeviceInfo\r\n| where Timestamp > ago(30d)\r\n| summarize arg_max(Timestamp, *) by DeviceName\r\n| where IsInternetFacing == true\r\n| where isnotempty(PublicIP)\r\n| where CloudPlatforms has \"Arc\"\r\n| join DeviceTvmSoftwareVulnerabilities on DeviceName\r\n| where CveId == \"CVE-2026-26117\""
query_type: kql
severity: medium
tags:
    - kql
author: Steven Lim
version: "2"
