id: 019c4407-6e03-7476-92e4-3c902aa82fbf
name: 'Possible AD dump '
description: Identity LOLBA trying to dump AD server credentials and security information´s
query: "DeviceProcessEvents\r\n| where FileName in~ (\"fsutil.exe\",\"robocopy.exe\",\"ntdsutil.exe\",\"wbadmin.exe\",\"vssadmin.exe\",\"reg.exe\")\r\n| where ProcessCommandLine has_any (\"\\\\config\\\\SECURITY\",\"NTDS\\ntds.dit\",\"\\\\config\\\\SYSTEM\")\r\n| project Timestamp, DeviceName,AccountName, FileName,InitiatingProcessVersionInfoFileDescription,PWSCmd=ProcessCommandLine,FolderPath,SHA256,InitiatingProcessFileName,\r\nInitiatingProcessCommandLine,InitiatingProcessVersionInfoCompanyName,InitiatingProcessFolderPath,InitiatingProcessSHA256,\r\nInitiatingProcessParentFileName"
query_type: kql
severity: medium
techniques:
    - T1003
tags:
    - kql
author: Enzima45
version: "2"
