id: 019c4de4-5884-71df-8547-48626cc1cd38
name: Microsoft ClickFix - RunMRU Suspicious Commands
description: This rule detects suspicious commands being added to the Run Most Recently Used (MRU) registry key, often associated with the Microsoft ClickFix social engineering technique. It looks for modifications to the 'RunMRU' registry key by 'explorer.exe' where the 'RegistryValueData' contains specific keywords or patterns. These patterns include the '✅' character, a combination of common scripting/execution tools (powershell, mshta, curl, msiexec) with non-Latin characters, 'mshta' not in typical benign values, 'bitsadmin', 'forfiles', 'ProxyCommand=', or 'cmd'/'powershell' commands with obfuscation techniques, web requests, or code execution indicators.
query: |
    // Microsoft ClickFix - RunMRU suspicious commands
    // Author: Daniel Jeremiah | Date: 2026/02/11
    // Ref: https://www.microsoft.com/en-us/security/blog/2025/08/21/think-before-you-clickfix-analyzing-the-clickfix-social-engineering-technique/
    // Source: Microsoft blog hunting query

    DeviceRegistryEvents
    | where ActionType =~ "RegistryValueSet"
    | where InitiatingProcessFileName =~ "explorer.exe"
    | where RegistryKey has @"\CurrentVersion\Explorer\RunMRU"
    | where RegistryValueData has "✅"
        or (RegistryValueData has_any ("powershell", "mshta", "curl", "msiexec", "^")
            and RegistryValueData matches regex "[\u0400-\u04FF\u0370-\u03FF\u0590-\u05FF\u0600-\u06FF\u0E00-\u0E7F\u2C80-\u2CFF\u13A0-\u13FF\u0530-\u058F\u10A0-\u10FF\u0900-\u097F]")
        or (RegistryValueData has "mshta" and RegistryValueName !~ "MRUList" and RegistryValueData !in~ ("mshta.exe\\1", "mshta\\1"))
        or (RegistryValueData has_any ("bitsadmin", "forfiles", "ProxyCommand=") and RegistryValueName !~ "MRUList")
        or ((RegistryValueData startswith "cmd" or RegistryValueData startswith "powershell")
            and (RegistryValueData has_any ("-W Hidden ", " -eC ", "curl", "E:jscript", "ssh", "Invoke-Expression", "UtcNow", "Floor", "DownloadString", "DownloadFile", "FromBase64String", "System.IO.Compression", "System.IO.MemoryStream", "iex", "Invoke-WebRequest", "iwr", "Get-ADDomainController", "InstallProduct", "-w h", "-X POST", "Invoke-RestMethod", "-NoP -W", ".InVOKe", "-useb", "irm ", "^", "[char]", "[scriptblock]", "-UserAgent", "UseBasicParsing", ".Content")
                or RegistryValueData matches regex @"[-/–][Ee^]{1,2}[NnCcOoDdEeMmAa^]*\s[A-Za-z0-9+/=]{15,}"))
    | project TimeGenerated, DeviceName, RegistryKey, RegistryValueName, RegistryValueData, InitiatingProcessFileName
query_type: kql
severity: medium
tags:
    - kql
version: "3"
