id: 019c0b74-ba13-707e-80c7-5604a56b539d
name: TI map Email entity to SharePoint sharing outside the organization
description: This rule detects instances where a SharePoint or OneDrive file/folder is shared with a guest user whose email address is identified as a threat intelligence indicator. This could indicate an attempt to exfiltrate data to a known malicious entity or an account compromise being used for data staging.
query: "let dt_lookBack = 1h;\r\nlet ioc_lookBack = 14d;\r\nlet emailregex = @'^[a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\\.[a-zA-Z0-9-.]+$';\r\nlet OfficeEvents = materialize(\r\n    OfficeActivity  \r\n    | where TimeGenerated >= ago(dt_lookBack)  \r\n    | where RecordType == \"SharePointSharingOperation\"  \r\n    | where OfficeWorkload in (\"SharePoint\", \"OneDrive\")\r\n    | where Operation in (\"AddedToSecureLink\", \"AddedToSharingLink\", \"AddedToGroup\", \"SharingSet\")  \r\n    | where TargetUserOrGroupType == \"Guest\"  \r\n    // Normalize  \r\n    | extend GuestUPN = tolower(TargetUserOrGroupName)  \r\n    // Remove #ext# and tenant suffix  \r\n    | extend GuestUPN_Clean = replace(\"#ext#@\", \"@\", GuestUPN)  \r\n    // Split user and tenant  \r\n    | extend GuestLeft = tostring(split(GuestUPN_Clean, \"@\")[0])  \r\n    // Extract domain (everything after last underscore)  \r\n    | extend GuestDomain = extract(@\"_([^_]+)$\", 1, GuestLeft)  \r\n    // Extract local-part (everything before last underscore)  \r\n    | extend GuestLocal = replace(@\"_([^_]+)$\", \"\", GuestLeft)  \r\n    // Build proper external email  \r\n    | extend ExternalEmail = strcat(GuestLocal, \"@\", GuestDomain)  \r\n    | project-reorder\r\n        TimeGenerated,  \r\n        Operation, \r\n        OfficeObjectId,  \r\n        UserId,\r\n        TargetUserOrGroupName,  \r\n        ExternalEmail,  \r\n        GuestDomain,\r\n        TargetUserOrGroupType\r\n    | project-rename OfficeActivity_TimeGenerated = TimeGenerated);\r\nlet OfficeActivityUPNs = OfficeEvents\r\n    | distinct ExternalEmail = tolower(ExternalEmail)\r\n    | summarize make_list(ExternalEmail);\r\nThreatIntelIndicators\r\n| extend IndicatorType = replace(@\"\\[|\\]|\\\"\"\", \"\", tostring(split(ObservableKey, \":\", 0)))\r\n| where IndicatorType == \"email-addr\" or IndicatorType == \"email-message\"\r\n| extend EmailAddress = ObservableValue\r\n| extend EmailSourceDomain = substring(EmailAddress, indexof(EmailAddress, \"@\") + 1, strlen(EmailAddress) - indexof(EmailAddress, \"@\") - 1)\r\n| extend TrafficLightProtocolLevel = tostring(parse_json(AdditionalFields).TLPLevel)\r\n| where TimeGenerated >= ago(ioc_lookBack) \r\n| where tolower(EmailAddress) in (OfficeActivityUPNs)\r\n| summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by Id, ObservableValue\r\n| where IsActive and (ValidUntil > now() or isempty(ValidUntil))\r\n| extend Description = tostring(parse_json(Data).description)\r\n| where Description !contains_cs \"State: inactive;\" and Description !contains_cs \"State: falsepos;\"\r\n| project-reorder *, TrafficLightProtocolLevel, EmailAddress, EmailSourceDomain, Type\r\n// using innerunique to keep perf fast and result set low, we only need one match to indicate potential malicious activity that needs to be investigated\r\n| join kind=innerunique (OfficeEvents) on $left.EmailAddress == $right.ExternalEmail\r\n| where OfficeActivity_TimeGenerated < ValidUntil\r\n| summarize OfficeActivity_TimeGenerated = arg_max(OfficeActivity_TimeGenerated, *) by Id, ExternalEmail\r\n| extend ActivityGroupNames = extract(@\"ActivityGroup:(\\S+)\", 1, tostring(parse_json(Data).labels))\r\n| project\r\n    OfficeActivity_TimeGenerated,\r\n    Description,\r\n    ActivityGroupNames,\r\n    Id,\r\n    ValidUntil,\r\n    Confidence,\r\n    UserId,\r\n    EmailAddress,\r\n    EmailSourceDomain,\r\n    ExternalEmail,\r\n    ClientIP,\r\n    Operation,\r\n    UserType,\r\n    RecordType,\r\n    OfficeWorkload,\r\n    Parameters,\r\n    OfficeObjectId\r\n| extend\r\n    Name = tostring(split(ExternalEmail, '@', 0)[0]),\r\n    UPNSuffix = tostring(split(ExternalEmail, '@', 1)[0])\r\n| extend timestamp = OfficeActivity_TimeGenerated"
query_type: kql
severity: medium
tactics:
    - TA0009
    - TA0042
techniques:
    - T1213.002
    - T1074.001
    - T1074.002
    - T1586.002
tags:
    - kql
author: BartoszTurek
version: "2"
references:
    - https://medium.com/capturedsignal/microsoft-sentinel-threat-intelligence-mapping-to-the-sharepoint-file-external-sharing-86f48579abe7
