id: 019c08af-a4b4-77c9-9e15-01f99948a8be
name: VS Code Extension Spawning ScreenConnect
description: This rule detects the creation of a process where the parent process is 'node.exe' (associated with Node.js, often used by VS Code extensions) and the child process is either 'ScreenConnect.ClientService.exe' or has 'ScreenConnect' in its command line. This behavior could indicate a VS Code extension spawning a ScreenConnect remote access tool, which might be malicious.
query: "DeviceProcessEvents\r\n| where ActionType == \"ProcessCreated\"\r\n| where InitiatingProcessFileName =~ \"node.exe\"\r\n| where FileName =~ \"ScreenConnect.ClientService.exe\" or ProcessCommandLine has \"ScreenConnect\"\r\n| project\r\n    TimeGenerated,\r\n    DeviceName,\r\n    AccountName,\r\n    InitiatingProcessFileName,\r\n    InitiatingProcessCommandLine,\r\n    FileName,\r\n    ProcessCommandLine,\r\n    ParentProcessId,\r\n    ProcessId\r\n"
query_type: kql
severity: medium
tactics:
    - TA0011
techniques:
    - T1219.002
tags:
    - kql
author: Kaung Khant Ko
version: "1"
