id: 019c8a0c-43ad-76fe-95ad-1b38832440a7
name: 'Anomalous svchost.com Execution_MuddyWater Operation Olalampo Campaign '
description: Detects the execution of an executable named 'svchost.com' from the 'C:\Windows\' directory. This is a known persistence and masquerading technique used by the threat actor MuddyWater. The legitimate Windows process is 'svchost.exe' and is located in the System32 directory.
query: "DeviceProcessEvents\r\n| where FolderPath =~ @\"C:\\Windows\\\" and FileName =~ \"svchost.com\"\r\n| project\r\n    Timestamp,\r\n    DeviceName,\r\n    FileName,\r\n    FolderPath,\r\n    ProcessCommandLine,\r\n    SHA256,\r\n    AccountName"
query_type: kql
severity: medium
techniques:
    - T1543.003
tags:
    - kql
author: Kaung Khant Ko
version: "1"
references:
    - https://www.group-ib.com/blog/muddywater-operation-olalampo/
