id: 019c04b6-696b-7589-9c01-fb654dfc9597
name: PXA Stealer - Suspicious CMD Execution via Office/Scripting with Curl Download and Cleanup
description: Detects the execution of 'cmd.exe' initiated by common Microsoft Office applications, scripting engines, or msiexec.exe, where the command line includes 'curl' for downloading a '.pdf' file and also attempts to delete files using 'del /s /q'. This behavior is often associated with initial access, download of malicious payloads, and cleanup activities by adversaries. The rule specifically looks for command lines that interact with 'Users\Public', 'conhost.exe', or use the '--headless' flag, which can indicate automated or background execution.
query: "DeviceProcessEvents\r\n| where FileName =~ \"cmd.exe\"\r\n| where InitiatingProcessFileName in~ (\r\n    \"powershell.exe\",\r\n    \"pwsh.exe\",\r\n    \"wscript.exe\",\r\n    \"cscript.exe\",\r\n    \"mshta.exe\",\r\n    \"winword.exe\",\r\n    \"excel.exe\",\r\n    \"outlook.exe\",\r\n    \"msiexec.exe\"\r\n)\r\n| where ProcessCommandLine has_all (\r\n    \"curl\",\r\n    \"-s\",\r\n    \"-o\",\r\n    \".pdf\",\r\n    \"del /s /q\"\r\n)\r\n| where ProcessCommandLine has_any (\r\n    \"Users\\\\Public\",\r\n    \"conhost.exe\",\r\n    \"--headless\"\r\n)\r\n| project\r\n    Timestamp,\r\n    DeviceName,\r\n    AccountName,\r\n    ProcessCommandLine,\r\n    InitiatingProcessFileName,\r\n    InitiatingProcessCommandLine\r\n"
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0011
    - TA0005
techniques:
    - T1059.003
    - T1105
    - T1218.005
    - T1204.002
    - T1059.001
    - T1059.005
    - T1059.007
tags:
    - kql
author: AwaisM
version: "6"
