id: 019cf54c-61d9-71d0-994b-b9e385c7143e
name: Modification or Access of oskmenu.xml by Non-System Account
description: This rule detects when the 'oskmenu.xml' file, located in 'C:\Program Files\Common Files\microsoft shared\ink\fsdefinitions', is accessed or modified by any process not running under the SYSTEM account. This file is associated with the On-Screen Keyboard and its modification by non-system accounts could indicate an attempt to alter its behavior, potentially for persistence or privilege escalation.
query: "DeviceFileEvents\r\n| where FolderPath has_all (@\"C:\\Program Files\\Common Files\\microsoft shared\\ink\\fsdefinitions\") and FileName =~ \"oskmenu.xml\"\r\n| where ActionType in (\"FileAccessed\", \"FileModified\")\r\n| where InitiatingProcessAccount != \"SYSTEM\"\r\n"
query_type: kql
severity: medium
techniques:
    - T1112
    - T1055
    - DS0009
tags:
    - kql
version: "2"
