id: 019c2e16-0009-764c-9981-c6dc15d15d89
name: Potential OpenClaw Installation via Node.js or Direct URL
description: This rule detects the execution of 'node' with 'install' and 'openclaw' in its command line, or any process command line containing 'https://openclaw.ai/install.'. This indicates an attempt to install or execute the 'openclaw' tool, potentially for malicious purposes or unauthorized software deployment.
query: "DeviceProcessEvents\r\n| where Timestamp > ago(1h)\r\n| where (InitiatingProcessFileName == \"node\" and InitiatingProcessCommandLine has \"install\" and InitiatingProcessCommandLine has \"openclaw\") or InitiatingProcessCommandLine has \"https://openclaw.ai/install.\" or InitiatingProcessCommandLine has \"https://github.com/openclaw/openclaw.git\"\r\n| project Timestamp, ActionType, DeviceName, AccountUpn, InitiatingProcessCommandLine "
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0008
techniques:
    - T1059
    - T1072
tags:
    - kql
author: Steven Lim
version: "13"
