id: 019cfa34-8c8e-73af-afed-44557c9d8557
name: Potential Discord Webhook Exfiltration or C2 (Microstealer)
description: This rule detects network connections to a specific Discord webhook URL and another suspicious domain (78smp.com/m/). This pattern is often associated with malware attempting to exfiltrate data or establish command and control (C2) via Discord webhooks, or other suspicious domains.
query: "DeviceNetworkEvents\r\n| where RemoteUrl == \"78smp.com/m/\"\r\n    or RemoteUrl == \"discord.com/api/webhooks/1460660027969896695/FQ2nam1vUVDwLbiTZCPen9C53eBMg_qB3-z8pGRtZ3ZerbyflDnzfmJVLpgElxMNfO41\"\r\n| project TimeGenerated, DeviceName, RemoteUrl, RemoteIP, InitiatingProcessFileName, InitiatingProcessCommandLine\r\n"
query_type: kql
severity: medium
tactics:
    - TA0010
techniques:
    - T1567.004
tags:
    - kql
version: "1"
