id: 019d0f87-4d0a-745e-8fae-bedf27707a81
name: INC Ransomware Command Execution
description: 'KQL Query from file: INC Ransomware Command Execution'
query: "DeviceProcessEvents\r\n| where FolderPath has @\"c:\\perflogs\\\"\r\n| where ProcessCommandLine has_all(\"--sup\", \"--hide\", \"--mode\") \r\n    and ProcessCommandLine has \"medium\"\r\n| project \r\n    TimeGenerated, \r\n    DeviceName, \r\n    InitiatingProcessAccountName, \r\n    FileName, \r\n    FolderPath, \r\n    ProcessCommandLine, \r\n    SHA256, \r\n    InitiatingProcessCommandLine, \r\n    InitiatingProcessFileName\r\n"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1564
    - T1564.011
tags:
    - kql
version: "1"
