id: 019d106c-0551-732a-888f-ba68e3cc2c1a
name: Azure Arc Metadata Request
description: Detects processes making HTTP/HTTPS requests to localhost on ports 40341 or 40342 for '/metadata'. This pattern can indicate local service discovery, inter-process communication, or potentially malicious activity attempting to interact with local services, possibly for credential access or privilege escalation.
query: "DeviceProcessEvents\r\n| where ProcessCommandLine has_any(\"40341\", \"40342\") and ProcessCommandLine has \"metadata\"\r\n| where ProcessCommandLine matches regex @\"(?i)https?://(127\\.0\\.0\\.1|localhost):4034[12]/metadata\"\r\n| project TimeGenerated, DeviceName, AccountName, InitiatingProcessAccountName, InitiatingProcessFileName, FileName, ProcessCommandLine, FolderPath\r\n\r\n"
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0007
    - TA0011
techniques:
    - T1059
    - T1049
    - T1071
tags:
    - kql
version: "1"
