id: 019d0f86-241f-701f-ad2c-a0c0cf741036
name: Outbound Connection to File Sharing or Temporary Email Services
description: This rule detects outbound network connections to URLs associated with common file sharing services (e.g., Dropbox, Mega, Gofile) or temporary email providers (e.g., Temp-Mail). Such connections can indicate data exfiltration attempts, use of unsanctioned services, or communication with command and control infrastructure.
query: "DeviceNetworkEvents\r\n| where ActionType == \"ConnectionOutbound\"\r\n| where RemoteUrl has_any (\r\n    \"elastic\",\"dropbox\",\"mega\",\"transfer\",\"gofile\",\r\n    \"anonfiles\",\"file.io\",\"storage\",\"blob\",\"upload\",\r\n    \"temp-mail\",\"mail\",\"vpn\",\"safing\"\r\n)\r\n| project \r\n    TimeGenerated,\r\n    DeviceName,\r\n    DeviceId,\r\n    InitiatingProcessAccountName,\r\n    InitiatingProcessFileName,\r\n    InitiatingProcessFolderPath,\r\n    InitiatingProcessCommandLine,\r\n    InitiatingProcessSHA256,\r\n    RemoteIP,\r\n    RemotePort,\r\n    RemoteUrl,\r\n    Protocol\r\n"
query_type: kql
severity: medium
tactics:
    - TA0010
techniques:
    - T1567.002
    - T1020
tags:
    - kql
version: "1"
