id: 019d0072-31d1-74ca-af9c-f27e14492e2e
name: Crimson Kingsnake – Malicious PDF Metadata Detection
description: Description- Detects PDF invoice files associated with Crimson Kingsnake using consistent metadata author “hpins”.
query: "DeviceFileEvents\r\n| where FileName endswith \".pdf\"\r\n| where AdditionalFields has \"hpins\"\r\n| project TimeGenerated, DeviceName, FileName, FolderPath\r\n"
query_type: kql
severity: medium
tags:
    - kql
version: "1"
