id: 019d1f48-5e2b-77be-aafe-e2c3b231eac2
name: Suspicious Command-Line Activity with System Binaries
description: Detects suspicious command-line executions involving common Windows system binaries (rundll32.exe, mshta.exe, certutil.exe, wmic.exe) combined with keywords often associated with network communication or data transfer (http, https, base64, /transfer). This pattern can indicate attempts at downloading malicious payloads, exfiltrating data, or executing encoded commands.
query: "DeviceProcessEvents\r\n| where TimeGenerated >= ago(1d)\r\n| where FileName in~ (\"rundll32.exe\",\"mshta.exe\",\"certutil.exe\",\"wmic.exe\")\r\n| where ProcessCommandLine has_any (\"http\",\"https\",\"base64\",\"/transfer\")\r\n| project TimeGenerated, DeviceName, FileName, ProcessCommandLine"
query_type: kql
severity: medium
tactics:
    - TA0005
    - TA0002
techniques:
    - T1218
    - T1218.011
    - T1218.005
    - T1047
tags:
    - kql
version: "1"
