id: 019d1414-2490-71ff-b8a4-2f91e971b449
name: Azure Monitor abused for callback phishing attacks
description: Detects inbound emails originating from 'azure-noreply@microsoft.com' with subjects that typically indicate financial transactions (e.g., 'Invoice Paid', 'Payment Reference') or system alerts (e.g., 'MemorySpike', 'DiskFull'). This pattern could be indicative of phishing attempts leveraging a seemingly legitimate sender to trick recipients.
query: "EmailEvents\r\n| where EmailDirection == \"Inbound\"\r\n| where SenderFromAddress =~ \"azure-noreply@microsoft.com\"\r\n| where Subject has_any (\r\n    \"Invoice Paid\", \r\n    \"Payment Reference\", \r\n    \"Funds Successfully Received\", \r\n    \"order-\", \r\n    \"INV-\"\r\n)\r\nor Subject matches regex @\"(?i)(MemorySpike|DiskFull).*(triggered|resolved)\"\r\n| project \r\n    TimeGenerated, \r\n    SenderFromAddress, \r\n    SenderIPv4, \r\n    RecipientEmailAddress, \r\n    Subject, \r\n    DeliveryAction, \r\n    NetworkMessageId\r\n"
query_type: kql
severity: medium
tactics:
    - TA0001
techniques:
    - T1566
tags:
    - kql
version: "1"
