id: 019d1f63-dbfe-76d8-867f-caf5076f1423
name: Suspicious VPN Domain or IP Access
description: This rule detects network connections to suspicious domains or IP addresses associated with potentially compromised or malicious VPN infrastructure. Specifically, it looks for connections to 'vpn-fortinet.com', 'ivanti-vpn.org', 'forticlient-vpn.de', or the IP address '194.76.226.93'. These indicators may suggest attempts to establish command and control, exfiltrate data, or engage in other malicious activities via compromised VPN services.
query: "CommonSecurityLog\r\n| where RequestURL has_any (\"vpn-fortinet.com\", \"ivanti-vpn.org\", \"forticlient-vpn.de\")\r\n       or DestinationDnsDomain has_any (\"vpn-fortinet.com\", \"ivanti-vpn.org\", \"forticlient-vpn.de\")\r\n       or DestinationIP in (\"194.76.226.93\")\r\n| project TimeGenerated, DeviceName, SourceIP, DestinationIP, DestinationPort, RequestURL, DestinationDnsDomain, Activity, ThreatSeverity, IndicatorThreatType\r\n| sort by TimeGenerated desc\r\n"
query_type: kql
severity: medium
tactics:
    - TA0011
techniques:
    - T1071.001
tags:
    - kql
version: "1"
