id: 019d1ef0-1474-762f-ac2d-099cc9deb4e2
name: IIS Server Lateral Movement Attempt
description: This rule detects potential lateral movement attempts originating from IIS web servers (identified by 'w3wp.exe' as the initiating process) to other internal IP addresses using common lateral movement ports (SMB, RDP, WinRM, SSH). It specifically looks for successful network connections from an IIS server to a private IP address on one of the specified ports, where the remote IP is not the local IP.
query: " let LatMovePorts = dynamic([445, 3389, 5985, 5986, 22]);\r\nlet iis_servers = DeviceNetworkEvents\r\n| where InitiatingProcessFileName =~ \"w3wp.exe\"\r\n| distinct DeviceId;\r\nDeviceNetworkEvents\r\n| where DeviceId in (iis_servers)\r\n| where ActionType == \"ConnectionSuccess\"\r\n| where ipv4_is_private(RemoteIP)\r\n| where RemoteIP != LocalIP\r\n| where RemotePort in (LatMovePorts)\r\n| summarize ConnectionCount=count(), FirstSeen=min(TimeGenerated), LastSeen=max(TimeGenerated) \r\n    by DeviceName, DeviceId, LocalIP, RemoteIP, RemotePort, InitiatingProcessFileName, InitiatingProcessCommandLine\r\n"
query_type: kql
severity: medium
tactics:
    - TA0008
techniques:
    - T1021
    - T1210
tags:
    - kql
version: "2"
