id: 039611d0-265b-423d-9eb6-f8f13758dff0
name: WinRAR Path Traversal Vulnerability | CVE-2025-8088 and CVE‐2025‐6218
description: A recent WinRAR zero day CVE-2025-8088 (and older one CVE‑2025‑6218) where threat actors weaponized archives and exploited this vulnerability to drop malicious DLLs into Startup folder, Task Scheduler directories, or other sensitive paths.
query: "DeviceFileEvents\r\n| where FileName endswith \".lnk\" or FileName endswith \".bat\" or FileName endswith \".exe\" or FileName endswith \".dll\" or FileName endswith \".pdf\"\r\n| extend normalizedFolder = tolower(FolderPath)\r\n| where normalizedFolder has \\\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\r\n| where InitiatingProcessFileName endswith \".exe\"\r\n| where InitiatingProcessCommandLine contains \".rar\" or InitiatingProcessCommandLine contains \"winrar\"\r\n| project Timestamp, DeviceName, FileName, FolderPath, InitiatingProcessFileName, InitiatingProcessCommandLine, SHA256"
query_type: kql
severity: medium
tags:
    - kql
version: "1"
references:
    - https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability/
