id: 049162ad-e0e9-469a-ae47-34f1388079f3
name: RDP Session to Unmanaged or Non-TPM Device
description: This rule detects RDP sessions initiated from managed devices to unmanaged devices or devices that do not have a Trusted Platform Module (TPM) enabled or supported. This can pose a security risk, especially when Windows Hello for Business credentials are used, as the keys might not be adequately protected on the destination device.
query: |-
    let no_tpm_devices = (
        ExposureGraphNodes
        // Get device nodes with their inventory ID
        | where NodeLabel == "device"
        | mv-expand EntityIds
        | where EntityIds.type == "DeviceInventoryId"
        // Get interesting properties
        | extend OnboardingStatus = tostring(parse_json(NodeProperties)["rawData"]["onboardingStatus"]),
            TpmSupported = tostring(parse_json(NodeProperties)["rawData"]["tpmData"]["supported"]),
            TpmEnabled = tostring(parse_json(NodeProperties)["rawData"]["tpmData"]["enabled"]),
            TpmActivated = tostring(parse_json(NodeProperties)["rawData"]["tpmData"]["activated"]),
            DeviceName = tostring(parse_json(NodeProperties)["rawData"]["deviceName"]),
            DeviceId = tostring(EntityIds.id)
        // Search for distinct devices
        | distinct DeviceId, DeviceName, OnboardingStatus, TpmSupported, TpmEnabled, TpmActivated
        // Get Unmanaged devices and device not supporting a TPM
        | where OnboardingStatus != "Onboarded" or (TpmSupported != "true" and TpmActivated != "true" and TpmEnabled != "true")
        | extend TpmSupported = iff(TpmSupported == "", "unknown", TpmSupported),
            TpmActivated = iff(TpmActivated == "", "unknown", TpmActivated),
            TpmEnabled = iff(TpmEnabled == "", "unknown", TpmEnabled)
    );
    let no_tpm_device_info = (
        DeviceNetworkInfo
        | where Timestamp > ago(7d)
        // Get latest network info for each device ID
        | summarize arg_max(Timestamp, *) by DeviceId
        | mv-expand todynamic(IPAddresses)
        | extend IPAddress = tostring(IPAddresses.IPAddress)
        // Find no TPM devices and join with their network information
        | join kind=inner no_tpm_devices on DeviceId
        | project DeviceId, DeviceName, MacAddress, IPAddress, OnboardingStatus, TpmActivated, TpmEnabled, TpmSupported
    );
    DeviceNetworkEvents
    // Search for RDP connections to non-tpm devices
    | where Timestamp > ago(1h)
    | where ActionType == "ConnectionSuccess"
    | where RemotePort == 3389
    // Exclude MDI RDP Connections (known for NNR)
    | where InitiatingProcessFileName !~ "microsoft.tri.sensor.exe"
    | join kind=inner no_tpm_device_info on $left.RemoteIP == $right.IPAddress
    | project-rename RemoteDeviceId = DeviceId1, RemoteDeviceName = DeviceName1, RemoteMacAddress = MacAddress, RemoteDeviceOnboardingStatus = OnboardingStatus, RemoteDeviceTpmActivated = TpmActivated, RemoteDeviceTpmEnabled = TpmEnabled, RemoteDeviceTpmSupported = TpmSupported
    | project-away IPAddress
query_type: kql
severity: medium
tactics:
    - TA0008
techniques:
    - T1021.001
    - T1021
tags:
    - kql
version: "1"
references:
    - https://hybridbrothers.com/detecting-non-privileged-windows-hello-abuse/
