id: 0793165f-df95-4ed1-acd7-c106f105a16c
name: Upcoming End-of-Support Software Detection
description: This rule identifies software installed on devices that is approaching its end-of-support (EOS) date. It queries the DeviceTvmSoftwareInventory table to find software with an 'Upcoming EOS Version' status, providing details such as device name, software name, vendor, version, EOS status, and EOS date. This can help in proactive patch management and identifying potential security risks associated with outdated software.
query: "DeviceTvmSoftwareInventory\r\n| where EndOfSupportStatus == \"Upcoming EOS Version\"\r\n| summarize count() by DeviceName, SoftwareName,SoftwareVendor, SoftwareVersion,  EndOfSupportStatus, EndOfSupportDate"
query_type: kql
severity: medium
tactics:
    - TA0007
techniques:
    - T1518
tags:
    - kql
version: "1"
