id: 0aa0d565-5bc8-4737-939f-f8da1ee0bf5e
name: ADFS Redirect Phishing attempts
description: |
    Hackers steal Microsoft logins using legitimate ADFS redirects
query: "DeviceNetworkEvents\r\n| where RemoteUrl has_any (\"office\", \"microsoftonline\")\r\n| where RemoteUrl !endswith \"measure.office.com\"\r\n| where InitiatingProcessFileName in~ (\"chrome.exe\", \"msedge.exe\")\r\n| summarize count()by RemoteUrl"
query_type: kql
severity: medium
techniques:
    - T1566.002
tags:
    - kql
author: Vikas Khandelwal
version: "1"
references:
    - https://www.bleepingcomputer.com/news/security/hackers-steal-microsoft-logins-using-legitimate-adfs-redirects/
