id: 0afad36b-7161-4eb3-a40f-fa42aaf0e3c5
name: '[RW] - Detect Suspicious Actions To Change Desktop Background'
description: KQL Query
query: |-
    DeviceProcessEvents
    | where ProcessCommandLine has_any (
     "reg delete \"HKCU\\Control Panel\\Desktop\"",
     "reg add \"HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\ActiveDesktop\"",
     "NoChangingWallPaper"
    )
    | project Timestamp, DeviceName, InitiatingProcessFileName, ProcessCommandLine, AccountName, ReportId
query_type: kql
severity: medium
tactics:
    - TA0040
techniques:
    - T1490
tags:
    - Ransomware
    - SergioAlbea
    - KQL
author: Sergio Albea
version: "1"
references:
    - https://www.linkedin.com/in/sergioalbea/
