id: 0b516d59-6647-49e0-ab54-11d2d8d01898
name: 'Brute Force Detection: Multiple Failures Followed by Success'
description: Detects potential brute force attacks by identifying multiple failed logon attempts followed by a successful logon within a short period.
query: "#### Identifies accounts who have failed to logon to the domain multiple times in a row, followed by a successful authentication within a short time frame. Multiple failed attempts followed by a success can be an indication of a brute force attempt or possible mis-configuration of a service account within an environment.\n#### The lookback is set to 2h and the authentication window and threshold are set to 1h and 5, meaning we need to see a minimum of 5 failures followed by a success for an account within 1 hour to surface an alert.\n\n## Mitre Att&Ck (Credential Access)\n### T1110 - Brute Force\n\n#### Query: \n```KQL\n// Parameters\nlet lookbackPeriod = 2h;\nlet authenticationWindow = 1h;\nlet failureThreshold = 5;\n// Filter logon events within the lookback period\nlet logonEvents = IdentityLogonEvents\n    | where TimeGenerated >= ago(lookbackPeriod)\n    | project\n        TimeGenerated,AccountUpn, AccountSid, AccountName, IPAddress, DeviceName, Logonstatus = iff(ActionType == \"LogonSuccess\", \"LogonSuccess\", \"LogonFailed\");\n// Identify failure sequences\nlet failureSequences = logonEvents\n    | where Logonstatus == \"LogonFailed\"\n    | summarize\n        FailureCount = count(),\n        StartTime = min(TimeGenerated),\n        EndTime = max(TimeGenerated)\n        by AccountUpn, AccountSid, bin(TimeGenerated, authenticationWindow)\n    | where FailureCount >= failureThreshold;\n// Identify success events\nlet successEvents = logonEvents\n    | where Logonstatus == \"LogonSuccess\";\n// Join failure sequences with success events within the same time window\nfailureSequences\n| join kind=inner (\n    successEvents\n    | project SuccessTime = TimeGenerated, AccountUpn, AccountSid, AccountName, IPAddress, DeviceName\n    )\n    on AccountUpn, AccountSid\n| extend endAuthenticationWindow = StartTime + authenticationWindow\n| where SuccessTime between (StartTime .. endAuthenticationWindow)\n| project AccountUpn, AccountSid, FailureCount, StartTime, EndTime, SuccessTime, AccountName, IPAddress, DeviceName\n| order by SuccessTime desc\n```\n"
query_type: kql
version: "1"
