id: 0f285551-7223-42af-893b-ed0e954833f3
name: Possible M365 Account Compromise via Device Code Phishing Campaign
description: Possible compromise of Microsoft 365 account {{RecipientEmailAddress}} following a device code phishing campaign leveraging microsoft.com/devicelogin to obtain OAuth tokens from an attacker-controlled session.
query: "let DevUrls = dynamic([\"microsoft.com/devicelogin\",\"microsoftonline.com/common/oauth2/deviceauth\"]);\r\nEmailUrlInfo\r\n| where Url has_any (DevUrls)\r\n| join kind=inner (\r\n    EmailEvents\r\n    | project NetworkMessageId, Subject, SenderFromAddress, RecipientEmailAddress\r\n  ) on NetworkMessageId\r\n| project Timestamp,ReportId, NetworkMessageId, RecipientEmailAddress, SenderFromAddress, Subject, Url\r\n"
query_type: kql
severity: medium
tags:
    - kql
version: "1"
references:
    - https://www.blackhillsinfosec.com/dynamic-device-code-phishing/
