id: 0f2a369d-d189-4188-a32e-1afb07c069af
name: AntiVirus Scan Cancelled Devices
description: This rule detects instances where an antivirus scan has been cancelled on a device. It specifically looks for 'AntivirusScanCancelled' actions in device events and extracts the 'ScanTypeIndex' from additional fields to provide context on the type of scan that was cancelled. This could indicate an attempt to evade detection by disabling security software.
query: "DeviceEvents\r\n| where ActionType == @\"AntivirusScanCancelled\"\r\n| extend ScanType = parse_json(AdditionalFields)[\"ScanTypeIndex\"]\r\n| summarize count() by Timestamp, DeviceName, ActionType, tostring(ScanType)"
query_type: kql
severity: medium
tags:
    - kql
version: "1"
