id: 0fa776d1-7d3b-4754-a980-262aa6d8dc69
name: '[RW] - RDP Trace Removal Detection'
description: "New forensic techniques helps to have more insights about RDP-based attacks.By analyzing login sequences, screen tile caches, clipboard data, and session memory, analysts can now reconstruct full attacker activity during Remote Desktop sessions—even if the adversary tries to cover their tracks. \n\nThe following KQL Query helps to identify when a ransomware attack attempts to remove the mentioned evidence via script which will be identified as executed command."
query: "DeviceProcessEvents\n| where ProcessCommandLine has_all (\"delete\", \"\\\\Software\\\\Microsoft\\\\Terminal Server Client\\\\Default\") \n or ProcessCommandLine has_all (\"delete\", \"\\\\Software\\\\Microsoft\\\\Terminal Server Client\\\\Servers\")\n or ProcessCommandLine has_all (\"add\", \"\\\\Software\\\\Microsoft\\\\Terminal Server Client\\\\Servers\")\n| project Timestamp, DeviceName,DeviceId, AccountName, FileName, ProcessCommandLine, InitiatingProcessFileName, ReportId"
query_type: kql
severity: medium
techniques:
    - T1070.007
tags:
    - Ransomware
    - KQL
    - SergioAlbea
author: Sergio Albea
version: "1"
references:
    - https://medium.com/detect-fyi/identifying-ransomware-final-stage-activities-with-kql-queries-00b3cf0ef31b
