id: 130fa13d-7d28-46d5-96d9-6eca0d8a3890
name: Detection of LegionLoader via Clickfix Vector Executing .msi from RunMRU Registry Key
description: |+
    This detection identifies suspicious use of the Windows RunMRU registry key — typically used by Explorer to store command history — to execute .msi installer files. It specifically flags cases where a registry value under the RunMRU key contains a reference to a .msi file, which can indicate abuse by malware droppers such as LegionLoader.

query: "DeviceRegistryEvents\r\n| where RegistryKey has \"RunMRU\"\r\n| where ActionType in~ (\"RegistryValueSet\", \"RegistryKeyCreated\")\r\n| where RegistryValueData has \".msi\"\r\n| project Timestamp, DeviceName, ActionType, RegistryKey, RegistryValueData, InitiatingProcessAccountUpn\r\n   \r\n"
query_type: kql
severity: medium
techniques:
    - T1218.007
tags:
    - LegionLoader
    - Clickfix
    - kql
author: Riordz
version: "1"
references:
    - https://x.com/Ryan_Riordz/status/1933619810362937830
