id: 17793636-30f1-49c6-8a90-15e66a6bc642
name: Suspicious behavior by LOLBIN
description: |-
    Aggregating and translating to KQL the collection of detection of LOLBINs from the LOLBAS project:
    https://lolbas-project.github.io/
    Some of the detections will likely be noisy based on the environment, so tuning is required before deploying. NRT applicable when running in Defender portal
query: "DeviceProcessEvents\r\n| where \r\n(tolower(InitiatingProcessFileName) == \"vsjitdebugger.exe\" and not(tolower(FileName) in (\"vsimmersiveactivatehelper.exe\",\"devenv.exe\"))\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_susp_use_of_vsjitdebugger_bin.yml\r\nor (tolower(FileName) == \"vsls-agent.exe\" and tolower(ProcessCommandLine) contains \"--agentextensionpath\" and not(ProcessCommandLine contains \"Microsoft.VisualStudio.LiveShare.Agent.\")\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_vslsagent_agentextensionpath_load.yml\r\nor (tolower(FileName) == \"certutil.exe\" and tolower(ProcessCommandLine) has_any (\"decode\", \"encode\", \"urlcache\", \"verifyctl\", \"encodehex\", \"decodehex\")\r\n) // elastic rules/windows/defense_evasion_suspicious_certutil_commands.toml\r\nor (tolower(InitiatingProcessFileName) == \"hh.exe\" // NOTE: never seen as parent process before. Could be something legit pops up, see SIGMA rule for potential \"ok\" behavior - but invetigate still\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_hh_html_help_susp_child_process.yml\r\nor (tolower(FileName) == \"appinstaller.exe\" // NOTE: never seen as parent process before. Could be something legit pops up, see SIGMA rule for potential \"ok\" behavior - but investigate still\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_hh_html_help_susp_child_process.yml\r\nor (tolower(FileName) == \"forfiles.exe\" and tolower(ProcessCommandLine) has_any (\" /p \",\" -p \",\" /m \",\" -m \",\" /c \",\" -c \")\r\n// ) // SIGMA rules/windows/process_creation/proc_creation_win_lolbin_forfiles.yml\r\nor (tolower(FileName) == \"ssh.exe\" and tolower(ProcessCommandLine) has_any (\"proxycommand=\",\"localcommand\",\"permitlocalcommand\",\"localhost\")\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_lolbin_ssh.yml\r\nor (tolower(FileName) == \"unregmp2.exe\" and tolower(ProcessCommandLine) contains \"/hidewm\"\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_lolbin_unregmp2.yml\r\nor (tolower(InitiatingProcessParentFileName) == \"unregmp2.exe\" and tolower(FileName) == \"wmpnscfg.exe\"\r\n) // IOC at https://lolbas-project.github.io/lolbas/Binaries/Unregmp2/\r\nor (tolower(InitiatingProcessParentFileName) == \"wab.exe\" or (tolower(FileName) == \"wab.exe\")\r\n) // \"should normally never be used\" at https://lolbas-project.github.io/lolbas/Binaries/Wab/, but still seen\r\nor (tolower(FileName) == \"rdrleakdiag.exe\"  and tolower(ProcessCommandLine) has_any (\"fullmemdmp\", \"-memdmp\", \"/memdmp\") and ProcessCommandLine has_any (\" -o \",\" /o \",\" -p \",\" /p \")\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_rdrleakdiag_process_dumping.yml\r\nor (tolower(FileName) == \"msbuild.exe\" and tolower(InitiatingProcessFileName) in (\"eqnedt32.exe\", \"excel.exe\", \"fltldr.exe\",\"msaccess.exe\",\"mspub.exe\",\"outlook.exe\",\"powerpnt.exe\",\"winword.exe\")\r\n) // ELASTIC detection-rules/rules/windows/defense_evasion_execution_msbuild_started_by_office_app.toml\r\nor (tolower(FileName) == \"msbuild.exe\" and tolower(InitiatingProcessFileName) in ('wmiprvse.exe') \r\n) // SPLUNK detections/endpoint/suspicious_msbuild_spawn.yml\r\nor (tolower(FileName) in ('chrome.exe','code.exe','discord.exe','githubdesktop.exe','keybase.exe','msedge_proxy.exe','msedge.exe','msedgewebview2.exe','msteams.exe','slack.exe','teams.exe') and tolower(ProcessCommandLine) has_any ('--browser-subprocess-path','--gpu-launcher','--renderer-cmd-prefix','--utility-cmd-prefix') \r\n) // SIGMA rules/windows/process_creation/proc_creation_win_susp_electron_execution_proxy.yml\r\nor (tolower(FileName) == 'squirrel.exe' and tolower(ProcessCommandLine) has_any ('--download','--update','--updaterollback=','--processstart','--processstartandwait','--createshortcut') \r\n) // SIGMA rules/windows/process_creation/proc_creation_win_lolbin_squirrel.yml\r\nor (tolower(InitiatingProcessFileName) == 'appvlp.exe' and not (tolower(FileName) in ('msoasb.exe','rundll32.exe','spreadsheetcompare.exe','databasecompare.exe'))\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_lolbin_appvlp.yml\r\nor (tolower(FileName) == 'msdt.exe' and ((tolower(ProcessCommandLine) contains \"pcwdiagnostic\" and tolower(ProcessCommandLine) has_any (\" -af \",\" /af \") and tolower(InitiatingProcessFileName) != \"pcwrun.exe\") or (tolower( ProcessCommandLine) contains \"it_browseforfile=\"))\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_lolbin_msdt_answer_file.yml + rules/windows/process_creation/proc_creation_win_msdt_arbitrary_command_execution.yml\r\nor (tolower(InitiatingProcessFileName) == 'wt.exe' and (tolower(FileName) has_any ('rundll32.exe','regsvr32.exe','certutil.exe','cscript.exe','wscript.exe','csc.exe') and tolower(ProcessCommandLine) has_any ('c:\\\\users\\\\public\\\\','\\\\downloads\\\\','\\\\desktop\\\\','\\\\appdata\\\\local\\\\temp\\\\','\\\\windows\\\\temp\\\\') and tolower(ProcessCommandLine) has_any('commandline',' iex ',' icm','invoke-','import-module ','ipmo ','downloadstring(',' /c ',' /k ',' /r ')\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_windows_terminal_susp_children.yml\r\nor (tolower(FileName) in ('regasm.exe','regsvcs.exe') and (tolower(ProcessCommandLine) has_any ('\\\\users\\\\public\\\\','\\\\appdata\\\\local\\\\temp\\\\','\\\\desktop\\\\','\\\\downloads\\\\','\\\\perflogs\\\\','\\\\windows\\\\temp\\\\','\\\\microsoft\\\\windows\\\\start menu\\\\programs\\\\startup\\\\') or not(ProcessCommandLine contains \".dll\" or (ProcessCommandLine endswith \"Regasm.exe\\\"\" or ProcessCommandLine endswith \"Regsvcs.exe\\\"\" or ProcessCommandLine endswith \"Regasm.exe\" or ProcessCommandLine endswith \"Regsvcs.exe\"))))\r\n) // rules/windows/process_creation/proc_creation_win_lolbin_regasm.yml\r\nor (tolower(InitiatingProcessFileName) in ('regasm.exe','regsvcs.exe') and FileName !in (\"conhost.exe\")\r\n) // SPLUNK regasm/regsvcs spawning child process other than conhost.exe\r\nor ( tolower(FileName) == 'control.exe' and tolower(InitiatingProcessFileName) in ('winword.exe','powerpnt.exe','excel.exe')\r\n) // SIGMA rules-emerging-threats/2021/Exploits/CVE-2021-40444/proc_creation_win_exploit_cve_2021_40444.yml\r\nor ( tolower(InitiatingProcessFileName) == 'control.exe' and tolower(FileName) in ('rundll32.exe') and ProcessCommandLine !has \"Shell32.dll\"\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_rundll32_susp_control_dll_load.yml\r\nor ( tolower(FileName) == 'installutil.exe' and (tolower(ProcessCommandLine) has_all ('/logfile= ', '/logtoconsole=false') or tolower(ProcessCommandLine) has_any ('http://', 'https://', 'ftp://'))\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_instalutil_no_log_execution.yml + rules/windows/process_creation/proc_creation_win_lolbin_installutil_download.yml\r\nor ( tolower(FileName) == 'sqldumper.exe' and tolower(ProcessCommandLine) has_any ('0x0110', '0x01100:40')\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_lolbin_susp_sqldumper_activity.yml\r\nor ( tolower(FileName) == \"mshta.exe\" and (tolower(InitiatingProcessFileName) in ('cmd.exe','cscript.exe','powershell.exe','pwsh.exe','regsvr32.exe','rundll32.exe','wscript.exe','svchost.exe') or not(FolderPath has_any (\"C:\\\\Windows\\\\System32\\\\\",\"C:\\\\Windows\\\\SysWOW64\\\\\") or ProcessCommandLine has_any (\".hta\",\".htm\") or ProcessCommandLine endswith \"mshta.exe\" or ProcessCommandLine endswith \"mshta\"))\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_mshta_http.yml\r\nor ( tolower(ProcessCommandLine) has_all ('set','&&','mshta','vbscript:createobject','.run','(window.close)')\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_hktl_invoke_obfuscation_via_use_mhsta.yml\r\nor ( tolower(FileName) == 'vbc.exe' and tolower(InitiatingProcessFileName) in (\"wscript.exe\", \"mshta.exe\", \"cscript.exe\", \"wmic.exe\", \"svchost.exe\", \"rundll32.exe\", \"cmstp.exe\", \"regsvr32.exe\")\r\n) // rules/windows/defense_evasion_dotnet_compiler_parent_process.yml\r\nor (tolower(FileName) == 'fsutil.exe' and tolower(ProcessCommandLine) has_any ('deletejournal','createjournal','setzerodata','decode','trace')\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_susp_fsutil_usage.yml\r\nor ( tolower(FileName) == 'msconfig.exe' and tolower(InitiatingProcessFileName) == \"pkgmgr.exe\"\r\n) // rules/windows/process_creation/proc_creation_win_uac_bypass_msconfig_gui.yml\r\nor ( tolower(InitiatingProcessFileName) == 'eventvwr.exe' and not (tolower(FileName) in ('mmc.exe','werfault.exe'))\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_uac_bypass_eventvwr.yml\r\nor ( tolower(FileName) == \"winget.exe\" and tolower(ProcessCommandLine) has_any (\"install\", \" add \") and tolower(ProcessCommandLine) has_any (\"-m\", \"--manifest\")\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_winget_local_install_via_manifest.yml\r\nor ( tolower(FileName) == \"winget.exe\" and tolower(ProcessCommandLine) has_any (\"install\", \" add \") and tolower(ProcessCommandLine) has_any (\"-m\", \"--manifest\")\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_winget_local_install_via_manifest.yml\r\nor ( tolower(FileName) == \"fltmc.exe\" and tolower(ProcessCommandLine) has_all (\"unload\", \"sysmon\")\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_fltmc_unload_driver_sysmon.yml\r\nor ( tolower(FileName) == \"register-cimprovider.exe\" and tolower(ProcessCommandLine) has_all (\"-path\", \"dll\")\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_susp_register_cimprovider.yml\r\nor ( tolower(FileName) == \"bginfo.exe\" and tolower(ProcessCommandLine) has_all (\"/popup\", \"/nolicprompt\")\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_lolbin_bginfo.yml\r\nor ( tolower(ProcessCommandLine) has_all (\"extrac32.exe\",\".cab\")\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_lolbin_extrac32_ads.yml\r\nor ( tolower(FileName) == \"extrac32.exe\" and ProcessCommandLine contains \".cab\" \r\n) // SIGMA rules/windows/process_creation/proc_creation_win_lolbin_extrac32.yml\r\nor ( tolower(FileName) in (\"fsianycpu.exe\",\"fsi.exe\")\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_lolbin_fsharp_interpreters.yml\r\nor ( tolower(FileName) == \"regini.exe\" and tolower(ProcessCommandLine)  matches regex \":[^\\\\\\\\ ]\"\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_regini_ads.yml\r\nor (tolower(FileName) == \"tracker.exe\" and tolower(ProcessCommandLine)  has_any (\" /d \",\" /c \")\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_lolbin_tracker.yml\r\nor (tolower(FileName) == \"pcwrun.exe\" and ProcessCommandLine contains \"../\"\r\n) // rules/windows/process_creation/proc_creation_win_lolbin_pcwrun_follina.yml\r\nor ( tolower(FileName) == \"psr.exe\" and ProcessCommandLine contains \"/start\"\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_psr_capture_screenshots.yml\r\nor (tolower(InitiatingProcessFileName) == \"sqlps.exe\" or (tolower(FileName) == \"sqlps.exe\" and not(tolower(InitiatingProcessFileName) == \"sqlagent.exe\"))\r\n) // SIGMA rules/windows/process_creation/proc_creation_win_mssql_sqlps_susp_execution.yml\r\n) "
query_type: kql
severity: medium
techniques:
    - T1218
tags:
    - kql
author: Source added via comments next to each lolbin detection. Mostly from SigmaHQ, a few come from elastic Github repo
version: "1"
references:
    - https://github.com/SigmaHQ/sigma/tree/c04bef2fbbe8beff6c7620d5d7ea6872dbe7acba/rules
    - https://github.com/elastic/detection-rules/tree/f8f643041a584621e66cf8e6d534ad3db92edc29/rules
