id: 178002e4-fc17-46aa-9208-95c825c9b9c6
name: ClickFix social engineering attack detection
description: 'KQL Query from file: ClickFix social engineering attack detection'
query: |+
    // ClickFix social engineering attack detection
    // https://www.proofpoint.com/us/blog/threat-insight/security-brief-clickfix-social-engineering-technique-floods-threat-landscape
    // Threat actors are increasingly using 'ClickFix' social engineering attacks to deploy malware. Proofpoint's latest analysis reveals multiple campaigns since March 2024, targeting popular software like Microsoft Word and Google Chrome. Malware such as AsyncRAT, Danabot, DarkGate, Lumma Stealer, and NetSupport have been identified.

    DeviceEvents
    | where (ActionType == "GetClipboardData" and InitiatingProcessFileName has "powershell.exe") or
    (InitiatingProcessCommandLine has "powershell" and InitiatingProcessCommandLine has "-enc")

query_type: kql
tactics:
    - TA0002
    - TA0001
techniques:
    - T1204.004
    - T1059
    - T1059.004
    - T1059.001
    - T1566
tags:
    - kql
version: "1"
