id: 180e6f91-c94b-4bb3-aaa8-02d7068ba056
name: Suspicious Stealer Behavior
description: 'KQL Query from file: Suspicious Stealer Behavior'
query: "DeviceProcessEvents\r\n| where FileName == \"powershell.exe\"\r\n| where InitiatingProcessFileName == \"mshta.exe\"\r\n| where ProcessCommandLine has_any (\"-windowstyle hidden\",\"-w hidden\", \"-executionpolicy bypass\",\"-ep bypass\", \"-noprofile\", \"-nop\" )"
query_type: kql
severity: medium
tactics:
    - TA0002
tags:
    - kql
author: Kaung Khant Ko
version: "1"
