id: 187b0c99-01b5-4a90-a4e0-e2e79fda8ae9
name: IOC-Based Malicious Activity Detection
description: This rule detects communication with known malicious domains and IP addresses, as well as the presence or execution of files with known malicious MD5 or SHA256 hashes. It correlates threat intelligence with network and endpoint telemetry to identify compromised devices or accounts.
query: "## \U0001F50D KQL Description\n#### This query is used to:\n#### 1.Correlate threat intelligence with actual telemetry from your environment.\n#### 2.Identify compromised devices or accounts interacting with known malicious infrastructure.\n#### 3.Support incident response and containment.\n#### 4.Enable proactive threat hunting across multiple data sources..\n## \U0001F9E9 MITRE ATT&CK Mapping\n#### Tactic:\n#### Command and Control (TA0011)\n#### Execution (TA0002)\n#### Defense Evasion (TA0005)\n#### Impact (TA0040)\n#### Technique:\n#### T1071 - Application Layer Protocol (e.g., HTTP/S communication with malicious domains)\n#### T1105 - Ingress Tool Transfer (malicious file downloads)\n#### T1059 - Command and Scripting Interpreter (malicious script execution)\n#### T1036 - Masquerading (renamed binaries or scripts)\n### Query:\n```KQL\nlet IOC_Domains = dynamic([\"wearychallengeraise.com\", \"goclouder.com\", \"bundlehulu.com\", \"anallyticsnodde.com\",\"roundedbullets.com\", \"summerartcamp.net\", \"downloadessays.net\", \"joinushealth.com\", \"healthherofit.com\", \"worryfreetransport.com\", \"radiotimesignal.com\", \"fastfilebackup.com\", \"cyclingonlineshop.com\", \"luxuryfitnesslabs.com\", \"purvoyage.com\", \"93f4f4.bobbyweisman.com/kakfgar\", \n\"bobbyweisman.com\", \"bobbyweisman.com/index.html\", \"6f4922f4.bobbyweisman.com/brake\", \"tool.municipiodechepo.org/id\", \"tool.municipiodechepo.org\", \"OneStart.ai\", \"gridnodeessentials.com\", \"prisorta.com\",\n\"manage.kugglipkutanitola.website\",\n  \"robot.gsixk.com\",\n  \"service.ghostbuffer.com\",\n  \"www.webvps.name\",\n  \"www.webvps2.name\",\n  \"www.yutubuview.com\",\n  \"suv.ghostbuffer.com\",\n  \"info.ghostbuffer.com\",\n  \"yutubuview.com\",\n  \"micorsofts.net\",\n  \"bocstore.net\",\n  \"www.micrsofts.com\", \"ignifugacionsarguix.com\"\n ]);\nlet IOC_md5 = dynamic([\n  \"8a0822abd87620f1ffff1534b518f54b\",\n  \"7146dc9c01b91654640d940c38561966\",\n  \"58364f594684b88dc8cad52d0aa452db\",\n  \"237f686ad93a2907f6bc3d54ac432e44\",\n  \"76751a2c282915765dce7574706d23f3\",\n  \"d7648000cfdbe7f66f860df04fbb3bb0\",\n  \"fd0d852b6080f9278bccca71cafc4c36\",\n  \"184a38bd8791e029d818a60dfe82728e\",\n  \"e76d2a7de117f877d273f6d5aec82dd6\",\n  \"4592ed905a8b0866804055d8fca112ab\",\n  \"b122d6d27d79f8eebba70c8dbf521eab\",\n  \"cd07f72d0b7725445bf8a8b73169dbb0\",\n  \"5d888876a0e085fa962ac782c776cc8c\",\n  \"b9622171ab39e97d56815b0baffe6d98\",\n  \"1ae096772c5be43fbf3dbfcb783aa77d\",\n  \"665ce9fd6ad9df8da508725c1d6fe75e\",\n  \"12dfe40b7a370b0b962902d0b2627c93\",\n  \"0549eb3153b50c3f0a5ae7e0a5a38aed\",\n  \"ed443cb7e8da89a5dcc4c78da2350c5b\",\n  \"9f94f8c4d7445044279c91db599ccab1\",\n  \"161a99a1d73ea19a030aa47bac1003e0\",\n  \"16a643242223234b79f66034f4064534\",\n  \"e5502c7d2ea8a42106feb95c103e0e08\"\n]);\nlet IOC_SHA256 = dynamic([\"ddbce3dde4bd92f12c8df61ea4a8c5b2daed133af994f9228cffe006390a4bb0\",\n  \"f83271cf968f0bf6c084d75f09b4c40c94ac31f730b94685253870ad5366e8f4\",\n  \"7f55d5cabf2e29b33164e5b70f00cca2e96991a177be1686a8aa6a3871f54d92\",\n  \"3840c5983afbd28b6035a96f451793be264a001948205ef41d3d0b4778058690\",\n  \"3fc7a941b12a7f6408f1a93aa5bb5ef31e0bc148174d4fd99752d630974ccd9f\",\n  \"c00dd87c3829b92146cfa594a49970065d2984d8499f04cf9d3d0433f7282bc5\",\n  \"58e253f99eb42b408926b161f9995e9f171edc31736298be019df8bc54daa0f3\",\n  \"32f38cec311f7e9d0500daee31ecee1fb4731f0cb5a071f6a41521ac8b3d448c\",\n  \"7f0544a5bd5990caf79896e2890d4e035d026b6be8ed7a32e263be34f0b842e2\",\n  \"5b6a092a3b87097ec1b812632d8896b039a21eb4d05fa53abb21716fa6871bea\",\n  \"69f37c68d714384b8b2e4e84583a8f0dc819f98877bd911f1ecda3fb8bedec3a\",\n  \"e3da9577db59cf92f3d1ffcb2826fe63e5022efe95951fbca0c7ad6185b51c60\",\n  \"3b4c756d1542ed59fb53e200a248422fab11d52b4ff2bbdeb0c907014df3e866\",\n  \"c47dcfe3ff29ff8ee4c4f65f98dc0039c78c659aa3f0f03bcce1413fd870a821\",\n  \"e94fdcf6383465a178c303eee95d1399e94a85213f3d27fd7cd7157f4a96752a\",\n  \"d7e40c5f824c88234bfbc400fb956d7ca6ecab1655ad5cacd6f5a5c4d85e58ee\",\n  \"54858a9aa1735efbae3e165369c108bb7279def34514626b2530014e3bd353a9\",\n  \"7ac8b655e682119ee652e95fe562db855b343d4ee0c5d47032dfa9fcca018d02\",\n  \"727e43966a5345fa5975660e6e9e1c000d450dc2c5c9ef125506125580a127e0\",\n  \"f02a39bbd3f72aa443d554a2880da8aa15685ce6949dfbe5e84dda98917167e8\",\n  \"95a6906b8f7c529f9280a458804f85c5257c57a0cddd190f8bea52ffe23fa644\",\n  \"92c5deef41e29457cb0d13ee955a48685dc01907eb96d310a40490b4c804ef05\",\n  \"2a45fbaa45883f8df1d022d0f8ac4a81f0deeb7708d609dd24333aa633a22b50\"\n]);\nlet IOC_IP = dynamic([\"3.161.213.45\", \"3.161.213.48\", \"3.161.213.28\", \"3.161.213.120\", \n\"45.32.59.24\",\n\"91.193.103.136\",\n\"139.180.144.254\",\n  \"139.180.199.98\",\n  \"202.182.96.114\",\n  \"207.148.110.33\",\n  \"45.32.54.173\",\n  \"45.76.98.74\",\n  \"45.77.46.125\",\n  \"139.180.144.254\",\n  \"158.247.198.67\",\n  \"185.243.42.103\",\n  \"202.182.96.114\", \n\"89.44.193.109\",\n  \"89.44.193.12\",\n  \"89.44.193.95\",\n  \"180.178.39.26\",\n  \"180.178.39.26\",\n  \"59.188.133.112\",\n  \"59.188.133.112\",\n  \"64.44.206.10\"\n ]);\nlet FirewallLogs = CommonSecurityLog\n| where DeviceVendor == \"Fortinet\"\n| where DestinationHostName has_any (IOC_Domains)\n| where DestinationIP has_any (IOC_IP);\nlet DeviceNetworklogs = DeviceNetworkEvents\n| where RemoteUrl has_any (IOC_Domains)  \n| where RemoteIP  has_any (IOC_IP)\n| where ActionType == \"ConnectionSuccess\";\nlet DeviceEvents = DeviceEvents\n| where SHA256 has_any (IOC_SHA256)\n| where MD5 has_any (IOC_md5);\nlet Devicefile = DeviceFileEvents\n| where SHA256 has_any (IOC_SHA256)\n| where MD5 has_any (IOC_md5);\nlet Deviceprocess = DeviceProcessEvents\n| where SHA256 has_any (IOC_SHA256)\n| where MD5 has_any (IOC_md5);\nFirewallLogs\n| union DeviceNetworklogs, DeviceEvents, Devicefile, Deviceprocess\n| sort by TimeGenerated desc \n```\n"
query_type: kql
tactics:
    - TA0011
    - TA0002
techniques:
    - T1071
    - T1105
tags:
    - kql
version: "1"
