id: 1abc401c-94fd-4763-b2cb-bd7e64a5bb8c
name: Suspicious  colorcpl.exe usage
description: Guildma malware (also known as Astaroth), has been observed abusing the legitimate Windows colorcpl.exe tool in a cunning way. According to SANS ISC, the malware first uses colorcpl.exe to silently copy bitsadmin.exe into the writable C:\Windows\System32\spool\drivers\color\ directory, avoiding the typical copy command that security tools might detect. Once relocated, Guildma executes this copy of bitsadmin.exe from the less-scrutinized path to download additional payloads, effectively sidestepping traditional detection mechanisms that monitor only the original binary location.
query: "DeviceProcessEvents\r\n| where FileName =~ \"colorcpl.exe\"\r\n| where ProcessCommandLine has \"bitsadmin.exe\""
query_type: kql
severity: medium
techniques:
    - T1036.005
tags:
    - kql
author: Vaasudev Kala
version: "1"
references:
    - https://isc.sans.edu/diary/29814
