id: 1c31baaf-2915-4206-9ba9-da7114de1e31
name: Blob URIs creation trend analysis
description: 'KQL Query from file: Blob URIs creation trend analysis'
query: |
    // https://hackread.com/phishing-attack-blob-uri-fake-login-pages-browser/

    // Switch to Chart Mode to visualize

    DeviceFileEvents
    | where TimeGenerated > ago(90d)
    | where FileOriginUrl startswith "blob:https://"
    | summarize Count=count() by bin(TimeGenerated,1d)
query_type: kql
tactics:
    - TA0001
    - TA0043
techniques:
    - T1566
    - T1598
    - T1566.002
tags:
    - kql
version: "1"
