id: 1e7929dc-6259-44d8-ae33-81fdfa9ed8f3
name: Detect threat actor abuse CloudFlare tunnels to deliver RATS
description: KQL Query
query: |
    // Detect threat actor abuse CloudFlare tunnels to deliver RATS
    // https://www.linkedin.com/posts/activity-7225744862875152384-whO8/

    UrlClickEvents
    | where Timestamp > ago(30d)
    | extend domain = tostring(parse_url(Url).Host)
    | where domain endswith ".trycloudflare.com"
    | join EmailEvents on NetworkMessageId
    | project Timestamp, Url, RecipientEmailAddress, SenderMailFromAddress, SenderFromAddress, Subject, AttachmentCount, UrlCount

    // MITRE ATT&CK Mapping

    // Based on the KQL code, the following MITRE ATT&CK techniques are relevant:

    // T1071.001 - Application Layer Protocol: Web Protocols:
    // The query is analyzing URL click events, which involves web protocols.
    // T1566.002 - Phishing: Spearphishing Link:
    // The query filters for specific domains and joins with email events, indicating an investigation into potential phishing attempts via malicious links.
    // T1071.003 - Application Layer Protocol: Email Protocols:
    // The join with EmailEvents suggests the use of email protocols to identify malicious activities.
    // T1204.001 - User Execution: Malicious Link:
    // The focus on URL clicks and specific domains indicates detection of user execution of potentially malicious links.
query_type: kql
tactics:
    - TA0011
    - TA0001
    - TA0002
    - TA0042
    - TA0043
techniques:
    - T1071.001
    - T1566.002
    - T1071.003
    - T1204.001
    - T1583.007
    - T1566
    - T1598
tags:
    - kql
version: "1"
