id: 1fb925e9-333a-4dcc-a51f-aac4b4352e13
name: "\U0001F577️The Hunt for Spidy Phishing Domains \U0001F3A3"
description: "KQL Query from file: \U0001F577️The Hunt for Spidy Phishing Domains \U0001F3A3"
query: "let Whitelist = dynamic([\"microsoftazuread-sso.com\"]);\r\nlet SpidyDomains = dynamic([\"-sso.com\",\"-servicedesk.com\",\"-okta.com\",\"-vpn.com\",\"-help.com\",\"-helpdesk.com\",\"-corp.com\",\"-internal.com\",\"-servicenow.com\"]);\r\nlet EmailUrl = EmailUrlInfo | where UrlDomain has_any(SpidyDomains) and not (UrlDomain has_any(Whitelist));\r\nlet TeamsUrl = MessageUrlInfo | where UrlDomain has_any(SpidyDomains) and not (UrlDomain has_any(Whitelist));\r\nlet MDOUrl = UrlClickEvents | where UrlChain has_any (SpidyDomains) and not (UrlChain has_any (Whitelist));\r\nlet MDEUrl = DeviceNetworkEvents | where RemoteUrl has_any(SpidyDomains) and not (RemoteUrl has_any(Whitelist));\r\nunion EmailUrl, TeamsUrl, MDOUrl, MDEUrl "
query_type: kql
severity: medium
tags:
    - kql
author: Steven Lim
version: "1"
references:
    - https://blog.checkpoint.com/research/exposing-scattered-spider-new-indicators-highlight-growing-threat-to-enterprises-and-aviation/
