id: 206f4579-b94f-4ace-a661-939518a62403
name: Cloudflared Tunnel Execution
description: Detects the execution of a Cloudflared that uses 'tunnel run' with a long token, which is indicative of a tunneling tool being used. This pattern is often associated with legitimate remote access tools or potentially malicious C2 frameworks.
query: "DeviceProcessEvents\r\n| where ProcessCommandLine matches regex @\"[\\w\\-]+\\.exe\\ tunnel\\ run\\ \\-\\-token\\ \\w{184}\""
query_type: kql
severity: medium
tactics:
    - TA0011
techniques:
    - T1572
tags:
    - kql
version: "1"
