id: 2110563d-9bd8-4def-a220-9021b5529570
name: Malicious Hidden PowerShell Commands Execution detection
description: KQL Query
query: "let MaliciousCommand=dynamic([\"-W Hidden\",\"-w h -nop -ep un -E\",\"-w 1 -c\",\"-w h\"]);\r\nunion DeviceEvents,DeviceFileEvents\r\n| where  (InitiatingProcessCommandLine has_any (MaliciousCommand) or (ProcessCommandLine has_any (MaliciousCommand)))\r\n| distinct\r\n    TimeGenerated,\r\n    ActionType,\r\n    DeviceName,\r\n    InitiatingProcessAccountName,\r\n    InitiatingProcessFileName,\r\n    ProcessCommandLine,\r\n    InitiatingProcessCommandLine,\r\n    InitiatingProcessParentFileName,\r\n    Type\r\n| order by TimeGenerated desc"
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0001
    - TA0009
techniques:
    - T1059.001
    - T1204.004
    - T1059
    - T1566
    - T1115
    - T1086
tags:
    - kql
version: "1"
