id: 221c9c28-3faf-4728-adbe-d0ab4fd36b10
name: AWS NoSuchBucket Check
description: 'KQL Query from file: AWS NoSuchBucket Check'
query: |
    // AWS NoSuchBucket Check

    // https://labs.watchtowr.com/8-million-requests-later-we-made-the-solarwinds-supply-chain-attack-look-amateur/

    AWSCloudTrail
    | where TimeGenerated > ago(90d)
    | where ErrorCode == "NoSuchBucketPolicy"
    | extend BucketName = tostring(parse_json(RequestParameters).bucketName)
    | extend Host = tostring(parse_json(RequestParameters).Host)
    | project TimeGenerated, BucketName, Host
query_type: kql
tactics:
    - TA0005
    - TA0040
    - TA0007
    - TA0008
techniques:
    - T1562.008
    - T1485.001
    - T1526
    - T1097
    - T1550.003
tags:
    - kql
version: "1"
