id: 23af9470-5962-45ff-ba90-413113f963c4
name: MDE Brute Force Attack Detection
description: (no description)
query: "DeviceEvents\r\n| where Timestamp > ago(1h)\r\n| where ActionType == \"BruteForceActivityDetected\"\r\n| extend AttackCredential = tostring(AdditionalFields.Username)\r\n| extend AttackIP = tostring(AdditionalFields.IP)\r\n| summarize AttackCount=count(), HostBeingAttack=dcount(DeviceName) by AttackIP\r\n| sort by AttackCount desc "
query_type: kql
severity: medium
tags:
    - kql
author: Steven Lim
version: "1"
