id: 23efd075-f462-434a-aa58-daa6dc8f9dd8
name: Detecting Teams Red Team Tool ConvoC2
description: 'KQL Query from file: Detecting Teams Red Team Tool ConvoC2'
query: |
    // Detecting Teams Red Team Tool ConvoC2

    // https://cybersecuritynews.com/red-team-tool-to-executes-commands-via-ms-teams/amp/

    // DefendXDR Detection

    CloudAppEvents
    | where Timestamp > ago(1h)
    | where Application == @"Microsoft Teams"
    | where ActionType == @"AppInstalled"
    | where parse_json(RawEventData)["AddOnName"] == 'Workflows'
query_type: kql
tactics:
    - TA0011
    - TA0009
techniques:
    - T1568
    - T1114
    - T1102
tags:
    - kql
version: "1"
