id: 23f07e6f-bcba-4e31-9c71-c79582ec29e8
name: Malicious Email Attachment Downloaded to Endpoint
description: This rule detects when an email with a detected threat (e.g., malware, phishing) has an attachment that is subsequently observed on an endpoint device. This indicates that a malicious attachment from an email was downloaded and executed or saved on a device.
query: "EmailEvents\r\n| where ThreatNames != \"\"\r\n| join EmailAttachmentInfo on NetworkMessageId\r\n| where SHA256 != \"\"\r\n| join DeviceFileEvents on SHA256"
query_type: kql
severity: medium
tactics:
    - TA0001
techniques:
    - T1566
tags:
    - kql
version: "1"
