id: 24c57cd1-4ebb-4162-8636-5251173f1d81
name: 'Threat Hunt: Suspicious LSASS Access & Credential Dumping'
description: |-
    Detects instances where sensitive process lsass.exe is accessed by potentially malicious or abused utilities like powershell.exe, cmd.exe, rundll32.exe, or wmic.exe, which may indicate credential dumping or reconnaissance activity.
    It also captures admin tools commonly abused for credential dumping, including memory dump indicators via DLLs like comsvcs.dll.
query: "DeviceProcessEvents\r\n| where FileName =~ \"lsass.exe\"\r\n| where InitiatingProcessFileName in~ (\"powershell.exe\", \"cmd.exe\", \"rundll32.exe\", \"wmic.exe\", \"procdump.exe\", \"taskmgr.exe\", \"comsvcs.exe\")\r\n| project Timestamp, DeviceName, InitiatingProcessAccountName, FileName, InitiatingProcessFileName, ProcessCommandLine\r\n"
query_type: kql
severity: medium
techniques:
    - T1003.001
tags:
    - kql
author: AwaisM
version: "1"
