id: 26fd46c7-670c-467f-b152-df1e4b6cf588
name: wsf file executed by cscript.exe
description: |-
    This package searches endpoint processes for cscript executing a wsf file which has been attributed to the Serpentine#Cloud campaign.
    This is a brittle detection narrowly defined to this particular campaign but is nonetheless useful.
query: "DeviceProcessEvents\r\n| where FileName has_any (\"cmd.exe\", \"powershell.exe\")\r\n| where ProcessCommandLine has_all (\"cscript\", \"wsf\")\r\n| project Timestamp, AccountName, DeviceName, FileName,InitiatingProcessCommandLine, ProcessCommandLine"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1220
    - T1059
tags:
    - serpentine#cloud
    - cscript
    - kql
author: Salten Fisk
version: "1"
references:
    - https://www.securonix.com/blog/analyzing_serpentinecloud-threat-actors-abuse-cloudflare-tunnels-threat-research/
