id: 2722ca5b-85c4-4a58-b677-59d18bf46926
name: 'Fix the Click: Preventing the ClickFix Attack Vector'
description: Detect Registry Addition to RunMRU Key - Detect creation or modification of values under the RunMRU key, which stores the history of executed commands via the Run dialog (Win + R). Attackers may use this to track user actions or store malicious command history for reuse.
query: "DeviceRegistryEvents\r\n| where RegistryKey endswith @\"\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\RunMRU\"\r\n| where ActionType in (\"RegistryValueSet\", \"RegistryKeyCreated\")\r\n| project Timestamp, DeviceName, InitiatingProcessFileName, InitiatingProcessCommandLine, RegistryKey, RegistryValueName, RegistryValueData, ReportId\r\n"
query_type: kql
severity: medium
tactics:
    - TA0003
tags:
    - kql
version: "1"
references:
    - https://unit42.paloaltonetworks.com/preventing-clickfix-attack-vector/
