id: 275ce58f-54ef-4134-b7dc-d702e959d0a2
name: '[IC] - Detect unusual/suspicious TTL values based on DNS Answers'
description: |-
    Time to live (TTL) values in DNS responses provide valuable threat-hunting insights, including:

    - Fast-flux botnets (rotating IPs with low TTLs).
    - Malware C2 detection (extremely low TTLs). ( | where TTLs < 10 )
    - DNS tunneling (high TTLs or changing TTLs). ( | where TTLs > 86400 )
    - Fake domains mimicking real services (TTL anomalies).
    - Evasive infrastructure constantly changing TTL values.

    You can use the following KQL Query to search for the mentioned cases.
query: " DeviceNetworkEvents\n| extend TTLs = todynamic(tostring(parse_json(AdditionalFields).TTLs))\n| mv-expand TTLs\n| extend answers = todynamic(tostring(parse_json(AdditionalFields).answers))\n| extend answersext = todynamic(tostring(parse_json(AdditionalFields).answers))\n| extend query = (tostring(parse_json(AdditionalFields).query))\n| mv-expand answers\n| extend Type =\n    case(\n        answers matches regex @\"^(\\d{1,3}\\.){3}\\d{1,3}$\", \"IPv4\",  \n        answers matches regex @\"^([a-fA-F0-9:]+)$\", \"IPv6\",        \n        answers contains \".\", \"URL\",                               \n        \"Unknown\"                                                 \n    )\n| where Type has \"IPv4\"\n| extend tostring(answers)\n| extend Geo_info_answer = tostring(geo_info_from_ip_address(answers).country)\n| extend Geo_info_RemoteIP = tostring(geo_info_from_ip_address(RemoteIP).country)\n| where TTLs > 86400\n| project   DeviceName, RemoteIP,answers,Geo_info_RemoteIP, Geo_info_answer, TTLs"
query_type: kql
severity: medium
tactics:
    - TA0011
techniques:
    - T1572
tags:
    - KQL
    - Sergio_Albea
    - kql
author: Sergio Albea
version: "1"
