id: 29a69fea-9bb4-4892-ae4d-a24fca8aa1bd
name: Tracking Proton66 Activity with KQL
description: 'KQL Query from file: Tracking Proton66 Activity with KQL'
query: |+
    // https://thehackernews.com/2025/04/hackers-abuse-russian-bulletproof-host.html

    DeviceNetworkEvents
    | where TimeGenerated > ago(90d)
    | where ipv4_is_in_any_range(RemoteIP, '45.135.232.0/24', '91.212.166.0/24', '193.143.1.0/24', '45.140.17.0/24', '45.134.26.0/24')
    | where ActionType has "ConnectionSuccess" or ActionType has "InboundConnectionAccepted"
    | summarize NoOfHits=count() by DeviceName, ActionType, RemoteIP
    | sort by NoOfHits desc

query_type: kql
tactics:
    - TA0011
    - TA0009
    - TA0006
    - TA0003
    - TA0004
techniques:
    - T1071.001
    - T1071.004
    - T1071.002
    - T1056.004
    - T1558.004
    - T1179
    - T1125
    - T1206
tags:
    - kql
version: "1"
