id: 2b3d7db5-4915-470e-9ea4-4a960ed5100a
name: SharePoint vulnerability CVE-2025-53770 - Successful exploitation via file creation
description: https://msrc.microsoft.com/blog/2025/07/customer-guidance-for-sharepoint-vulnerability-cve-2025-53770/
query: "DeviceFileEvents\r\n| where FolderPath has \"MICROS~1\\\\WEBSER~1\\\\16\\\\TEMPLATE\\\\LAYOUTS\"\r\n| where FileName =~ \"spinstall0.aspx\"\r\nor FileName has \"spinstall0\"\r\n| project Timestamp, DeviceName, InitiatingProcessFileName, InitiatingProcessCommandLine, FileName, FolderPath, ReportId, ActionType, SHA256\r\n| order by Timestamp desc"
query_type: kql
severity: medium
tags:
    - kql
author: Microsoft
version: "1"
