id: 2e0e9004-4011-4428-8300-81fbaab37e7e
name: ADFS DKM Property Read
description: This KQL query monitors a critical security event in Active Directory Federation Services (ADFS) environments - the reading of Distributed Key Management (DKM) properties.
query: |-
    IdentityDirectoryEvents
    | where ActionType == "ADFS DKM property read"
    | extend
        DeviceName = tostring(AdditionalFields["ACTOR.DEVICE"]),
        DeviceSid = tostring(AdditionalFields["SourceComputerSid"]),
        AdfsObjectId = tostring(AdditionalFields["AdfsObjectId"])
    | project-reorder TimeGenerated,Application,AccountName,AccountDomain,AccountUpn,AccountDisplayName,DeviceName,ActionType,AdfsObjectId,AccountSid,DeviceSid,AdditionalFields,ReportId
query_type: kql
severity: medium
tactics:
    - TA0006
techniques:
    - T1649
tags:
    - kql
version: "2"
