id: 2f878921-1692-45f8-9ec8-6233fa5ad3bd
name: Hunt Devices Supporting MDE Containment
description: This hunting query identifies devices enrolled in Microsoft Defender for Endpoint that support device containment. It determines support by analyzing the client version and estimating when that version became available. The query specifically looks at Windows devices and categorizes them based on their client version's support for containment (with or without AH Audit) or if containment is unsupported. Non-Windows devices are always classified as unsupported for containment.
query: "# *Hunt devices supporting MDE Containment*\n\n## Query Information\n\n#### MITRE ATT&CK Technique(s)\n\nN/A\n\n#### Description\nThis hunting query can help you finding which Defender for Endpoint enrolled devices support device containment. This is being done by looking at the client version and estimated time the version was available. \n\n#### Risk\nThe calculation to check if device containment is supported is done by checking the date of when an update is available. Microsoft documentation is not always clear about which versions contain which features, which makes this query an estimation query. More information can be found in below references.\n\n#### Author <Optional>\n- **Name:** Robbe Van den Daele\n- **Github:** https://github.com/RobbeVandenDaele\n- **Twitter:** https://x.com/RobbeVdDaele\n- **LinkedIn:** https://www.linkedin.com/in/robbe-van-den-daele-677986190/\n- **Website:** https://hybridbrothers.com/\n\n#### References\n- https://learn.microsoft.com/en-us/defender-endpoint/windows-whatsnew\n- https://hybridbrothers.com/device-isolation-and-containment-strategies/\n\n## Defender XDR\n```KQL\n// Paste your query here\n// Gets the onboarded windows devices and checks containment support nuances\nlet onboardedWindows = DeviceInfo\n| where OnboardingStatus == \"Onboarded\" and OSPlatform contains \"Windows\"\n| distinct DeviceId, DeviceName, ClientVersion, OSPlatform\n| parse ClientVersion with Major:int \".\" Minor:int \".\" Build:int \".\" Revision:int\n// Reference: https://learn.microsoft.com/en-us/defender-endpoint/windows-whatsnew\n| extend Date = case(\n    Minor >= 8760, \"July-2024\", \n    Minor >= 8750, \"May-2024\",\n    Minor >= 8735, \"Feb-2024\",\n    Minor >= 8672, \"Dec-2023\",\n    Minor >= 8560, \"Sept-2023\",\n    Minor > 8295, \"May-2023\",\n    Minor == 8295 and Revision >= 1023, \"May-2023\",\n    Minor == 8295 and Revision between (1019 .. 1023), \"Jan/Feb-2023\",\n    Minor > 8210, \"Dec-2022\", \n    Minor == 8210 and Build >= 22621 and Revision >= 1016, \"Dec-2022\", \n    Minor == 8210 and not(Build >= 22621 and Revision >= 1016), \"Aug-2022\", \n    \"< Aug-2022\"\n)\n// Containment without AH Audit supported from Nov-2022\n// Containment with AH Audit supported from Mar-2023\n| extend Containment = case(\n    Minor >= 8295, \"Supported with AH Audit\",\n    (Minor == 8210 and Build >= 22621 and Revision >= 1016) or Minor > 8210, \"Supported without AH Audit\",\n    \"Unsupported\"\n);\n// Gets onboarded non-windows devices, since containment is not supported here\nlet onboardedNonWindows = DeviceInfo\n| where OnboardingStatus == \"Onboarded\" and OSPlatform !contains \"Windows\"\n| distinct DeviceId, DeviceName, ClientVersion, OSPlatform\n| extend Containment = \"Unsupported\";\n// Get not-onboarded Servers\nlet notOnboardedServers = DeviceInfo\n| where OnboardingStatus != \"Onboarded\" and DeviceType == \"Server\"\n| distinct DeviceId, DeviceName, ClientVersion, OSPlatform\n| extend Containment = \"Unsupported\";\n// Union all and show diagram\nunion onboardedNonWindows, onboardedWindows, notOnboardedServers\n| summarize count() by Containment\n| render piechart \n```\n\n## Sentinel\n```KQL\nN/A\n```"
query_type: kql
tags:
    - kql
version: "1"
references:
    - https://learn.microsoft.com/en-us/defender-endpoint/windows-whatsnew
    - https://hybridbrothers.com/device-isolation-and-containment-strategies/
