id: 3193135e-977a-4bb4-bb0e-45d28159c38f
name: Detection of Malicious Browser Extensions and Associated Network Connections
description: This rule detects the presence of potentially malicious or unwanted browser extensions and outbound network connections to known adware or tracking domains. It correlates extension presence with network behavior to identify threats.
query: "## \U0001F50D KQL Description\n#### This query helps security analysts:\n#### 1.Identify devices with potentially malicious or unwanted browser extensions.\n#### 2.Detect outbound connections to known adware or tracking domains.\n#### 3.Correlate extension presence with network behavior for deeper threat hunting.\n## \U0001F9E9 MITRE ATT&CK Mapping\n#### Tactic:Persistence (TA0003), Command and Control (TA0011)\n#### Technique: Browser Extensions (T1176), Application Layer Protocol (T1071)\n### Query:\n```KQL\nlet ioc = dynamic([\"kgmeffmlnkfnjpgmdndccklfigfhajen\",\"Emoji keyboard online\",\n\"dpdibkjjgbaadnnjhkmmnenkmbnhpobj\", \"Free Weather Forecast\",\n\"gaiceihehajjahakcglkhmdbbdclbnlf\", \"Video Speed Controller \",\n\"mlgbkfnjdmaoldgagamcnommbbnhfnhf\", \"Unlock Discord\",\n\"eckokfcjbjbgjifpcbdmengnabecdakp\" ,\"Dark Theme\",\n\"mgbhdehiapbjamfgekfpebmhmnmcmemg\", \"Volume Max\",\n\"cbajickflblmpjodnjoldpiicfmecmif\", \"Unblock TikTok\",\n\"pdbfcnhlobhoahcamoefbfodpmklgmjm\"\n\"eokjikchkppnkdipbiggnmlkahcdkikp\", \"Color Picker\", \"Eyedropper\"\n\"ihbiedpeaicgipncdnnkikeehnjiddck\", \"Weather\",\n\"jjdajogomggcjifnjgkpghcijgkbcjdi\", \"Unlock TikTok\",\n\"mmcnmppeeghenglmidpmjkaiamcacmgm\", \"Volume Booster\",\n\"ojdkklpgpacpicaobnhankbalkkgaafp\", \"Web Sound Equalizer\",\n\"lodeighbngipjjedfelnboplhgediclp\", \"Header Value\",\n\"hkjagicdaogfgdifaklcgajmgefjllmd\", \"Flash Player\",\n\"gflkbgebojohihfnnplhbdakoipdbpdm\", \"Youtube Unblocked\",\n\"kpilmncnoafddjpnbhepaiilgkdcieaf\", \"SearchGPT\",\n\"caibdnkmpnjhjdfnomfhijhmebigcelo\", \"Unlock Discord\",\n\"admitab.com\",\n\"edmitab.com\",\n\"click.videocontrolls.com\",\n\"c.undiscord.com\",\n\"click.darktheme.net\",\n\"c.jermikro.com\",\n\"c.untwitter.com\",\n\"c.unyoutube.net\",\n\"admitclick.net\",\n\"addmitad.com\",\n\"abmitab.com\",\n\"admitlink.net\"]);\nlet BrowsersExtensions = DeviceTvmBrowserExtensions \n| where ExtensionId has_any (ioc) or ExtensionName has_any (ioc);\nlet Firewalllogs = CommonSecurityLog\n| where DestinationHostName has_any (ioc)\n| where DestinationHostName !contains \"weather\";\nBrowsersExtensions\n| union Firewalllogs\n| sort by TimeGenerated desc\n```\n"
query_type: kql
tactics:
    - TA0003
    - TA0011
techniques:
    - T1176
    - T1071
tags:
    - kql
version: "1"
