id: 31deecb1-41f9-4398-84b4-4b560307920e
name: Devices with End-Of-Support Software Detected
description: This rule identifies devices that have software installed which has reached its End-Of-Support (EOS) status. This is crucial for identifying potential security vulnerabilities due to unpatched software and for maintaining compliance with organizational security policies. The rule summarizes the count of such software instances per device, along with the software name and its End-Of-Support date.
query: "DeviceTvmSoftwareInventory\r\n| where EndOfSupportStatus == \"EOS Software\"\r\n| summarize count() by DeviceName, SoftwareName, EndOfSupportStatus, EndOfSupportDate"
query_type: kql
severity: medium
tactics:
    - TA0007
    - TA0043
techniques:
    - T1518
    - T1592.002
tags:
    - kql
version: "1"
