id: 327aa97b-52c5-470d-a783-b174f96850db
name: CVE-2024-29510 Ghostscript library RCE bug Exploited
description: KQL Query
query: |
    // CVE-2024-29510 Ghostscript library RCE bug Exploited
    // https://www.linkedin.com/posts/activity-7216125838516178945-R-rj/

    // Artifex Ghostscript before 10.03.1 allows memory corruption, and SAFER sandbox bypass, via format string injection with a uniprint device. Ghostscript comes pre-installed on many Linux distributions and is used by various document conversion software.

    // MDE KQL to check impacted Windows/Linux workstations:

    DeviceTvmSoftwareInventory
    | where SoftwareName contains "ghostscript" and SoftwareVersion != "10.03.1"

    // MITRE ATT&CK Mapping
    // This query aligns with the following MITRE ATT&CK techniques:

    // T1082 - System Information Discovery: Attackers may use this technique to gather information about the software installed on a system, which can include identifying outdated or vulnerable versions1.
    // T1518.001 - Software Discovery: This technique involves adversaries attempting to identify software installed on a system, which can help them understand the environment and identify potential targets2.
    // By identifying devices with outdated versions of “ghostscript,” this query helps in detecting potential vulnerabilities that adversaries might exploit.
query_type: kql
tactics:
    - TA0007
techniques:
    - T1082
    - T1518.001
tags:
    - kql
version: "1"
