id: 33d03624-c902-4fed-b8b3-feecd0035861
name: Multiple Unusual User Activities
description: This query is designed to detect a series of anomalous user behaviors that, when combined, may indicate a compromised account. It flags activity that is uncharacteristic for a specific user, such as performing an unusual action, using an unfamiliar application, connecting from an unexpected ISP or country, or logging in from a new device for the first time. The final filter | where InvestigationPriority > 5 focuses the results on high-priority alerts, which are more likely to be legitimate threats. This approach uses behavioral analytics to identify deviations from a user's normal baseline, making it effective for detecting both insider threats and external attacks that have breached credentials.
query: "BehaviorAnalytics\r\n| extend ActionUncommonlyPerformedbyUser = tostring(ActivityInsights.ActionUncommonlyPerformedByUser)\r\n| where ActionUncommonlyPerformedbyUser == \"True\"\r\n| extend ISPUncommonlyUsedByUser = tostring(ActivityInsights.ISPUncommonlyUsedByUser)\r\n| where ISPUncommonlyUsedByUser == \"True\"\r\n| extend CountryUncommonlyConnectedFromByUser = tostring(ActivityInsights.CountryUncommonlyConnectedFromByUser)\r\n| where CountryUncommonlyConnectedFromByUser == \"True\"\r\n| extend FirstTimeUserConnectedFromDevice = tostring(ActivityInsights.FirstTimeUserConnectedFromDevice)\r\n| where FirstTimeUserConnectedFromDevice == \"True\"\r\n| extend DeviceUncommonlyUsedAmongPeers = tostring(ActivityInsights.DeviceUncommonlyUsedAmongPeers)\r\n| where DeviceUncommonlyUsedAmongPeers == \"True\"\r\n| where InvestigationPriority > 5"
query_type: kql
severity: medium
tactics:
    - TA0001
    - TA0002
    - TA0003
techniques:
    - T1078.004
tags:
    - kql
author: Benjamin Zulliger
version: "1"
references:
    - https://learn.microsoft.com/en-us/azure/sentinel/ueba-reference?tabs=log-analytics
