id: 34b38d20-63b9-4df2-95cf-98d36c650d6e
name: BadSuccessor Detection
description: 'KQL Query from file: BadSuccessor Detection'
query: |
    // BadSuccessor Detection
    // Abusing dMSA to escalate privileges in Active Directory
    // https://www.akamai.com/blog/security-research/abusing-dmsa-for-privilege-escalation-in-active-directory

    let QueryPeriod = 1h;
    let dMSARegKey = dynamic(["DelegatedMSAEnabled"]);
    let dMSAMonitor =
    SecurityEvent
    | where TimeGenerated > ago(QueryPeriod)
    | where EventID == 307 or // dMSA Migration
    EventID == 308 or // dMSA Permission Add
    EventID == 309; // dMSA Key Fetch
    DeviceRegistryEvents
    | where TimeGenerated > ago(QueryPeriod)
    | where ActionType == @"RegistryKeyCreated" or ActionType  == @"RegistryValueSet"
    | where RegistryKey has_any(dMSARegKey)
    | union dMSAMonitor
query_type: kql
tactics:
    - TA0004
    - TA0001
    - TA0008
    - TA0005
    - TA0003
    - TA0006
techniques:
    - T1068
    - T1200
    - T1210
    - T1611
    - T1078.003
    - T1547.014
    - T1558.003
tags:
    - kql
version: "1"
