id: 34b8bc7a-c328-4088-af5b-6b70f22b95af
name: LOLBAS - Powershell - Suspicious Powershell Commands for AV Exclusion/Disablement
description: 'Detection Looks for powershell been used to disable AV/Defender within a system or evade detection through excluding drives/files. Actors will use this to bypass defenses or set up file exclusions to allow their custom files/binaries to execute. '
query: "DeviceProcessEvents\r\n| where FileName =~ \"powershell.exe\"\r\n| where ProcessCommandLine has_all (\"Set-MpPreference\")\r\n| where ProcessCommandLine has_any (\"exclusionprocess\", \"DisableRealtimeMonitoring\", \r\n\"Disableioavprotection\", \"disablebehaviormonitoring\", \"disableintrusionpreventionsystem\",\r\n\"disablescriptscanning\")\r\n"
query_type: kql
severity: medium
tactics:
    - TA0005
    - TA0002
techniques:
    - T1562
    - T1562.001
    - T1086
tags:
    - kql
author: 'Xavier '
version: "3"
references:
    - https://redcanary.com/threat-detection-report/techniques/disable-or-modify-tools/
