id: 36fa4d08-0b6f-4c96-a2d9-b5a1b2c1c9bd
name: RID Hijacking Technique and Detection
description: 'KQL Query from file: RID Hijacking Technique and Detection'
query: |+
    // RID Hijacking Technique and Detection

    // https://asec.ahnlab.com/en/85942/

    let EPwithNewLocalAccount =
    DeviceEvents
    | where Timestamp > ago(1h)
    | where ActionType == "UserAccountCreated" and AccountName has "$"
    | distinct DeviceName;
    DeviceRegistryEvents
    | where RegistryKey has "HKEY_LOCAL_MACHINE\\SAM\\SAM\\Domains\\Account\\Users"
    | where DeviceName has_any(EPwithNewLocalAccount)

query_type: kql
tags:
    - kql
version: "1"
