id: 386854bc-5c31-4750-8e7f-ecdd6605fb4f
name: AgentTesla Scheduled Task Creation from AppData Temp
description: This detects looks for the creation of scheduled tasks where the task content explicitly references a temporary file within the user's AppData\Local\Temp directory. This activity has been observed by AgentTesla as persistence mechanisms attempting to execute from a temporary location.
query: "DeviceEvents\r\n| where ActionType contains @\"ScheduledTaskCreated\"\r\n| extend Parsed_AdditionFields = parse_json(AdditionalFields)\r\n| extend TaskContent = Parsed_AdditionFields.TaskContent\r\n| where TaskContent has_all (@\"\\AppData\\Local\\Temp\\\", \".tmp\")\r\n"
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0003
    - TA0004
techniques:
    - T1053.005
    - T1053
tags:
    - kql
author: AgentTesla
version: "1"
references:
    - https://infosecwriteups.com/%EF%B8%8F-%EF%B8%8F-tracking-agenttesla-real-world-malware-behavior-analysis-using-joe-sandbox-60c8b923e651
    - https://app.any.run/tasks/35136a1e-659f-4b25-93f8-3f3edc1aa772
