id: 38732ad5-8b4e-4a5e-bdf3-43518d0d0ef9
name: Microsoft Teams Impersonation Detected
description: This rule detects an impersonation event within Microsoft Teams, specifically when the 'TeamsImpersonationDetected' action type is logged. It extracts the User ID and the Sender's User Principal Name (UPN) associated with the detected impersonation.
query: "CloudAppEvents\r\n| where Application == @\"Microsoft Teams\"\r\n| where ActionType == @\"TeamsImpersonationDetected\"\r\n| extend UserId = parse_json(RawEventData)[\"UserId\"]\r\n| extend SenderUPN = parse_json(RawEventData)[\"Sender\"][\"UPN\"]\r\n| project Timestamp, Application, ActionType, UserId, SenderUPN"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1656
tags:
    - kql
version: "1"
