id: 3893bc09-7beb-4610-a21a-61444ed8f5ea
name: Discord Invite Hijacking Detection
description: 'KQL Query from file: Discord Invite Hijacking Detection'
query: |
    // Discord Invite Hijacking Detection
    // https://darkatlas.io/blog/discord-invite-hijacking-how-fake-links-are-delivering-infostealers

    let QueryPeriod = 1h;
    let MonitorURLs = dynamic(["discord.com","discord.gg"]);
    let DiscordAccess =
    DeviceNetworkEvents
    | where Timestamp > ago(QueryPeriod)
    | where isnotempty(RemoteUrl)
    | where ActionType == @"ConnectionSuccess"
    | where RemoteUrl has_any (MonitorURLs)
    | distinct DeviceName;
    DeviceNetworkEvents
    | where Timestamp > ago(QueryPeriod)
    | where isnotempty(RemoteUrl)
    | where ActionType == @"ConnectionSuccess"
    | where DeviceName has_any(DiscordAccess) and RemoteUrl =~ "captchaguard.me"
query_type: kql
tactics:
    - TA0001
    - TA0043
techniques:
    - T1566
    - T1566.002
    - T1589.001
tags:
    - kql
version: "1"
