id: 3ac9174d-d046-410f-b420-73383413abdf
name: 'Image File Execution Options (IFEO) Injection '
description: |-
    Detects suspicious registry modifications for IFEO entries which can be used by attackers for persistence.

    This is based off of testing with Atomic Red Team tests - https://www.atomicredteam.io/atomic-red-team/atomics/T1546.012
query: "DeviceRegistryEvents\r\n| where RegistryKey startswith @\"HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\"\r\n    or RegistryKey startswith @\"HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SilentProcessExit\"\r\n| where RegistryValueName in~ (\"Debugger\", \"GlobalFlag\", \"ReportingMode\", \"MonitorProcess\")"
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0003
    - TA0005
techniques:
    - T1546.012
    - DS0007
    - T1622
tags:
    - kql
version: "1"
references:
    - https://www.atomicredteam.io/atomic-red-team/atomics/T1546.012
