id: 3ad0f5a7-3fa8-4be8-b249-3903fc90c987
name: Detect Suspicious ncrypt.dll usage on admin device with RDP connections to non TPM protected device
description: This detection rule uses a WDAC audit policy to ingest missing DeviceImageLoad events in MDE, and check for suspicious processes using the ncrypt.dll and admin devices performing RDP connection to unmanaged or non-TPM devices. More information on the attack scenario this is detection is applicable for can be found in the references.
query: "let time_lookback = 30d;\nlet admin_users = toscalar(\n    IdentityInfo\n    | where Timestamp > ago(7d)\n    | where CriticalityLevel != \"\" or AccountDisplayName contains \"Admin\"\n    | summarize make_set(AccountDisplayName)\n);\nlet devices_with_admin_accounts = (\n    ExposureGraphEdges\n    // Get edges where source is a device and destination is a admin user\n    | where SourceNodeLabel == \"device\" and TargetNodeLabel == \"user\"\n    | where TargetNodeName in (admin_users)\n    // Check which devices have the credentials of the admin user\n    | make-graph SourceNodeId --> TargetNodeId with ExposureGraphNodes on NodeId\n    | graph-match (SourceNode)-[hasCredentialsOf]->(TargetNode)\n        project IncomingNodeName = SourceNode.NodeName, OutgoingNodeName = TargetNode.NodeName, CriticalityLevel = TargetNode.NodeProperties.rawData.criticalityLevel.criticalityLevel, CriticalityRuleNames = TargetNode.NodeProperties.rawData.criticalityLevel.ruleNames\n    | summarize make_set(IncomingNodeName)\n);\nlet no_tpm_devices = (\n    ExposureGraphNodes\n    // Get device nodes with their inventory ID\n    | where NodeLabel == \"device\"\n    | mv-expand EntityIds\n    | where EntityIds.type == \"DeviceInventoryId\"\n    // Get interesting properties\n    | extend OnboardingStatus = tostring(parse_json(NodeProperties)[\"rawData\"][\"onboardingStatus\"]),\n        TpmSupported = tostring(parse_json(NodeProperties)[\"rawData\"][\"tpmData\"][\"supported\"]),\n        TpmEnabled = tostring(parse_json(NodeProperties)[\"rawData\"][\"tpmData\"][\"enabled\"]),\n        TpmActivated = tostring(parse_json(NodeProperties)[\"rawData\"][\"tpmData\"][\"activated\"]),\n        DeviceName = tostring(parse_json(NodeProperties)[\"rawData\"][\"deviceName\"]),\n        DeviceId = tostring(EntityIds.id)\n    // Search for distinct devices\n    | distinct DeviceId, DeviceName, OnboardingStatus, TpmSupported, TpmEnabled, TpmActivated\n    // Get Unmanaged devices and device not supporting a TPM\n    | where OnboardingStatus != \"Onboarded\" or (TpmSupported != \"true\" and TpmActivated != \"true\" and TpmEnabled != \"true\")\n    | extend TpmSupported = iff(TpmSupported == \"\", \"unknown\", TpmSupported),\n        TpmActivated = iff(TpmActivated == \"\", \"unknown\", TpmActivated),\n        TpmEnabled = iff(TpmEnabled == \"\", \"unknown\", TpmEnabled)\n);\nlet no_tpm_device_info = (\n    DeviceNetworkInfo\n    | where Timestamp > ago(7d)\n    // Get latest network info for each device ID\n    | summarize arg_max(Timestamp, *) by DeviceId\n    | mv-expand todynamic(IPAddresses)\n    | extend IPAddress = tostring(IPAddresses.IPAddress)\n    // Find no TPM devices and join with their network information\n    | join kind=inner no_tpm_devices on DeviceId\n    | project DeviceId, DeviceName, MacAddress, IPAddress, OnboardingStatus, TpmActivated, TpmEnabled, TpmSupported\n);\nlet dangerous_rdp_sessions = (\n    DeviceNetworkEvents\n    | where Timestamp > ago(time_lookback)\n    // Only flag admin devices\n    | where DeviceName in (devices_with_admin_accounts)\n    // Exclude MDI RDP Connections (known for NNR)\n    | where InitiatingProcessFileName !~ \"microsoft.tri.sensor.exe\"\n    // Search for RDP connections to non-tpm devices\n    | where ActionType == \"ConnectionSuccess\"\n    | where RemotePort == 3389\n    | join kind=inner no_tpm_device_info on $left.RemoteIP == $right.IPAddress\n    | project-rename RemoteDeviceId = DeviceId1, \n        RdpRemoteDeviceName = DeviceName1, \n        RdpRemoteMacAddress = MacAddress, \n        RdpRemoteDeviceOnboardingStatus = OnboardingStatus, \n        RdpRemoteDeviceTpmActivated = TpmActivated, \n        RdpRemoteDeviceTpmEnabled = TpmEnabled, \n        RdpRemoteDeviceTpmSupported = TpmSupported,\n        RdpTimeGenerated = Timestamp,\n        RdpInitiatingProcessFileName = InitiatingProcessFileName\n    | project-away IPAddress\n);\n// Get all possible nonce requests\nlet nonce_requests = (\n    DeviceNetworkEvents\n    | where Timestamp > ago(time_lookback)\n    | where ActionType == \"ConnectionSuccess\"\n    | where RemoteUrl =~ \"login.microsoftonline.com\"\n    | project-rename NonceRequestTimestamp = Timestamp\n);\n// Get suspicious ncrypt.dll usage via WDAC audit policy\nDeviceEvents\n| where Timestamp > ago(time_lookback)\n// Only flag admin devices\n| where DeviceName in (devices_with_admin_accounts)\n| where ActionType startswith \"AppControl\" and FileName =~ \"ncrypt.dll\"\n// Check if the same initiating process is doing a nonce request\n| join kind=inner nonce_requests on InitiatingProcessId, DeviceId\n// Only flag when nonce was request 10min before of after ncrypt usage\n| where Timestamp between (todatetime(NonceRequestTimestamp - 10m) .. todatetime(NonceRequestTimestamp + 10m))\n// Check if the same device is doing RDP Connections\n| join kind=inner dangerous_rdp_sessions on DeviceId\n// Whitelist known good processes\n| where InitiatingProcessFileName !in (\"backgroundtaskhost.exe\",\"svchost.exe\")\n// Project interesting columns\n| extend WdacPolicyName = parse_json(AdditionalFields)[\"PolicyName\"]\n| project Timestamp, DeviceName, ActionType, FileName, InitiatingProcessSHA1, InitiatingProcessFileName, \n    InitiatingProcessId, InitiatingProcessAccountName, InitiatingProcessParentFileName, WdacPolicyName, InitiatingProcessRemoteSessionDeviceName, InitiatingProcessRemoteSessionIP,\n    NonceRequestTimestamp, RdpTimeGenerated, RdpInitiatingProcessFileName, RdpRemoteDeviceName, RdpRemoteMacAddress, RdpRemoteDeviceOnboardingStatus,\n    RdpRemoteDeviceTpmActivated, RdpRemoteDeviceTpmEnabled, RdpRemoteDeviceTpmSupported"
query_type: kql
severity: medium
version: "1"
