id: 4043c723-0ec4-4442-9062-b896b78969a3
name: Detection of Hardcoded Secrets in Chrome Extensions
description: 'Researchers have identified a recurring issue where API keys, secrets, and authentication tokens are hardcoded within the JavaScript code of popular Chrome extensions. These exposed credentials are easily retrievable by inspecting the extension package, enabling threat actors to abuse associated services. '
query: "DeviceFileEvents\r\n| where ActionType == \"FileCreated\" and FileName endswith \".crx\"\r\n| where FileName has_any(\r\n\"gomekmidlodglbbmalcneegieacbdmki\",\r\n\"nbmoafcmbajniiapeidgficgifbfmjfo\",\r\n\"hjngolefdpdnooamgdldlkjgmdcmcjnc\",\r\n\"nlipoenfbbikpbjkfpfillcgkoblgpmj\",\r\n\"mfpiaehgjbbfednooihadalhehabhcjo\",\r\n\"gpaiobkfhnonedkhhfjpmhdalgeoebfa\",\r\n\"lmbopdiikkamfphhgcckcjhojnokgfeo\",\r\n\"cimpffimgeipdhnhjohpbehjkcdpjolg\",\r\n\"egjidjbpglichdcondbcbdnbeeppgdph\",\r\n\"llaficoajjainaijghjlofdfmbjpebpa\",\r\n\"lnbmbgocenenhhhdojdielgnmeflbnfb\",\r\n\"coplmfnphahpcknbchcehdikbdieognn\")\r\n"
query_type: kql
severity: medium
tactics:
    - TA0003
techniques:
    - T1176.001
tags:
    - kql
author: Kyaw Pyiyt Htet
version: "1"
references:
    - https://www.security.com/threat-intelligence/chrome-extension-credentials
