id: 40e56d0e-a757-415c-a94e-bacf7bccbd6c
name: Antivirus Scan Failure Detected
description: This rule detects instances where an antivirus scan fails on a device. It extracts the scan type, error code, and error description from the `AdditionalFields` property to provide detailed information about the failure. This could indicate issues with the antivirus software itself, a system compromise attempting to disable security controls, or a problem with the scanned files.
query: "DeviceEvents\r\n| where ActionType == @\"AntivirusScanFailed\"\r\n| extend ScanType = parse_json(AdditionalFields)[\"ScanTypeIndex\"]\r\n| extend ErrorCode = parse_json(AdditionalFields)[\"ErrorCode\"]\r\n| extend ErrorDescription = parse_json(AdditionalFields)[\"ErrorDescription\"]\r\n| summarize count() by Timestamp, DeviceName, ActionType, tostring(ScanType), tostring(ErrorCode), tostring(ErrorDescription)"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1562.001
tags:
    - kql
version: "1"
