id: 42c34214-33bf-467d-8807-fbf2269f9d65
name: glibc critical vulnerability (CVSS 9.8)
description: 'KQL Query from file: glibc critical vulnerability (CVSS 9.8)'
query: |
    // https://cybersecuritynews.com/glibc-vulnerability/
    // https://nvd.nist.gov/vuln/detail/CVE-2025-4802

    DeviceFileEvents
    | where TimeGenerated > ago(90d)
    | where ActionType == "FileCreated"
    | where FileName == "libc.so.6"
query_type: kql
tactics:
    - TA0002
    - TA0009
    - TA0006
    - TA0005
    - TA0007
techniques:
    - T1106
    - T1056.004
    - T1218.015
    - T1216.002
    - T1201
tags:
    - kql
version: "1"
