id: 47b58203-afbf-4538-9f3b-d142d7619cc2
name: Potential UAC Bypass via Eudcedit.exe Execution
description: Detects the execution of eudcedit.exe, the Windows Private Character Editor, which may be abused to bypass User Account Control (UAC) and achieve privilege escalation. Threat actors can leverage this trusted, auto-elevating binary to execute malicious payloads without prompting the user, particularly when UAC settings are permissive.
query: "DeviceProcessEvents\r\n| where InitiatingProcessFileName =~ \"eudcedit.exe\"\r\n| where FileName has_any (\"cmd.exe\", \"powershell.exe\")\r\n"
query_type: kql
severity: medium
tactics:
    - TA0004
techniques:
    - T1548.002
tags:
    - kql
author: Kyaw Pyiyt Htet
version: "1"
references:
    - https://medium.com/@matanb707/windows-fonts-exploitation-in-2025-bypassing-uac-with-eudcedit-915599705639
