id: 4e8d9a1e-3c39-489d-931a-6f2850aaf5bd
name: SharePoint Vulnerability - CVE-2025-53770 - Device Triage
description: Device Triage
query: "DeviceProcessEvents\r\n| where DeviceName == \"yoursharepointserver\"\r\n| where InitiatingProcessFileName == \"w3wp.exe\" or InitiatingProcessParentFileName == \"w3wp.exe\"\r\n| where FileName in~ (\"cmd.exe\",\"powershell.exe\")"
query_type: kql
severity: medium
techniques:
    - T1190
tags:
    - kql
version: "1"
