id: 4f1e03b6-087f-4055-8d2d-c5e00173e502
name: SharePoint - CVE-2025-53770 - Exploitation attempt
description: Looks for exploitation attempt of CVE-2025-53770
query: "DeviceFileEvents\r\n| where DeviceName == \"yoursharepointserver\"\r\n| where FileName endswith \".aspx\" and InitiatingProcessFileName !in~ (\"mssdmn.exe\",\"mssearch.exe\",\"TiWorker.exe\")"
query_type: kql
severity: medium
techniques:
    - T1190
tags:
    - kql
version: "1"
