id: 5022937f-7773-4ea9-a20f-6a97b72db63a
name: Entra User Account Compromised by C2
description: 'KQL Query from file: Entra User Account Compromised by C2'
query: |
    // Entra User Account Compromised by C2

    // A high precision detection using Sentinel Behaviour Analytics threat intelligence information to gathered successful Entra account login from C2 IP address from a unidentified source device. You should link this analytic rule trigger to a logic app playbook to mark this account as compromised.

    BehaviorAnalytics
    | where TimeGenerated > ago(1h)
    | where DevicesInsights.ThreatIntelIndicatorType == "C2"
    | where ActionType == "Sign-in"
    | where isempty(SourceDevice)
    | where ActivityInsights.CountryUncommonlyConnectedFromAmongPeers == "True"

    // MITRE ATT&CK
    // T1078.003 - Valid Accounts: Cloud Accounts
query_type: kql
tactics:
    - TA0005
    - TA0003
    - TA0004
    - TA0001
    - TA0002
    - TA0011
    - TA0010
techniques:
    - T1078.003
    - T1153
    - T1043
    - T1065
    - T1041
tags:
    - kql
version: "1"
