id: 5069f7a3-585f-4749-acd7-554605f33367
name: User Sign-in Activity
description: 'KQL Query from file: User Sign-in Activity'
query: "SigninLogs\r\n| where TimeGenerated > ago(7d)\r\nand UserPrincipalName contains \"\" //Enter UserPrincipalName\r\n| extend MFAresult = tostring(Status.additionalDetails)\r\n| extend OperatingSystem = tostring(DeviceDetail.operatingSystem)\r\n| extend DeviceId = tostring(DeviceDetail.deviceId)\r\n| extend DeviceName = tostring(DeviceDetail.displayName)\r\n| extend TrustType = tostring(DeviceDetail.trustType)\r\n| extend ParsedAuthDetails = parse_json(AuthenticationDetails)\r\n| project TimeGenerated, \r\n          IPAddress, \r\n          UserPrincipalName, \r\n          MFAresult, \r\n          AppDisplayName, \r\n          ResourceDisplayName,\r\n          ClientAppUsed,\r\n          ResultType, \r\n          ResultDescription, \r\n          ConditionalAccessStatus, \r\n          UserAgent, \r\n          AuthenticationRequirement, \r\n          AuthenticationMethodsUsed,\r\n          AuthStep0 = tostring(ParsedAuthDetails[0].authenticationStepResultDetail),\r\n          AuthStep1 = tostring(ParsedAuthDetails[1].authenticationStepResultDetail)"
query_type: kql
severity: medium
tactics:
    - TA0006
    - TA0005
    - TA0003
techniques:
    - T1111
    - T1621
    - T1556.006
tags:
    - kql
author: DonCoglione
version: "1"
