id: 5069b5e3-118e-46fb-81bd-28b114e135be
name: Unmanaged PowerShell Detection
description: 'KQL Query from file: Unmanaged PowerShell Detection'
query: "DeviceImageLoadEvents\r\n| where FileName has_any (\"System.Management.Automation.dll\", \"System.Management.Automation.ni.dll\")\r\n| where InitiatingProcessFileName !~ \"powershell.exe\" or InitiatingProcessFileName !~ \"powershell_ise.exe\"\r\n| where InitiatingProcessFolderPath has_any (\"temp\", \"user\", \"ProgramData\", \"AppData\")\r\n"
query_type: kql
severity: medium
tactics:
    - TA0002
techniques:
    - T1059.001
tags:
    - kql
author: Kyaw Pyiyt Htet
version: "1"
references:
    - https://www.paloaltonetworks.com/blog/security-operations/stopping-powershell-without-powershell/
