id: 50e3a802-c650-4610-b7f0-f18539ace47e
name: Azure AD Authenticator App Device Modification Detection
description: This rule monitors changes to users' Authenticator app registrations within Azure Active Directory. It detects unauthorized device additions or removals, which can be used by adversaries to bypass multi-factor authentication or maintain persistent access to compromised accounts. The rule parses audit logs for 'Update user' operations specifically targeting 'StrongAuthenticationPhoneAppDetail' to identify both added and removed Authenticator app devices.
query: "## \U0001F50D KQL Description\n#### This query is used to:\n#### 1.Monitor changes to users' Authenticator app registrations.\n#### 2.Detect unauthorized device additions or removals.\n#### 3.Support incident response and forensic investigations.\n#### 4.Ensure compliance with MFA policies.\n## \U0001F9E9 MITRE ATT&CK Mapping\n#### Tactic:Persistence / Defense Evasion\n#### Goal: Adversaries may manipulate MFA device registrations to bypass authentication or maintain access.\n#### Technique: Modify Authentication Process (T1556.006 - Modify Authentication Process: MFA)\n#### Attackers may add their own device to a user's account or remove legitimate devices to control authentication.\n### Query:\n```KQL\n//Azure Log Analytics query to parse modified StrongAuthenticationPhoneAppDetail\nlet DeviceChanges = AuditLogs\n| where OperationName == \"Update user\"  and TargetResources contains \"StrongAuthenticationPhoneAppDetail\"\n| extend Target = tostring(TargetResources[0].userPrincipalName)\n| extend Actor = case(isempty(parse_json(InitiatedBy.user).userPrincipalName),tostring(parse_json(InitiatedBy.app).displayName) ,tostring(parse_json(InitiatedBy.user).userPrincipalName))\n| mvexpand ModifiedProperties = parse_json(TargetResources[0].modifiedProperties)\n| where ModifiedProperties.displayName == \"StrongAuthenticationPhoneAppDetail\" \n| project TimeGenerated,Actor,Target,TargetResources,ModifiedProperties,Id;\nlet OldValues= DeviceChanges\n| extend  OldValue = parse_json(tostring(ModifiedProperties.oldValue))\n| mv-apply OldValue on (extend Old_DeviceName=tostring(OldValue.DeviceName),Old_DeviceToken=tostring(OldValue.DeviceToken) | sort by tostring(Old_DeviceToken));\nlet NewValues= DeviceChanges\n| extend NewValue = parse_json(tostring(ModifiedProperties.newValue))\n| mv-apply NewValue on (extend New_DeviceName=tostring(NewValue.DeviceName),New_DeviceToken=tostring(NewValue.DeviceToken) | sort by tostring(New_DeviceToken));\nlet RemovedDevices = DeviceChanges\n| join kind=inner OldValues  on Id\n| join kind=leftouter  NewValues on Id,$left.Old_DeviceToken==$right.New_DeviceToken,$left.Old_DeviceName==$right.New_DeviceName\n| extend Action = strcat(\"Removed Authenticator App Device (Name: \", Old_DeviceName , \", Token: \", Old_DeviceToken , \") from Strong Authentication\");\nlet AddedDevices = DeviceChanges\n| join kind=inner NewValues  on Id\n| join kind=leftouter OldValues on Id,$left.New_DeviceToken==$right.Old_DeviceToken,$left.New_DeviceName==$right.Old_DeviceName\n| extend Action = strcat(\"Added Authenticator App Device (Name: \", New_DeviceName , \", Token: \", New_DeviceToken , \") to Strong Authentication\");\nunion RemovedDevices,AddedDevices\n| where Old_DeviceToken != New_DeviceToken\n| project TimeGenerated,Action,Actor,Target,Old_DeviceName,Old_DeviceToken,New_DeviceName,New_DeviceToken\n| distinct *\n```\n"
query_type: kql
tactics:
    - TA0006
    - TA0005
    - TA0003
techniques:
    - T1556.006
tags:
    - kql
version: "1"
