id: 51f5fdf0-3527-4180-a3f7-bd91ef5df315
name: Golden Chickens TerraLogger Detection
description: 'KQL Query from file: Golden Chickens TerraLogger Detection'
query: |+
    // https://www.recordedfuture.com/research/terrastealerv2-and-terralogger

    DeviceFileEvents
    | where Timestamp > ago(1h)
    | where ActionType == "FileCreated"
    | where FileName endswith ".txt"
    | where FolderPath startswith "c:\\programdata\\"
    | where InitiatingProcessCommandLine has "regsvr32" and
    InitiatingProcessCommandLine has ".ocx"

query_type: kql
tactics:
    - TA0005
    - TA0002
techniques:
    - T1117
    - T1218.010
tags:
    - kql
version: "1"
