id: 581a2b3a-bfd6-47eb-b3bb-2a7f78fe68a3
name: Suspicious CLI Obfuscation
description: 'KQL Query from file: Suspicious CLI Obfuscation'
query: |
    // Goal is to catch powershell and bash obfuscation techniques. Mostly powershell.
    // If the intention is to use this as a detection, it will most likely need tuned to your environment but it has been succesful in mine though multiple tests.
    // If you have questions or reccomendations, please email me at eatinsundip@ccaves.net

    DeviceProcessEvents
    | where ProcessCommandLine matches regex @"'[^']+'\s*\+\s*'[^']+'" or //Checking for 'A'+'B' style obfuscation
        ProcessCommandLine matches regex @'"[^"]+"\s*\+\s*"[^"]+"' or //Checking for "A"+"B" style obfuscation
        ProcessCommandLine matches regex @".Replace\s*\(" // Checking for .replace obfuscation
    | project Timestamp, AccountName, InitiatingProcessFileName, ProcessCommandLine, DeviceId, ReportId
    | sort by Timestamp desc
query_type: kql
tactics:
    - TA0005
    - TA0002
techniques:
    - T1027
    - T1027.010
    - T1059
    - T1059.001
    - T1086
tags:
    - kql
version: "1"
