id: 5e11c986-13c2-47ce-b0df-ca2ddd145ec8
name: '[RW] - Detecting Text and CSV Data Dumps via Command Line'
description: KQL Query
query: "DeviceEvents\n| where isnotempty(AdditionalFields) \n| extend Command = tostring(parse_json(AdditionalFields).Command)\n// search for commands exporting data into .txt or .csv format\n| where Command endswith \".txt\" or Command endswith \".csv\"\n// excluding known cases\n| where Command !startswith \"Start-Process\"\n| project Timestamp, DeviceName, ActionType, ProcessCommandLine, Command, InitiatingProcessAccountName, InitiatingProcessAccountUpn, ProcessRemoteSessionDeviceName, ReportId"
query_type: kql
severity: medium
tactics:
    - TA0010
    - TA0009
techniques:
    - T1074
    - T1020
    - T1567
tags:
    - KQL
    - SergioAlbea
    - Ransomware
author: Sergio Albea
version: "1"
