id: 5e61d7db-3935-4015-8610-0fe18b82fc1e
name: CVSS 9.8 Rockwell Automation Impacted by High-Severity log4net Vulnerability
description: 'KQL Query from file: CVSS 9.8 Rockwell Automation Impacted by High-Severity log4net Vulnerability'
query: |+
    // https://securityonline.info/9-8-cvss-score-rockwell-automation-impacted-by-high-severity-log4net-vulnerability/
    // https://www.rockwellautomation.com/en-us/trust-center/security-advisories/advisory.SD1728.html

    DeviceInfo
    | where Vendor has "rockwell"
    | summarize arg_max(TimeGenerated, *) by DeviceId

query_type: kql
tactics:
    - TA0002
techniques:
    - T1059.010
tags:
    - kql
version: "1"
