id: 5e7f12fb-949b-433e-8e59-edbeeb88d78e
name: Windows Defender Exclusion Registry Modification
description: This rule detects modifications to Windows Defender exclusion paths in the registry. Adversaries may modify these registry keys to add exclusions for their malicious files or processes, allowing them to evade detection by Windows Defender. The rule specifically looks for changes to the 'Exclusions\Paths', 'Exclusions\Processes', and 'Exclusions\Extensions' keys under HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows Defender.
query: "DeviceRegistryEvents\r\n| where RegistryKey == @\"\"HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Defender\\Exclusions\\Paths\"\" or RegistryKey == @\"\"HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Defender\\Exclusions\\Processes\"\" or RegistryKey == @\"\"HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Defender\\Exclusions\\Extensions\"\"\r\n| project Timestamp, DeviceName, DeviceId, ReportId ,PreviousRegistryValueName,RegistryValueName"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1562.001
tags:
    - kql
version: "1"
