id: 5f43e097-457f-4a8e-8a07-b00edc2c5b85
name: FileFix Detection
description: 'KQL Query from file: FileFix Detection'
query: |
    // FileFix - Social Engineering Attack Detection
    // https://mrd0x.com/filefix-clickfix-alternative/

    let MonitoredCommands = dynamic(["powershell","pwsh","regsvr32","bitsadmin","certutil", "mshta"]);
    let BrowserList = dynamic(["chrome","msedge","firefox","brave"]);
    DeviceProcessEvents
    | where Timestamp > ago(1h)
    | where FileName has_any(MonitoredCommands) and InitiatingProcessFileName has_any(BrowserList)
query_type: kql
tactics:
    - TA0002
    - TA0005
    - TA0003
    - TA0001
techniques:
    - T1086
    - T1059.001
    - T1117
    - T1218.010
    - T1197
    - T1170
    - T1218.005
    - T1566
    - T1218
tags:
    - kql
version: "1"
