id: 5fdf397f-a51e-4348-aa44-46df1a44fdc0
name: ServiceNow - Large Amount of Requests Created by Single User Within Short Time Period
description: A potentially malicious user is creating a large amount of requests that overwhelms the IT team. This disrupts response processes and important tickets may be ignored or delayed. This detection detects users that create a large amount of tickets within a short time period.
query: "CloudAppEvents\r\n| where Application == \"ServiceNow\"\r\n| where AccountId != \"0\"\r\n| where ActionType == \"sc_req_item.inserted\"\r\n| where TimeGenerated > ago(30d)\r\n| summarize RequestCount = count() by AccountDisplayName, bin(TimeGenerated, 30m)\r\n| where RequestCount > 5"
query_type: kql
severity: medium
techniques:
    - T1078
tags:
    - kql
version: "1"
