id: 63fbaf6e-6e5d-4ecd-bda5-711410457450
name: ADWS Connections from Unknown Devices
description: This hunting rule searches for incoming ADWS connections on Domain Controllers from IP Addresses that cannot be linked to Microsoft Defender for Endpoint (MDE) onboarded devices. It aims to detect enumeration activities using ADWS from unmanaged or unknown devices, which might bypass typical monitoring tools.
query: "# *Hunt for ADWS requests from unknown devices*\n\n## Query Information\n\n#### MITRE ATT&CK Technique(s)\n\n| Technique ID | Title    | Link    |\n| ---  | --- | --- |\n| T1119 | Automated Collection | https://attack.mitre.org/techniques/T1119/ |\n| T1087.002 | Account Discovery - Domain Account | https://attack.mitre.org/techniques/T1087/002/ |\n| T1069.002 | Permission Groups Discovery - Domain Groups | https://attack.mitre.org/techniques/T1069/002/ |\n| T1201 | Password Policy Discovery | https://attack.mitre.org/techniques/T1201/ |\n| T1482 | Domain Trust Discovery | https://attack.mitre.org/techniques/T1482/ |\n| T1021.002 | Remote Services - SMB/Windows Admin Shares | https://attack.mitre.org/techniques/T1021/002/ |\n| T1018 | Remote System Discovery | https://attack.mitre.org/techniques/T1018/ |\n| T1135 | Network Share Discovery | https://attack.mitre.org/techniques/T1135/ |\n\n#### Description\nThis hunting rule searches for incomming ADWS connections on Domain Controllers (DC's need to be onboarded in Defender for Endpoint) from IP Addresses that cannot be linked to MDE onboarded devices.\n\n#### Risk\nAdversary tools used to enumerate Active Directory over ADWS instead of using LDAP are becoming more popular, since they often stay under the radar of most monitoring tools. In the references you can find two detections provided by FalconForce on how you can detect ADWS connections from an unexpected binary, when the source device is onboarded in Microsoft Defender for Endpoint. But if somehow an unmanaged device was able to to connect via ADWS to domain controllers, we are not able to use these detections. Because of this, you should hunt for unknown devices performing ADWS connections and treat them as suspicious. \n\n#### Author <Optional>\n- **Name:** Robbe Van den Daele\n- **Github:** https://github.com/RobbeVandenDaele\n- **Twitter:** https://x.com/RobbeVdDaele\n- **LinkedIn:** https://www.linkedin.com/in/robbe-van-den-daele-677986190/\n- **Website:** https://hybridbrothers.com/\n\n#### References\n- https://falconforce.nl/soaphound-tool-to-collect-active-directory-data-via-adws/\n- https://github.com/FalconForceTeam/FalconFriday/blob/master/Discovery/ADWS_Connection_from_Unexpected_Binary-Win.md\n- https://github.com/FalconForceTeam/FalconFriday/blob/master/Discovery/ADWS_Connection_from_Process_Injection_Target-Win.md\n- https://cyberlandsec.com/soapy-the-ultimate-stealthy-active-directory-enumeration-tool-via-adws/\n- https://github.com/FalconForceTeam/SOAPHound\n\n## Defender XDR\n```KQL\nlet device_info = (\n    // Get device network info from last 7 days\n    DeviceNetworkInfo\n    | where Timestamp > ago(7d)\n    // Expand the IP Addresses of the devices\n    | mv-expand todynamic(IPAddresses)\n    | extend IPAddress = tostring(IPAddresses.IPAddress)\n    // Distinct IP address for each device\n    | distinct DeviceName, DeviceId, IPAddress\n    // Search for each device if it is onboarded or not\n    | join kind=inner (\n        DeviceInfo \n        | where Timestamp > ago(7d)\n        | distinct DeviceName, DeviceId, OnboardingStatus\n        // Get the first timestamp the device was seen\n        | join kind=inner (\n            DeviceInfo\n            | where Timestamp > ago(30d)\n            | summarize FirstSeen = arg_min(Timestamp, DeviceId) by DeviceId\n        ) on DeviceId\n        | project-away DeviceId1, DeviceId2\n    ) on DeviceId, DeviceName\n    | project-away DeviceName1, DeviceId1\n);\n// Get incomming traffic on ADWS port and save unique remote IP addresses\nDeviceNetworkEvents\n| where Timestamp > ago(30d)\n| where ActionType != \"ListeningConnectionCreated\"\n| where InitiatingProcessFolderPath == @\"c:\\windows\\adws\\microsoft.activedirectory.webservices.exe\"\n| where LocalPort == \"9389\"\n| summarize ConnectionTimes=make_list(Timestamp) by RemoteIP, DeviceName\n// Get device information of remote IP addresses, results for IP we do not find information for are allowed\n| join kind=leftouter device_info on $left.RemoteIP == $right.IPAddress\n| project-away IPAddress\n// Check if the remote IPs are onboarded devices or not\n| where OnboardingStatus != \"Onboarded\"\n// Make output better\n| project DeviceName, ConnectionTimes, RemoteIP, RemoteDeviceName = DeviceName1, RemoteDeviceId = DeviceId, RemoteOnboardingStatus = OnboardingStatus, RemoteDeviceFirstSeen = FirstSeen\n```\n\n## Sentinel\n```KQL\nlet device_info = (\n    // Get device network info from last 7 days\n    DeviceNetworkInfo\n    | where TimeGenerated > ago(7d)\n    // Expand the IP Addresses of the devices\n    | mv-expand todynamic(IPAddresses)\n    | extend IPAddress = tostring(IPAddresses.IPAddress)\n    // Distinct IP address for each device\n    | distinct DeviceName, DeviceId, IPAddress\n    // Search for each device if it is onboarded or not\n    | join kind=inner (\n        DeviceInfo \n        | where TimeGenerated > ago(7d)\n        | distinct DeviceName, DeviceId, OnboardingStatus\n        // Get the first timestamp the device was seen\n        | join kind=inner (\n            DeviceInfo\n            | where TimeGenerated > ago(30d)\n            | summarize FirstSeen = arg_min(TimeGenerated, DeviceId) by DeviceId\n        ) on DeviceId\n        | project-away DeviceId1, DeviceId2\n    ) on DeviceId, DeviceName\n    | project-away DeviceName1, DeviceId1\n);\n// Get incomming traffic on ADWS port and save unique remote IP addresses\nDeviceNetworkEvents\n| where TimeGenerated > ago(30d)\n| where ActionType != \"ListeningConnectionCreated\"\n| where InitiatingProcessFolderPath == @\"c:\\windows\\adws\\microsoft.activedirectory.webservices.exe\"\n| where LocalPort == \"9389\"\n| summarize ConnectionTimes=make_list(TimeGenerated) by RemoteIP, DeviceName\n// Get device information of remote IP addresses, results for IP we do not find information for are allowed\n| join kind=leftouter device_info on $left.RemoteIP == $right.IPAddress\n| project-away IPAddress\n// Check if the remote IPs are onboarded devices or not\n| where OnboardingStatus != \"Onboarded\"\n// Make output better\n| project DeviceName, ConnectionTimes, RemoteIP, RemoteDeviceName = DeviceName1, RemoteDeviceId = DeviceId, RemoteOnboardingStatus = OnboardingStatus, RemoteDeviceFirstSeen = FirstSeen\n```"
query_type: kql
tactics:
    - TA0007
    - TA0008
techniques:
    - T1018
    - T1135
    - T1021.002
    - T1482
    - T1201
    - T1069.002
    - T1087.002
tags:
    - kql
version: "1"
references:
    - https://falconforce.nl/soaphound-tool-to-collect-active-directory-data-via-adws/
    - https://github.com/FalconForceTeam/FalconFriday/blob/master/Discovery/ADWS_Connection_from_Unexpected_Binary-Win.md
    - https://github.com/FalconForceTeam/FalconFriday/blob/master/Discovery/ADWS_Connection_from_Process_Injection_Target-Win.md
    - https://cyberlandsec.com/soapy-the-ultimate-stealthy-active-directory-enumeration-tool-via-adws/
    - https://github.com/FalconForceTeam/SOAPHound
