id: 6657db84-f50d-46fe-b1bb-380bc2614c3e
name: Changes in SymlinkEvaluation Behavior via fsutil
description: 'KQL Query from file: Changes in SymlinkEvaluation Behavior via fsutil'
query: |-
    DeviceProcessEvents
    | where FileName =~ "fsutil.exe"
    | where ProcessCommandLine contains "set SymlinkEvaluation"
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0008
tags:
    - kql
version: "1"
