id: 6990c08e-1cd6-427a-8a56-e978edab5831
name: LOLBAS - Powershell - Suspicious Powershell Commands for File Extension Exclusion
description: 'Detection looks for Powershell used with various cmdlets used to add certain filetypes to Defender AV exclusion, they would normally be blocked upon execution in certain ways. Allows an actor to execute their own files that normally would be blocked. '
query: "DeviceProcessEvents\r\n| where FileName =~ \"powershell.exe\"\r\n| where ProcessCommandLine has_all (\"Add-MpPreference\")\r\n| where ProcessCommandLine has_any (\".dll\", \".vbs\", \".zip\", \".bat\", \".lnk\")\r\n"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1562
    - T1562.001
tags:
    - kql
author: Xavier
version: "1"
references:
    - https://redcanary.com/threat-detection-report/techniques/disable-or-modify-tools/
