id: 6c873a5b-7de6-4393-8abd-2c0ce610b020
name: NTDS.dit File Modification
description: This rule detects modifications to the NTDS.dit file, which is the Active Directory database. Adversaries often target this file to extract credentials and other sensitive information from domain controllers. Monitoring changes to this file can indicate an attempt at credential dumping or unauthorized access to Active Directory.
query: "  // Example query to verify alert\r\n  DeviceFileEvents\r\n  | where FolderPath contains \"ntds\" and FolderPath contains \"dit\" and ActionType == \"FileModified\"\r\n  | summarize count() by DeviceId, DeviceName, FolderPath, TimeGenerated\r\n"
query_type: kql
severity: medium
tactics:
    - TA0006
techniques:
    - T1003.003
tags:
    - kql
version: "2"
