id: 7333e2bf-cbe7-4903-bf95-ff237868f3d0
name: Entra QR Code Sign-In KQL Detection
description: 'KQL Query from file: Entra QR Code Sign-In KQL Detection'
query: |+
    // Entra QR Code Sign-In KQL Detection

    AuditLogs
    | where TimeGenerated > ago(1h)
    | where Category == "UserManagement"
    | where ActivityDisplayName == "Admin updated security info"
    | where ResultDescription == "Admin changed QRcode Pin Authentication Method for user"

query_type: kql
tactics:
    - TA0043
    - TA0005
    - TA0003
    - TA0004
    - TA0002
techniques:
    - T1593.003
    - T1116
    - T1553.002
    - T1547.002
    - T1131
    - T1047
tags:
    - kql
version: "1"
