id: 737500d2-74e4-4d02-b7cd-ed3f732f8e30
name: Modification of Local Administrator Group
description: This rule detects attempts to modify the local Administrators group using the 'net localgroup administrators' command. This command is often used by adversaries to add users to the local administrators group for privilege escalation or persistence.
query: "DeviceProcessEvents\r\n| where ProcessCommandLine matches regex @\"(?i:net\\ localgroup\\ \\'?\\x22?administrators\\'?\\x22?)\""
query_type: kql
severity: medium
tactics:
    - TA0003
    - TA0004
techniques:
    - T1098
tags:
    - kql
version: "1"
