id: 75416157-3be8-48e5-a7a4-f1224fe6b8fc
name: Sysinternals Tools Zero Day Vulnerability Detection
description: KQL Query
query: |
    // Sysinternals Tools Zero Day Vulnerability Detection

    // https://www.foto-video-it.de/2025/allgemein/disclosure-sysinternals/

    let SysinternalsTools=externaldata(RawData:string)
    [h'https://raw.githubusercontent.com/SlimKQL/Hunting-Queries-Detection-Rules/refs/heads/main/IOC/SysinternalsTools.txt']
    | parse RawData with BinariesName:string;
    let SysinternalsToolsBinaries =
    SysinternalsTools
    | project BinariesName;
    let SuspiciousSysInternalsEP =
    DeviceEvents
    | where FolderPath startswith "\\\\"
    | where FileName has_any(SysinternalsToolsBinaries)
    | distinct DeviceName;
    DeviceEvents
    | where ActionType == @"DriverLoad"
    | where FileName endswith ".dll"
    | where FolderPath startswith "\\\\"
    | where DeviceName has_any(SuspiciousSysInternalsEP)
query_type: kql
tactics:
    - TA0005
    - TA0003
    - TA0004
    - TA0008
    - TA0001
techniques:
    - T1073
    - T1574.002
    - T1574.001
    - T1021
    - T1210
    - T1133
tags:
    - kql
version: "1"
