id: 764790ea-e50b-4606-895e-f07367993079
name: '[RW] - Detect suspicious files dropped into Public Folder'
description: Another common behaviour is dropping ransom notes in the 'C:\Users\Public' folder to notify about the encryption and the details for the corresponding payments. I recommend you to execute this KQL query to see if you have some false positive to whitelist them as I have with .lnk files ( basically browser shortcuts)
query: |-
    DeviceEvents
    | where FolderPath contains "Users\\Public" and FileName !endswith ".lnk"
    | distinct DeviceName, ActionType, FileName, FolderPath
query_type: kql
severity: medium
tags:
    - Ransomware
    - SergioAlbea
    - KQL
author: Sergio Albea
version: "1"
references:
    - https://medium.com/detect-fyi/identifying-ransomware-final-stage-activities-with-kql-queries-00b3cf0ef31b
