id: 77315200-d378-433b-aa42-fa8838904c83
name: Detect Enabled Accounts Without Password Change
description: Identifies accounts enabled with a default password that haven't been changed by the user within 48 hours, significant for Windows Server 2012 or below environments due to blank password options.
query: "#### Identifies when an account is enabled with a default password and the password is not set by the user within 48 hours.\n## Mitre Att&ck (Persistence)\n### T1098: Account Manipulation\n#### This Detection rule is mostly for the organization that has Windows server 2012 or below as Domain Controller cause you can enable blank password option while creating any user account.\n#### Query: \n```KQL\n// Get events where users are enabled\nlet userEnabledEvents = IdentityDirectoryEvents\n    | where ActionType == \"Account enabled\"\n    | project EnabledTime = TimeGenerated, AccountUpn, AccountSid;\n// Get events where passwords are set\nlet passwordSetEvents = IdentityDirectoryEvents\n    | where ActionType == \"Account Password changed\"\n    | project PasswordSetTime = TimeGenerated, AccountUpn, AccountSid;\n// Join enabled events with password set events\nlet enabledWithoutPasswordSet = userEnabledEvents\n    | join kind=leftouter (passwordSetEvents) on AccountSid\n    | extend TimeDifference = datetime_diff(\"hour\", PasswordSetTime, EnabledTime)\n    | where isnull(PasswordSetTime) or TimeDifference > 48\n    | project AccountUpn, EnabledTime, PasswordSetTime, TimeDifference\n    | order by EnabledTime desc;\nenabledWithoutPasswordSet\n```\n"
query_type: kql
version: "1"
