id: 78613590-7e2e-4214-90a8-fd38b1b0ce60
name: User Clicked URL in Threat Email
description: This rule detects instances where an email with identified threats (e.g., malware, phishing) is received and a URL within that email is subsequently clicked by a user. It correlates email threat information with URL click events to identify successful user interaction with malicious links.
query: "EmailEvents\r\n| where ThreatTypes != \"\"\r\n| join UrlClickEvents on NetworkMessageId\r\n| extend EmailReceivedTime = Timestamp, URLClickedTime = Timestamp1, ClickedURL = Url\r\n| project EmailReceivedTime,SenderFromAddress,SenderIPv4, RecipientEmailAddress, Subject, DeliveryAction, DeliveryLocation, ThreatTypes, UrlCount, URLClickedTime,ClickedURL,ActionType, IsClickedThrough, UrlChain"
query_type: kql
severity: medium
tactics:
    - TA0001
    - TA0002
techniques:
    - T1566
    - T1204.001
tags:
    - kql
version: "1"
