id: 7c769905-c8cb-40dc-8f83-8abdfd53aac5
name: TypeLib .COM Bypass
description: This detects the registry change needed to perform the TypeLib .COM bypass to execute the identified script let
query: |+
    // Detects COM TypeLib hijacking persistence technique targeting Microsoft Web Browser CLSID
    // Reference: https://research.checkpoint.com/2025/zipline-phishing-campaign/
    DeviceRegistryEvents
    | where ActionType == 'RegistryValueSet'
    | where RegistryKey has '\TypeLib\{EAB22AC0-30C1-11CF-A7EB-0000C05BAE0B}\'
    | where RegistryValueData has '.sct$'

query_type: kql
severity: medium
techniques:
    - T1559.001
tags:
    - kql
author: John Bambenel
version: "1"
references:
    - https://research.checkpoint.com/2025/zipline-phishing-campaign/
