id: 7c90658c-edd6-475f-9a8c-0b4241e9f023
name: Windows Antivirus Mode Not Default
description: This rule detects if the Antivirus (AV) mode on a Windows device, as reported by DeviceTvmInfoGathering, is not set to '0'. A non-zero AvMode could indicate that the antivirus is not in a default or expected state, potentially suggesting a disabled or misconfigured AV.
query: "DeviceTvmInfoGathering\r\n| extend AvMode = parse_json(AdditionalFields)[\"AvMode\"]\r\n| where OSPlatform contains \"Windows\"\r\n| where AvMode != @\"0\""
query_type: kql
severity: medium
tags:
    - kql
version: "1"
