id: 7cf6aaee-3ae0-4e98-a3db-d424457cf881
name: Detect Malicious Browser Extensions and Adware Connections
description: This query identifies devices with potentially malicious or unwanted browser extensions and detects outbound connections to known adware or tracking domains for threat hunting.
query: "// ð\x9F\x94\x8D KQL Description\n// This query helps security analysts:\n// 1.Identify devices with potentially malicious or unwanted browser extensions.\n// 2.Detect outbound connections to known adware or tracking domains.\n// 3.Correlate extension presence with network behavior for deeper threat hunting.\n// ð\x9F§© MITRE ATT&CK Mapping\n// Tactic:Persistence (TA0003), Command and Control (TA0011)\n// Technique: Browser Extensions (T1176), Application Layer Protocol (T1071)\nlet ioc = dynamic([\"kgmeffmlnkfnjpgmdndccklfigfhajen\",\"Emoji keyboard online\",\n\"dpdibkjjgbaadnnjhkmmnenkmbnhpobj\", \"Free Weather Forecast\",\n\"gaiceihehajjahakcglkhmdbbdclbnlf\", \"Video Speed Controller \",\n\"mlgbkfnjdmaoldgagamcnommbbnhfnhf\", \"Unlock Discord\",\n\"eckokfcjbjbgjifpcbdmengnabecdakp\" ,\"Dark Theme\",\n\"mgbhdehiapbjamfgekfpebmhmnmcmemg\", \"Volume Max\",\n\"cbajickflblmpjodnjoldpiicfmecmif\", \"Unblock TikTok\",\n\"pdbfcnhlobhoahcamoefbfodpmklgmjm\",\n\"eokjikchkppnkdipbiggnmlkahcdkikp\", \"Color Picker\", \"Eyedropper\",\n\"ihbiedpeaicgipncdnnkikeehnjiddck\", \"Weather\",\n\"jjdajogomggcjifnjgkpghcijgkbcjdi\", \"Unlock TikTok\",\n\"mmcnmppeeghenglmidpmjkaiamcacmgm\", \"Volume Booster\",\n\"ojdkklpgpacpicaobnhankbalkkgaafp\", \"Web Sound Equalizer\",\n\"lodeighbngipjjedfelnboplhgediclp\", \"Header Value\",\n\"hkjagicdaogfgdifaklcgajmgefjllmd\", \"Flash Player\",\n\"gflkbgebojohihfnnplhbdakoipdbpdm\", \"Youtube Unblocked\",\n\"kpilmncnoafddjpnbhepaiilgkdcieaf\", \"SearchGPT\",\n\"caibdnkmpnjhjdfnomfhijhmebigcelo\", \"Unlock Discord\",\n\"admitab.com\",\n\"edmitab.com\",\n\"click.videocontrolls.com\",\n\"c.undiscord.com\",\n\"click.darktheme.net\",\n\"c.jermikro.com\",\n\"c.untwitter.com\",\n\"c.unyoutube.net\",\n\"admitclick.net\",\n\"addmitad.com\",\n\"abmitab.com\",\n\"admitlink.net\"]);\nlet BrowsersExtensions = DeviceTvmBrowserExtensions \n| where ExtensionId has_any (ioc) or ExtensionName has_any (ioc);\nlet Firewalllogs = CommonSecurityLog\n| where DestinationHostName has_any (ioc)\n| where DestinationHostName !contains \"weather\";\nBrowsersExtensions\n| union Firewalllogs\n| sort by TimeGenerated desc"
query_type: kql
severity: medium
tactics:
    - TA0011
version: "2"
