id: 7e2b4473-6a1b-48c3-9767-5cb8ec414a3e
name: 'Malicious NPM Package post install script '
description: 'KQL Query from file: Malicious NPM Package post install script '
query: "let GoodPackageRepo = dynamic([\"registry.npmjs.org\", \"registry.yarnpkg.com\", \"repo.yarnpkg.com\", \"registry.npmjs.org\",\"npm.pkg.github.com\"]);\r\nlet timewindow = 5m;\r\nlet NPM_PackageInstall = DeviceProcessEvents\r\n| where FileName contains \"node.exe\" \r\n| where InitiatingProcessCommandLine contains \"npm install\" \r\n| where ProcessCommandLine !contains \"types-registry@latest\" \r\n| project NPM_PackageInstallTime = Timestamp, DeviceId, FileName, ProcessCommandLine, InitiatingProcessCommandLine;\r\nlet NPM_PostInstallScript = DeviceProcessEvents\r\n| where FileName contains \"node.exe\"\r\n| where ProcessCommandLine has_any(\"postinstall.js\", \"preinstall.js\")\r\n| project NPM_PostInstallScriptTime = Timestamp, DeviceId, FileName, ProcessCommandLine, InitiatingProcessCommandLine;\r\nlet NetworkPostNPMInstall = DeviceNetworkEvents\r\n| where InitiatingProcessFileName contains \"node.exe\"\r\n//| where RemoteUrl !in (GoodPackageRepo) and RemoteUrl !contains \"knowngoodandexpected\"\r\n| where RemoteIPType contains \"Public\"\r\n| project NetworkPostNPMInstallTime = Timestamp, DeviceId, DeviceName, InitiatingProcessFileName, InitiatingProcessCommandLine, RemoteIP, RemoteUrl;\r\nNPM_PackageInstall\r\n| join kind=inner (NPM_PostInstallScript) on DeviceId\r\n| join kind=inner (NetworkPostNPMInstall) on DeviceId\r\n| where abs(datetime_diff('minute', NPM_PackageInstallTime, NPM_PostInstallScriptTime)) <= 1\r\n| where abs(datetime_diff('minute',NPM_PostInstallScriptTime, NetworkPostNPMInstallTime)) <= 1 //Adjustment made to user dateime_diff of 1 minute for performance \r\n| project coalesce(NetworkPostNPMInstallTime, NPM_PackageInstallTime), DeviceId, DeviceName, FileName, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessCommandLine, RemoteIP, RemoteUrl"
query_type: kql
severity: medium
tactics:
    - TA0001
    - TA0005
techniques:
    - T1195
    - T1195.002
    - DS0012
    - T1220
tags:
    - kql
version: "1"
