id: 7fe08730-4bbe-4aa5-b030-98459578c70b
name: DefenderXDR MITRE ATT&CK Technique Analysis
description: 'KQL Query from file: DefenderXDR MITRE ATT&CK Technique Analysis'
query: |
    // DefenderXDR MITRE ATT&CK Technique Analysis

    AlertEvidence
    |where Timestamp > ago(30d)
    | mv-expand parse_json(AttackTechniques)
    | where isnotempty(AttackTechniques)
    | summarize TechniqueCount=count() by tostring(AttackTechniques)
    | sort by TechniqueCount

    // Export the result as a CSV
    // Copilot Prompt:
    // Can you help me generate MITRE ATT&CK Techniques heatmap using standard MITRE ATT&CK Enterprise framework with the attached CSV data?
query_type: kql
tactics:
    - TA0005
techniques:
    - T1562.010
tags:
    - kql
version: "1"
