id: 80b6fa25-aa29-4a28-8563-aecdccb96a85
name: Zero Click, One NTLM - Microsoft Security Patch Bypass Detection
description: ' '
query: "DeviceEvents\r\n| where Timestamp > ago(1h)\r\n| where ActionType == \"ShellLinkCreateFileEvent\"\r\n| where tostring(AdditionalFields) contains \"ShellLink\"\r\n| where parse_json(AdditionalFields)[\"ShellLinkShowCommand\"] != 'SW_SHOWNORMAL'\r\n| extend ShellLinkCommandLine = parse_json(AdditionalFields)[\"ShellLinkCommandLine\"]\r\n| extend ShellLinkIconPath = parse_json(AdditionalFields)[\"ShellLinkIconPath\"]\r\n| where ShellLinkCommandLine startswith \"\\\\\" and ShellLinkCommandLine endswith \".exe\"\r\n| where ShellLinkIconPath has \"shell32.dll\""
query_type: kql
severity: medium
tags:
    - kql
author: Steven Lim
version: "1"
