id: 81619e38-96d9-4c87-bfc4-c0ad1ef4f7f5
name: Hunt downloads from popular browsers
description: Hunting query to monitor downloads through popular browsers
query: "DeviceFileEvents \r\n| where Timestamp > ago(30d)\r\n| where \r\n    InitiatingProcessFolderPath endswith @\"windows\\system32\\browser_broker.exe\" \r\n    or InitiatingProcessFolderPath endswith @\"program files\\internet explorer\\iexplore.exe\"\r\n    or InitiatingProcessFolderPath endswith @\"program files (x86)\\internet explorer\\iexplore.exe\"\r\n    or (InitiatingProcessFileName =~ \"chrome.exe\")\r\n    or (InitiatingProcessFileName =~ \"firefox.exe\")\r\n    or (InitiatingProcessFileName =~ \"brave.exe\")\r\n| where FolderPath has \"Downloads\"\r\n| project Timestamp, DeviceName, InitiatingProcessFileName, FileName, FolderPath, FileOriginUrl, FileOriginReferrerUrl"
query_type: kql
severity: medium
tactics:
    - TA0009
    - TA0001
    - TA0002
techniques:
    - T1074
    - T1566
    - T1204
    - T1204.001
tags:
    - kql
author: LindenSec
version: "1"
