id: 8178368a-688f-4a59-baee-9cff8c517326
name: Hunting Zloader DNS Tunneling
description: 'KQL Query from file: Hunting Zloader DNS Tunneling'
query: |
    // Hunting Zloader DNS Tunneling
    // https://www.zscaler.com/blogs/security-research/inside-zloader-s-latest-trick-dns-tunneling

    DeviceNetworkEvents
    | where TimeGenerated > ago(90d)
    | where ActionType == "DnsConnectionInspected"
    | where AdditionalFields.query contains "bigdealcenter.world" or AdditionalFields.query contains "unitedcommunity.world" or AdditionalFields.query contains "ns1.brownswer.com"
query_type: kql
tactics:
    - TA0043
    - TA0011
techniques:
    - T1590.002
    - T1071.004
    - T1572
tags:
    - kql
version: "1"
