id: 82460b83-2ff0-4d00-a6db-9fed75fbd20b
name: Detect Copilot Plugin Installation
description: 'KQL Query from file: Detect Copilot Plugin Installation'
query: |
    //Detect Copilot Plugin Installation
    //https://www.linkedin.com/feed/update/urn:li:activity:7176504602702356481/

    CloudAppEvents
    | where ActionType == "AppInstalled"
    | extend AppName = tostring(RawEventData.AddOnName)
    | summarize by AppName , AccountType, AccountDisplayName
    | sort by AppName asc

    // MITRE ATT&CK Mapping

    //The query focuses on detecting application installations, which can be associated with the following MITRE ATT&CK techniques:

    // T1078: Valid Accounts - Adversaries may use valid accounts to install applications as part of their operations.
    // T1136: Create Account - Creating new accounts might be part of the process when installing certain applications.
    // T1087: Account Discovery - Adversaries may enumerate accounts to understand which ones have the necessary permissions to install applications.
    // T1203: Exploitation for Client Execution - Exploiting vulnerabilities to install applications.
query_type: kql
tactics:
    - TA0005
    - TA0003
    - TA0004
    - TA0001
    - TA0007
    - TA0002
    - TA0006
techniques:
    - T1078
    - T1136
    - T1087
    - T1203
    - T1546.011
    - T1505.006
    - T1059.009
    - T1522
tags:
    - kql
version: "1"
