id: 869cdbd1-9555-4be4-81fd-7f7a7654a585
name: T1027.017 Detection of Sender Domains Engaging in SVG Smuggling
description: ' '
query: "EmailAttachmentInfo\r\n| where TimeGenerated > ago(1h)\r\n| where FileName matches regex \"\\\\b\\\\w+\\\\.(jpg|jpeg|png|gif|bmp|webp|tiff|ico|pdf|doc|docx|xls|xlsx|ppt|pptx|txt|csv|mp3|mp4|avi|mov|mkv|zip|rar|7z|tar|gz)\\\\.svg\\\\b\"\r\n| where isempty(ThreatTypes)\r\n| join EmailEvents on NetworkMessageId\r\n| where DeliveryAction != \"Blocked\"\r\n| distinct SenderFromDomain"
query_type: kql
severity: medium
techniques:
    - T1027.017
tags:
    - kql
author: Steven Lim
version: "1"
