id: 8ae3db39-f37b-4ddf-927e-0dbe57e467ca
name: AI Browsers Can Be Tricked by PromptFix Exploit to Run Malicious Hidden Prompts
description: A new prompt injection technique called PromptFix that tricks a generative artificial intelligence (GenAI) model into carrying out intended actions by embedding the malicious instruction inside a fake CAPTCHA check on a web page.
query: "DeviceProcessEvents\r\n| where InitiatingProcessFileName has_any (\"opera_neon.exe\",\r\n    \"arc.exe\",\r\n    \"sigmaos.exe\",\r\n    \"comet.exe\",\r\n    \"wavebox.exe\",\r\n    \"orion.exe\"\r\n    \"lovable\")\r\n| where ProcessCommandLine contains \"#\"\r\n| where FileName in~ (\r\n    \"bitsadmin.exe\",  \r\n    \"certutil.exe\",  \r\n    \"cmd.exe\",\r\n    \"mshta.exe\",  \r\n    \"powershell.exe\",  \r\n    \"pwsh.exe\",  \r\n    \"regsvr32.exe\"\r\n)\r\n| project\r\n    Timestamp,\r\n    DeviceName,\r\n    FileName,\r\n    ProcessCommandLine,\r\n    InitiatingProcessFileName,\r\n    InitiatingProcessCommandLine"
query_type: kql
severity: medium
tactics:
    - TA0002
tags:
    - AI Browser
    - PromptFix
    - New Attack technique
    - kql
author: Vikas Khandelwal
version: "1"
references:
    - https://thehackernews.com/2025/08/experts-find-ai-browsers-can-be-tricked.html
