id: 8bd63dbf-4156-4f65-a642-84a27840753e
name: Google AMP Phishing
description: This detection looks for emails which include URLs with ‘amp/s’. This is an indicator of Google AMP Phishing which uses legitimate Google domains to redirect to the malicious URLs. When detected this is a high confident sign of phishing.
query: "EmailEvents\r\n| where TimeGenerated > ago(30d)\r\n| join kind=inner (\r\n    EmailUrlInfo\r\n)\r\non NetworkMessageId\r\n| where Url has \"amp/s\"\r\n| summarize arg_max(TimeGenerated, *) by NetworkMessageId\r\n| project TimeGenerated, SenderFromAddress, RecipientEmailAddress, Subject, Url, UrlDomain, NetworkMessageId"
query_type: kql
severity: medium
tactics:
    - TA0001
techniques:
    - T1566.002
tags:
    - kql
version: "1"
