id: 94f4283a-a87a-4c39-aa56-b1fbb51c8eb9
name: Detecting Zero-Day CVE-2025-21333 Privilege Escalation
description: KQL Query
query: |+
    // Detecting Zero-Day CVE-2025-21333 Privilege Escalation

    // https://securityonline.info/windows-hyper-v-zero-day-cve-2025-21333-poc-drops-system-access-exposed/
    // https://github.com/MrAle98/CVE-2025-21333-POC

    let QueryPeriod = 30d;
    let DetectionPeriod = 1h;
    let HyperVEnabledEndpoint =
    DeviceProcessEvents
    | where Timestamp > ago(QueryPeriod)
    | where FileName == "WindowsSandboxServer.exe"
    | distinct DeviceId;
    let VulnerableEndpoint =
    DeviceTvmSoftwareVulnerabilities
    | where CveId == "CVE-2025-21333"
    | distinct DeviceId;
    let NewExePOCCreation =
    DeviceFileEvents
    | where Timestamp > ago(DetectionPeriod)
    | where ActionType == "FileCreated"
    | where FileName endswith ".exe"
    | distinct FileName;
    DeviceEvents
    | where Timestamp > ago(DetectionPeriod)
    | where ActionType == "ProcessPrimaryTokenModified"
    | where FileName has_any(NewExePOCCreation)
    | where DeviceId has_any(HyperVEnabledEndpoint) and DeviceId has_any(VulnerableEndpoint)

query_type: kql
tactics:
    - TA0004
techniques:
    - T1068
tags:
    - kql
version: "1"
