id: 953d6d16-ff1f-4150-89a5-def892bad068
name: '[PU] - Detecting Onmicrosoft Domains Impacted By Email Exchange Restrictions With External Domains'
description: |-
    Microsoft has announced new restrictions on email sending for organizations that use the default onmicrosoft domains.
    A throttling system will be enforced, limiting external email delivery to a maximum of 100 recipients per organization every 24 hours. To summarize:

    1. Microsoft limits onmicrosoft.com domains to 100 external emails daily.
    2. Targets cybercriminals exploiting new tenants, protecting shared domain reputation.
    3. Organizations must purchase custom domains, rollout phases through June 2026.

    The following KQL Query shows the number of distinct external domains where your onmicosoft.com domain, has been sending emails during a day. Could be that you don't detect 100 domains x day but in any case, I would recommend to start to purchase / configure your own domains instead of use the mentioned one.
query: |-
    EmailEvents
    | where SenderFromDomain endswith "onmicrosoft.com"
    | extend Date_F = format_datetime(Timestamp, "yyyy-MM-dd")
    | summarize make_set(RecipientDomain), Total_External_Domains=dcount(RecipientDomain) by SenderFromDomain,Date_F
    | order by Total_External_Domains
query_type: kql
severity: medium
tags:
    - SergioAlbea
    - KQL
    - Exchange
author: Sergio Albea
version: "1"
references:
    - https://techcommunity.microsoft.com/blog/exchange/limiting-onmicrosoft-domain-usage-for-sending-emails/4446167
