id: 95966496-3368-4bb1-bd23-eec645b085d5
name: '''Hello-World'' user agent attempting scraping activity on ports 80-85'
description: This has been observed scraping activity recently targeting US and UK entities from Taiwan and other nations.
query: CommonSecurityLog | where (HttpUserAgentOriginal =~ @'Hello-World/1.0' and RequestMethod =~ @'GET' and dest_port in (80, 81, 82, 83, 84, 85) and source_ip != '192.168.1.0/24')
query_type: kql
severity: medium
tags:
    - kql
version: "1"
references:
    - https://www.greynoise.io/blog/new-scraper-botnet-concentrated-in-taiwan
    - https://viz.greynoise.io/tags/hello-world-scraper-botnet?days=90
