id: 962257e9-577b-4407-ac77-79e38aa1c453
name: Detect Entra Token Request via BOF File (IOC based)
description: This might be one of the silliest detections I have created. But since there is a Beacon Object File out there which can be used to directly request Entra ID access tokens from an active beacon on a device using a specific User Agent, we can easily detect this beacon file by flagging the funny user agent and / or scope identifier that is used.
query: "AADNonInteractiveUserSignInLogs\n| where TimeGenerated > ago(5m)\n| where UserAgent contains \"ur mum\" \n| where ResourceIdentity == \"797f4846-ba00-4fd7-ba43-dac1f8f63013\""
query_type: kql
severity: medium
tactics:
    - TA0006
    - TA0002
techniques:
    - T1606
    - T1651
author: Robbe Van den Daele
version: "1"
references:
    - https://github.com/trustedsec/CS-Remote-OPs-BOF/blob/12850f1d9306ccdec21f2b4e9dd16f78b0b949a9/src/Remote/get_azure_token/entry.c#L260
