id: 9740d888-59b0-4d63-bb2e-bba0e336108b
name: Win-DDoS DefenderXDR Detection
description: ' '
query: "DeviceNetworkEvents\r\n| where TimeGenerated > ago(1h)\r\n| where ActionType == \"DnsConnectionInspected\"\r\n| where parse_json(AdditionalFields)[\"direction\"] == \"Out\" \r\nand parse_json(AdditionalFields)[\"query\"] has \"_ldap\"\r\n| where Protocol == \"Tcp\" and not (ipv4_is_private(RemoteIP))"
query_type: kql
severity: medium
techniques:
    - T1498
tags:
    - kql
author: Steven Lim
version: "1"
references:
    - https://www.safebreach.com/blog/win-dos-epidemic-abusing-rpc-for-dos-and-ddos/
