id: 9aeb569b-8d4a-46d3-83c4-7734d78ddf0a
name: CloudApp Suspicious Copilot Agent Detection
description: 'KQL Query from file: CloudApp Suspicious Copilot Agent Detection'
query: |
    // CloudApp Suspicious Copilot Agent Detection

    CloudAppEvents
    | where Timestamp > ago(1h)
    | where Application == @"Microsoft 365"
    | where ActionType in ("BotCreate", "BotUpdateOperation-BotPublish")
    | where UncommonForUser has "ISP" or UncommonForUser has "CountryCode"

    // MITRE ATT&CK
query_type: kql
tactics:
    - TA0003
    - TA0005
techniques:
    - T1137
    - T1562.008
tags:
    - kql
version: "1"
