id: 9b9c1773-d62b-4879-ba98-2a96049fe057
name: Suspected ClickFix commands in RunMRU registry key value
description: In a ClickFix exploit, a command is silently copied to the clipboard when visiting a compromised web page. The user then pastes it into Windows Run believing it's a captcha or a system fix. The executed command is added to the RunMRU registry key which holds details of Windows Run Most Recently Used. This hunt is intended to identify ClickFix exploits by searching the RunMRU registry key value.
query: "DeviceRegistryEvents\r\n| where RegistryKey contains \"RunMRU\"\r\n| where RegistryValueData contains \"mshta\"\r\n| where RegistryValueData contains \"http\" or RegistryValueData contains \"#\"\r\n| project Timestamp, DeviceName, RegistryValueData, RegistryValueName, ActionType, InitiatingProcessCommandLine"
query_type: kql
severity: medium
techniques:
    - T1218.005
    - T1204
tags:
    - clickfix
    - kql
author: Salten Fisk
version: "1"
references:
    - https://www.reliaquest.com/blog/using-captcha-for-compromise/
    - https://redcanary.com/threat-detection-report/techniques/mshta/
