id: 9c9fadef-10b0-4e2d-9ba3-05e0d4b35aaa
name: MFA Authentication Method Change Detection
description: This rule detects changes to user multi-factor authentication (MFA) methods within an organization. It identifies when MFA methods are added, removed, or when the default MFA method is changed. This helps audit MFA configuration changes, detect unauthorized or suspicious modifications to authentication methods, support incident response by identifying the actor and timestamp of the change, and ensure compliance with security policies requiring strong authentication.
query: "## \U0001F50D KQL Description\n#### This query is used to:\n#### 1.Audit MFA configuration changes across the organization.\n#### 2.Detect unauthorized or suspicious changes to authentication methods.\n#### 3.Support incident response by identifying who made the change and when.\n#### 4.Ensure compliance with security policies requiring strong authentication.\n## \U0001F9E9 MITRE ATT&CK Mapping\n#### Tactic:Persistence / Defense Evasion\n#### Goal: Adversaries may alter authentication methods to maintain access or avoid detection.\n#### Technique: Modify Authentication Process (T1556.006 - Modify Authentication Process: MFA)\n#### Attackers may change or remove MFA methods to weaken account security or ensure persistent access.\n### Query:\n```KQL\nlet AuthenticationMethods = dynamic([\"TwoWayVoiceMobile\",\"TwoWaySms\",\"TwoWayVoiceOffice\",\"TwoWayVoiceOtherMobile\",\"TwoWaySmsOtherMobile\",\"OneWaySms\",\"PhoneAppNotification\",\"PhoneAppOTP\"]);\nlet AuthenticationMethodChanges = AuditLogs\n| where OperationName == \"Update user\" and TargetResources contains \"StrongAuthenticationMethod\"\n| extend Target = tostring(TargetResources[0].userPrincipalName)\n| extend Actor = case(isempty(parse_json(InitiatedBy.user).userPrincipalName),tostring(parse_json(InitiatedBy.app).displayName) ,tostring(parse_json(InitiatedBy.user).userPrincipalName))\n| mvexpand ModifiedProperties = parse_json(TargetResources[0].modifiedProperties)\n| where ModifiedProperties.displayName ==  \"StrongAuthenticationMethod\"\n| project TimeGenerated,Actor,Target,TargetResources,ModifiedProperties,Id;\nlet OldValues = AuthenticationMethodChanges\n| extend OldValue = parse_json(tostring(ModifiedProperties.oldValue))\n| mv-apply OldValue on (extend Old_MethodType=tostring(OldValue.MethodType),Old_Default=tostring(OldValue.Default) | sort by Old_MethodType);\nlet NewValues = AuthenticationMethodChanges\n| extend NewValue = parse_json(tostring(ModifiedProperties.newValue))\n| mv-apply NewValue on (extend New_MethodType=tostring(NewValue.MethodType),New_Default=tostring(NewValue.Default) | sort by New_MethodType);\nlet RemovedMethods = AuthenticationMethodChanges\n| join kind=inner OldValues on Id\n| join kind=leftouter  NewValues  on Id,$left.Old_MethodType==$right.New_MethodType\n| project TimeGenerated,Id,ModifiedProperties,Actor,Target,Old_MethodType,New_MethodType\n| where Old_MethodType != New_MethodType\n| extend Action = strcat(\"Removed (\" , AuthenticationMethods[toint(Old_MethodType)], \") from Authentication Methods.\")\n| extend ChangedValue = \"Method Removed\";\nlet AddedMethods = AuthenticationMethodChanges\n| join kind=inner NewValues on Id\n| join kind=leftouter  OldValues  on Id,$left.New_MethodType==$right.Old_MethodType\n| project TimeGenerated,Id,ModifiedProperties,Actor,Target,Old_MethodType,New_MethodType\n| where Old_MethodType != New_MethodType\n| extend Action = strcat(\"Added (\" , AuthenticationMethods[toint(New_MethodType)], \") as Authentication Method.\") \n| extend ChangedValue = \"Method Added\";\nlet DefaultMethodChanges = AuthenticationMethodChanges\n| join kind=inner OldValues on Id\n| join kind=inner NewValues on Id\n| where Old_Default != New_Default and Old_MethodType == New_MethodType and New_Default == \"true\"\n| join kind=inner OldValues on Id | where Old_Default1 == \"true\" and Old_MethodType1 != New_MethodType | extend Old_MethodType = Old_MethodType1\n| extend Action = strcat(\"Default Authentication Method was changed to (\" , AuthenticationMethods[toint(New_MethodType)], \").\")\n| extend ChangedValue = \"Default Method\";\nunion RemovedMethods,AddedMethods,DefaultMethodChanges\n| project TimeGenerated,Action,Actor,Target,ChangedValue,OldValue=case(isempty(Old_MethodType), \"\",strcat(Old_MethodType,\": \", AuthenticationMethods[toint(Old_MethodType)])),NewValue=case(isempty( New_MethodType),\"\", strcat(New_MethodType,\": \", AuthenticationMethods[toint(New_MethodType)]))\n| distinct *\n```\n"
query_type: kql
tactics:
    - TA0003
    - TA0005
    - TA0006
techniques:
    - T1556.006
tags:
    - kql
version: "1"
