id: 9db127ed-d3d0-48b6-b3bd-8486b71d8db4
name: Antivirus Scan Completed
description: This rule detects when an antivirus scan has completed on a device. It extracts the scan type from the additional fields and summarizes the count of completed scans by timestamp, device name, action type, and scan type. This rule can be used to monitor the frequency and types of antivirus scans occurring across an environment.
query: "DeviceEvents\r\n| where ActionType == @\"AntivirusScanCompleted\"\r\n| extend ScanType = parse_json(AdditionalFields)[\"ScanTypeIndex\"]\r\n| summarize count() by Timestamp, DeviceName,ActionType, tostring(ScanType)"
query_type: kql
severity: medium
tags:
    - kql
version: "1"
