id: a0b0b02a-bf7d-4d8e-b257-43dd5296a932
name: '[RW] - Detect Prefetch Deletion Attempt'
description: |-
    A typical technique used by ransomware operators is the deletion of Prefetch files, which track recently executed programs .

    By running commands like 'del C:\Windows\Prefetch\*.pf', attackers attempt to erase forensic traces of tools they’ve used. This behavior is aimed at hindering investigation and slowing down incident response.
query: |-
    DeviceProcessEvents
    | where Timestamp > ago(7d)
    | where ProcessCommandLine has_all ("del", "C:\\Windows\\Prefetch", ".pf")
    | project Timestamp, DeviceName, InitiatingProcessFileName, FileName, ProcessCommandLine, AccountName, ReportId
query_type: kql
severity: medium
tags:
    - Ransomware
    - KQL
    - SergioAlbea
author: Sergio Albea
version: "1"
references:
    - https://medium.com/detect-fyi/identifying-ransomware-final-stage-activities-with-kql-queries-00b3cf0ef31b
