id: a2e2a019-3da3-4076-98b5-3d6edb59f484
name: WinRAR CVE-2025-6218 Detection
description: A KQL query designed to monitor for potential exploitation of CVE-2025-6218—a directory traversal vulnerability in WinRAR—until the affected infrastructure is fully patched and secured.
query: "DeviceFileEvents\r\n| where TimeGenerated > ago(1h)\r\n| where ActionType == \"FileCreated\"\r\n| where InitiatingProcessVersionInfoOriginalFileName == \"WinRAR.exe\"\r\n| where FolderPath has \"\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\""
query_type: kql
severity: medium
tags:
    - kql
author: Steven Lim
version: "1"
references:
    - https://www.bleepingcomputer.com/news/security/winrar-patches-bug-letting-malware-launch-from-extracted-archives/
