id: a73fdba9-6380-476c-8094-2a0d94fbdff1
name: Ransomware Actors Exploit Unpatched SimpleHelp Remote Monitoring and Management to Compromise Utility Billing Software Provider
description: KQL Query
query: "DeviceProcessEvents\r\n| where TimeGenerated > ago(90d)\r\n| where InitiatingProcessVersionInfoProductName has \"simplehelp\"\r\n| summarize arg_max(TimeGenerated, *) by DeviceId\r\n| project  DeviceName, InitiatingProcessVersionInfoProductName, InitiatingProcessVersionInfoProductVersion"
query_type: kql
severity: medium
tags:
    - kql
author: Steven Lim
version: "1"
references:
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-163a
