id: a97444c6-8280-4f73-9feb-fba513fa32c9
name: Hunting Exposed MCP Server
description: 'KQL Query from file: Hunting Exposed MCP Server'
query: "DeviceProcessEvents\r\n| where TimeGenerated > ago(30d)\r\n| where ProcessCommandLine has \"mcp-server\" or InitiatingProcessCommandLine has \"mcp-server\"\r\n| join DeviceInfo on DeviceName\r\n| where isnotempty(PublicIP)\r\n| summarize arg_max(TimeGenerated, *) by DeviceName\r\n| summarize Count=count() by ExposureLevel"
query_type: kql
severity: medium
techniques:
    - T1588.007
tags:
    - kql
version: "1"
references:
    - https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/mcp-security-network-exposed-servers-are-backdoors-to-your-private-data
