id: aa424871-2b58-4188-a2c8-f3675bbf4c42
name: TeamFiltration Detection
description: ' '
query: "CloudAppEvents\r\n| where Timestamp > ago(1h)\r\n| where isnotempty(parse_json(RawEventData)[\"ActorInfoString\"])\r\n| extend ActorInfoString = tostring(parse_json(RawEventData)[\"ActorInfoString\"])\r\n| where UncommonForUser has \"CountryCode\" and UncommonForUser has \"UserAgent\"\r\n| where ActorInfoString has \"Electron\" and ActorInfoString has \"8.5.1\""
query_type: kql
severity: medium
tactics:
    - TA0007
tags:
    - kql
author: Steven Lim
version: "1"
