id: ade98a09-139d-4fad-971a-5bcf14335b56
name: Malware C2 Comms over Azure Blob Metadata
description: 'KQL Query from file: Malware C2 Comms over Azure Blob Metadata'
query: |
    // Detect Malware C2 Comms over Azure Blob Metadata
    // https://security.microsoft.com/threatanalytics3/8d8a9fa0-4408-47be-8a07-7ce3d21eb827/analystreport

    DeviceNetworkEvents
    | where Timestamp > ago(1h)
    | where RemoteUrl has ".blob.core.windows.net"
    | where InitiatingProcessCommandLine has "comp=metadata"
query_type: kql
tactics:
    - TA0010
    - TA0011
techniques:
    - T1041
    - T1102
    - T1071.001
tags:
    - kql
version: "1"
