id: ae00fb0e-8963-4e2c-a426-41befb746ef7
name: Monitoring Copilot Data Exfiltration via Graph API
description: KQL Query
query: |
    // Monitoring Copilot Data Exfiltration via Graph API

    let CopilotGraphExfilCmds = dynamic(["interactionHistory","getAllEnterpriseInteractions"]);
    MicrosoftGraphActivityLogs
    | where TimeGenerated > ago(1h)
    | extend ParseData = parse_url(RequestUri)
    | where ParseData has_any (CopilotGraphExfilCmds)
query_type: kql
tactics:
    - TA0010
    - TA0009
    - TA0002
    - TA0006
techniques:
    - T1567.004
    - T1074
    - T1106
    - T1059.009
    - T1552.007
tags:
    - kql
version: "1"
