id: b26f7e03-84d7-4332-88bf-bf528debf166
name: Detect CVE-2025-27607 (CVSS 8.8)
description: 'KQL Query from file: Detect CVE-2025-27607 (CVSS 8.8)'
query: |
    // CVE-2025-27607 (CVSS 8.8)
    // The ‘python-json-logger’ package has over 43 million downloads per month, making this vulnerability a significant threat to a large number of users.
    // https://securityonline.info/popular-python-logging-library-vulnerable-to-remote-code-execution-cve-2025-27607/#google_vignette

    DeviceProcessEvents
    | where TimeGenerated > ago(90d)
    | where InitiatingProcessCommandLine has "install python-json-logger"
    | summarize arg_max(TimeGenerated, *) by DeviceName
query_type: kql
tactics:
    - TA0002
techniques:
    - T1059.006
tags:
    - kql
version: "1"
