id: b8eb26c9-c32d-4b2a-969f-22b405b9424d
name: Email Threat with URL Click
description: This rule detects email events that have an identified threat name and are associated with a URL click event. This combination suggests a user has clicked on a malicious link delivered via email.
query: "EmailEvents\r\n| where ThreatNames != \"\"\r\n| join UrlClickEvents on NetworkMessageId"
query_type: kql
severity: medium
tactics:
    - TA0001
techniques:
    - T1566
    - T1566.002
tags:
    - kql
version: "1"
