id: bb88e1c8-c1aa-4c04-89da-80d9b768eb20
name: Regsvr32 Execution with Suspicious Parameters
description: Detects execution of regsvr32.exe with command line arguments indicating potential exploitation using remote scripts or controls.
query: "DeviceProcessEvents\n| where FileName =~ \"regsvr32.exe\"\n| where ProcessCommandLine has_any (\"http\", \".ocx\", \".sct\") \n      or ProcessCommandLine matches regex @\".*(http|https)\\:\\/\\/.*\\.sct\"\n| project Timestamp, DeviceName, FileName, ProcessCommandLine, InitiatingProcessFileName, ReportId\n"
query_type: kql
version: "1"
