id: bd836ecb-44dc-4204-ba6e-e01f1914baad
name: ConnectWise Security Incident Disclosure
description: 'KQL Query from file: ConnectWise Security Incident Disclosure'
query: "DeviceProcessEvents\r\n| where TimeGenerated > ago(90d)\r\n| where InitiatingProcessVersionInfoProductName has \"screenconnect\"\r\n| summarize arg_max(TimeGenerated, *) by DeviceId\r\n| where InitiatingProcessVersionInfoProductVersion !contains \"25.3\" and InitiatingProcessVersionInfoProductVersion !contains \"25.2.4\"\r\n| summarize VersionCount=count() by InitiatingProcessVersionInfoProductVersion"
query_type: kql
severity: medium
tags:
    - kql
version: "1"
references:
    - https://www.connectwise.com/company/trust/advisories
