id: bd97e2e0-c70c-40d0-9972-e200b6567304
name: Mail Bomb Attack Visualization
description: 'KQL Query from file: Mail Bomb Attack Visualization'
query: "EmailEvents\r\n| where TimeGenerated > ago(30d)\r\n| where parse_json(tostring(parse_json(DetectionMethods).Spam))[0] == \"Mail bombing\"\r\n| summarize Count=count() by bin(TimeGenerated, 1d)"
query_type: kql
severity: medium
tags:
    - kql
author: Steven Lim
version: "1"
