id: be515743-7439-4207-855f-bb82f9931179
name: .NET Reflection Defense Evasion  (Reflective Code Loading)
description: 'KQL Query from file: .NET Reflection Defense Evasion  (Reflective Code Loading)'
query: "DeviceProcessEvents\r\n| where FileName =~ \"powershell.exe\"\r\n| where ProcessCommandLine contains \"[System.Reflection.Assembly]::Load\" or\r\n        ProcessCommandLine contains \"[Reflection.Assembly]::Load\" or\r\n        ProcessCommandLine contains \".Assembly]::Load\" or\r\n        ProcessCommandLine contains \"[System.IO.MemoryStream]\" or\r\n        ProcessCommandLine contains \"System.Reflection\"\r\n"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1620
tags:
    - kql
author: Kyaw Pyiyt Htet
version: "1"
references:
    - https://www.petergirnus.com/blog/what-is-reflective-code-loading-t1620
