id: c098ee2d-dcdd-41ee-81cd-091b018cc791
name: ROPC Client ID Brute Forcing via MFA Sweep
description: This detection targets suspicious ROPC (Resource Owner Password Credentials) authentication attempts involving brute-forcing of application client IDs, specifically related to the `Invoke-BruteClientIDs` function in MFA Sweep. This function can be used for enumerating gaps in MFA and/or CA policies, in addition to password validation via credential stuffing.
query: "id: \"replacewithnewguid\"\r\nname: ROPC Client ID Brute Forcing via MFA Sweep\r\nversion: 1.0.0\r\nkind: Scheduled\r\ndescription: This detection targets suspicious ROPC (Resource Owner Password Credentials) authentication attempts involving brute-forcing of application client IDs, specifically related to the `Invoke-BruteClientIDs` function in MFA Sweep. This function can be used for enumerating gaps in MFA and/or CA policies, in addition to password validation via credential stuffing.\r\nseverity: Medium\r\nqueryFrequency: 1h\r\nqueryPeriod: 1h\r\ntriggerOperator: gt\r\ntriggerThreshold: 0\r\ntactics:\r\n- CredentialAccess\r\n- Reconnaissance\r\nrelevantTechniques:\r\n- T1110\r\n- T1595\r\nquery: |-\r\n  let ClientIDs = dynamic([\r\n    \"1b730954-1685-4b74-9bfd-dac224a7b894\", // Azure Active Directory PowerShell\r\n    \"1950a258-227b-4e31-a9cf-717495945fc2\", // Microsoft Azure PowerShell\r\n    \"00000002-0000-0ff1-ce00-000000000000\", // Office 365 Exchange Online\r\n    \"00b41c95-dab0-4487-9791-b9d2c32c80f2\", // Office 365 Management\r\n    \"04b07795-8ddb-461a-bbee-02f9e1bf7b46\", // Microsoft Azure CLI\r\n    \"0ec893e0-5785-4de6-99da-4ed124e5296c\", // Office UWP PWA\r\n    \"18fbca16-2224-45f6-85b0-f7bf2b39b3f3\", // Microsoft Docs\r\n    \"1b3c667f-cde3-4090-b60b-3d2abd0117f0\", // Windows Spotlight\r\n    \"1fec8e78-bce4-4aaf-ab1b-5451cc387264\", // Microsoft Teams\r\n    \"22098786-6e16-43cc-a27d-191a01a1e3b5\", // Microsoft To-Do client\r\n    \"268761a2-03f3-40df-8a8b-c3db24145b6b\", // Universal Store Native Client\r\n    \"26a7ee05-5602-4d76-a7ba-eae8b7b67941\", // Windows Search\r\n    \"27922004-5251-4030-b22d-91ecd9a37ea4\", // Outlook Mobile\r\n    \"29d9ed98-a469-4536-ade2-f981bc1d605e\", // Microsoft Authentication Broker\r\n    \"2d7f3606-b07d-41d1-b9d2-0d0c9296a6e8\", // Microsoft Bing Search for Microsoft Edge\r\n    \"4813382a-8fa7-425e-ab75-3b753aab3abb\", // Microsoft Authenticator App\r\n    \"4e291c71-d680-4d0e-9640-0a3358e31177\", // PowerApps\r\n    \"57336123-6e14-4acc-8dcf-287b6088aa28\", // Microsoft Whiteboard Client\r\n    \"57fcbcfa-7cee-4eb1-8b25-12d2030b4ee0\", // Microsoft Flow Mobile PROD-GCCH-CN\r\n    \"60c8bde5-3167-4f92-8fdb-059f6176dc0f\", // Enterprise Roaming and Backup\r\n    \"66375f6b-983f-4c2c-9701-d680650f588f\", // Microsoft Planner\r\n    \"844cca35-0656-46ce-b636-13f48b0eecbd\", // Microsoft Stream Mobile Native\r\n    \"872cd9fa-d31f-45e0-9eab-6e460a02d1f1\", // Visual Studio - Legacy\r\n    \"87749df4-7ccf-48f8-aa87-704bad0e0e16\", // Microsoft Teams - Device Admin Agent\r\n    \"90f610bf-206d-4950-b61d-37fa6fd1b224\", // Aadrm Admin PowerShell\r\n    \"9ba1a5c7-f17a-4de9-a1f1-6178c8d51223\", // Microsoft Intune Company Portal\r\n    \"9bc3ab49-b65d-410a-85ad-de819febfddc\", // Microsoft SharePoint Online Management Shell\r\n    \"a0c73c16-a7e3-4564-9a95-2bdf47383716\", // Microsoft Exchange Online Remote PowerShell\r\n    \"a40d7d7d-59aa-447e-a655-679a4107e548\", // Accounts Control UI\r\n    \"a569458c-7f2b-45cb-bab9-b7dee514d112\", // Yammer iPhone\r\n    \"ab9b8c07-8f02-4f72-87fa-80105867a763\", // OneDrive Sync Engine\r\n    \"af124e86-4e96-495a-b70a-90f90ab96707\", // OneDrive iOS App\r\n    \"b26aadf8-566f-4478-926f-589f601d9c74\", // OneDrive\r\n    \"b90d5b8f-5503-4153-b545-b31cecfaece2\", // AADJ CSP\r\n    \"c0d2a505-13b8-4ae0-aa9e-cddd5eab0b12\", // Microsoft Power BI\r\n    \"c58637bb-e2e1-4312-8a00-04b5ffcd3403\", // SharePoint Online Client Extensibility\r\n    \"cb1056e2-e479-49de-ae31-7812af012ed8\", // Microsoft Azure Active Directory Connect\r\n    \"cf36b471-5b44-428c-9ce7-313bf84528de\", // Microsoft Bing Search\r\n    \"d326c1ce-6cc6-4de2-bebc-4591e5e13ef0\", // SharePoint\r\n    \"d3590ed6-52b3-4102-aeff-aad2292ab01c\", // Microsoft Office\r\n    \"e9b154d0-7658-433b-bb25-6b8e0a8a7c59\", // Outlook Lite\r\n    \"e9c51622-460d-4d3d-952d-966a5b1da34c\", // Microsoft Edge\r\n    \"eb539595-3fe1-474e-9c1d-feb3625d1be5\", // Microsoft Tunnel\r\n    \"ecd6b820-32c2-49b6-98a6-444530e5a77a\", // Microsoft Edge\r\n    \"f05ff7c9-f75a-4acd-a3b5-f4b6a870245d\", // SharePoint Android\r\n    \"f448d7e5-e313-4f90-a3eb-5dbb3277e4b3\", // Media Recording for Dynamics 365 Sales\r\n    \"f44b1140-bc5e-48c6-8dc0-5cf5a53c0e34\", // Microsoft Edge\r\n    \"fb78d390-0c51-40cd-8e17-fdbfab77341b\", // Microsoft Exchange REST API Based PowerShell\r\n    \"fc0f3af4-6835-4174-b806-f7db311fd2f3\", // Microsoft Intune Windows Agent\r\n    \"cab96880-db5b-4e15-90a7-f3f1d62ffe39\", // Microsoft Defender Platform\r\n    \"dd47d17a-3194-4d86-bfd5-c6ae6f5651e3\", // Microsoft Defender for Mobile\r\n    \"d7b530a4-7680-4c23-a8bf-c52c121d2e87\", // Microsoft Edge Enterprise New Tab Page\r\n    \"be1918be-3fe3-4be9-b32b-b542fc27f02e\"  // M365 Compliance Drive Client\r\n  ]);\r\n  let TargetAppDisplayNames = dynamic([\r\n    \"Azure Active Directory PowerShell\",\r\n    \"Microsoft Azure PowerShell\",\r\n    \"Office 365 Exchange Online\",\r\n    \"Office 365 Management\",\r\n    \"Microsoft Azure CLI\",\r\n    \"Office UWP PWA\",\r\n    \"Microsoft Docs\",\r\n    \"Windows Spotlight\",\r\n    \"Microsoft Teams\",\r\n    \"Microsoft To-Do client\",\r\n    \"Universal Store Native Client\",\r\n    \"Windows Search\",\r\n    \"Outlook Mobile\",\r\n    \"Microsoft Authentication Broker\",\r\n    \"Microsoft Bing Search for Microsoft Edge\",\r\n    \"Microsoft Authenticator App\",\r\n    \"PowerApps\",\r\n    \"Microsoft Whiteboard Client\",\r\n    \"Microsoft Flow Mobile PROD-GCCH-CN\",\r\n    \"Enterprise Roaming and Backup\",\r\n    \"Microsoft Planner\",\r\n    \"Microsoft Stream Mobile Native\",\r\n    \"Visual Studio - Legacy\",\r\n    \"Microsoft Teams - Device Admin Agent\",\r\n    \"Aadrm Admin PowerShell\",\r\n    \"Microsoft Intune Company Portal\",\r\n    \"Microsoft SharePoint Online Management Shell\",\r\n    \"Microsoft Exchange Online Remote PowerShell\",\r\n    \"Accounts Control UI\",\r\n    \"Yammer iPhone\",\r\n    \"OneDrive Sync Engine\",\r\n    \"OneDrive iOS App\",\r\n    \"OneDrive\",\r\n    \"AADJ CSP\",\r\n    \"Microsoft Power BI\",\r\n    \"SharePoint Online Client Extensibility\",\r\n    \"Microsoft Azure Active Directory Connect\",\r\n    \"Microsoft Bing Search\",\r\n    \"SharePoint\",\r\n    \"Microsoft Office\",\r\n    \"Outlook Lite\",\r\n    \"Microsoft Edge\",\r\n    \"Microsoft Tunnel\",\r\n    \"SharePoint Android\",\r\n    \"Media Recording for Dynamics 365 Sales\",\r\n    \"Microsoft Exchange REST API Based PowerShell\",\r\n    \"Microsoft Intune Windows Agent\",\r\n    \"Microsoft Defender Platform\",\r\n    \"Microsoft Defender for Mobile\",\r\n    \"Microsoft Edge Enterprise New Tab Page\",\r\n    \"M365 Compliance Drive Client\"\r\n  ]);\r\n  SigninLogs\r\n  | where AppId in (ClientIDs)\r\n  | where AppDisplayName in (TargetAppDisplayNames)\r\n  | where AuthenticationRequirement =~ \"singleFactorAuthentication\" and AuthenticationProtocol =~ \"ropc\"\r\n  | extend \r\n      LocationDetailsString = tostring(LocationDetails),\r\n      DeviceDetailString = tostring(DeviceDetail)\r\n  | summarize \r\n      StartTime = min(TimeGenerated), \r\n      EndTime = max(TimeGenerated), \r\n      AppAttemptCount = count() \r\n      by AppDisplayName, Identity, AlternateSignInName, ResultType, AuthenticationProtocol, \r\n      Location, LocationDetailsString, ConditionalAccessStatus, DeviceDetailString, UserAgent\r\n  | where AppDisplayName has_any (TargetAppDisplayNames) and AppAttemptCount >= 1\r\n  | summarize \r\n      TotalAppCount = dcount(AppDisplayName), // Count the number of distinct flagged apps\r\n      TotalAttempts = sum(AppAttemptCount),  // Calculate the total number of authentication attempts across all monitored apps\r\n      FirstActivity = min(StartTime), \r\n      LastActivity = max(EndTime)\r\n      by Identity, AlternateSignInName, ResultType, AuthenticationProtocol, \r\n      Location, LocationDetailsString, ConditionalAccessStatus, DeviceDetailString, UserAgent\r\n  | where TotalAppCount >= 30 // Require activity on at least 50% of the 60 monitored apps to reduce false positives\r\n  | project \r\n      Identity, AlternateSignInName, ResultType, AuthenticationProtocol, ConditionalAccessStatus, Location, \r\n      LocationDetailsString, UserAgent, DeviceDetailString, \r\n      FirstActivity, LastActivity, TotalAppCount, TotalAttempts\r\nincidentConfiguration:\r\n  createIncident: true\r\n  groupingConfiguration:\r\n    enabled: false\r\n    groupByAlertDetails: []\r\n    groupByCustomDetails: []\r\n    groupByEntities: []\r\n    lookbackDuration: 2h\r\n    matchingMethod: AllEntities\r\n    reopenClosedIncident: false\r\neventGroupingSettings:\r\n  aggregationKind: SingleAlert\r\nentityMappings:\r\n- entityType: Account\r\n  fieldMappings:\r\n  - columnName: Identity\r\n    identifier: FullName\r\n  - columnName: AlternateSignInName\r\n    identifier: Name\r\nsuppressionDuration: 5h\r\nsuppressionEnabled: false\r\nalertDetailsOverride:\r\n  alertDynamicProperties: []\r\n\r\n"
query_type: kql
severity: Medium
tactics:
    - TA0006
    - TA0043
techniques:
    - T1110
    - T1110.004
    - T1595.002
tags:
    - kql
    - tactic:CredentialAccess
    - tactic:Reconnaissance
    - technique:T1110
    - technique:T1595
author: Anders Kristiansen, Eirik Sveen
version: "1"
references:
    - https://github.com/dafthack/MFASweep/blob/master/MFASweep.ps1#L974
