id: c2bc63f3-e19e-451f-b7b6-d4f487b4919d
name: PowerShell Obfuscation (Non English Chars)
description: This rule detects PowerShell command lines that contain non-English (Unicode) characters, excluding the en-dash character. This behavior is often indicative of obfuscation techniques used by adversaries to evade detection, as legitimate PowerShell commands typically do not contain such characters in their command line arguments.
query: "DeviceProcessEvents \r\n| where FileName =~ \"powershell.exe\"\r\n| extend Chars = extract_all(@\"([\\u{00A1}-\\u{1FFC}]+|[\\u{2039}-\\u{1F448}]+|[\\u{1F450}-\\u{10FFFF}]+)\",ProcessCommandLine)\r\n| where Chars !contains \"–\"\r\n| where not(isnull(Chars))"
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0005
techniques:
    - T1059.001
    - T1027
tags:
    - kql
version: "1"
