id: c52967e1-33d4-4f59-abf5-3519d5770b3b
name: '[RW] - Detect bcedit commands related to boot configuration'
description: This KQL query is designed to detect adversaries attempt to modify the boot configuration using bcdedit commands. Such changes are often used to disable recovery options or suppress error messages after encryption, helping ransomware persist stealthily across reboot.
query: |-
    DeviceProcessEvents
    | where  ProcessCommandLine startswith "bcdedit"
query_type: kql
severity: medium
tags:
    - Ransomware
    - KQL
    - SergioAlbea
author: Sergio Albea
version: "1"
references:
    - https://medium.com/detect-fyi/identifying-ransomware-final-stage-activities-with-kql-queries-00b3cf0ef31b
