id: c7dc1a9f-3883-4c05-869a-b94404826e07
name: SharePoint CVE-2025-53770 Exploitation Attempt
description: Detects potential exploitation attempts of the SharePoint vulnerability CVE-2025-53770 by looking for POST requests to ToolPane.aspx with a specific referrer.
query: "DeviceEvents\r\n| where ActionType == \"InboundWebRequest\"\r\n| where AdditionalFields has \"cs-method\"\r\n      and tostring(parse_json(AdditionalFields)[\"cs-method\"]) == \"POST\"\r\n| where AdditionalFields has \"cs-uri-stem\"\r\n      and tostring(parse_json(AdditionalFields)[\"cs-uri-stem\"]) endswith \"/_layouts/15/ToolPane.aspx\"\r\n| where AdditionalFields has \"cs-referrer\"\r\n      and tostring(parse_json(AdditionalFields)[\"cs-referrer\"]) endswith \"/_layouts/SignOut.aspx\""
query_type: kql
severity: medium
tactics:
    - TA0001
techniques:
    - T1190
tags:
    - This pattern is highly specific to the exploit and legitimate traffic is unlikely to match. However
    - monitor for any custom applications that might exhibit similar behavior.
    - kql
author: smavrakis
version: "1"
references:
    - https://msrc.microsoft.com/blog/2025/07/customer-guidance-for-sharepoint-vulnerability-cve-2025-53770/
