id: ca1cdb8c-79f9-474e-8eb2-d105a02a7967
name: End of Support Software Detection
description: This rule identifies software installed on devices that has reached its End of Support (EOS) version. It provides details such as the device name, software name, vendor, version, EOS status, and EOS date, which is crucial for identifying potential security risks due to unpatched or unsupported software.
query: "DeviceTvmSoftwareInventory\r\n| where EndOfSupportStatus == \"EOS Version\"\r\n| summarize count() by DeviceName, SoftwareName,SoftwareVendor, SoftwareVersion,  EndOfSupportStatus, EndOfSupportDate"
query_type: kql
severity: medium
tactics:
    - TA0007
techniques:
    - T1518
tags:
    - kql
version: "1"
