id: cafefc8c-9c42-4aad-8301-2443ee36d84b
name: Direct Send Abuse Detection
description: 'KQL Query from file: Direct Send Abuse Detection'
query: "DeviceEvents\r\n| where Timestamp > ago(1h)\r\n| where ActionType == \"DnsQueryResponse\"\r\n| extend QueryName = tolower(tostring(parse_json(AdditionalFields)[\"DnsQueryString\"]))\r\n| where QueryName endswith \"-com.mail.protection.outlook.com\""
query_type: kql
severity: medium
tactics:
    - TA0043
    - TA0011
    - TA0001
    - TA0007
techniques:
    - T1590.002
    - T1071.004
    - T1566.001
    - T1566
    - T1087.003
tags:
    - kql
author: Steven Lim
version: "1"
references:
    - https://www.bleepingcomputer.com/news/security/microsoft-365-direct-send-abused-to-send-phishing-as-internal-users/
