id: cb5da836-e905-42e6-a659-754d589ecbc9
name: Process Discovery with PowerShell Get-WmiObject Win32_Process Query
description: |-
    Detects PowerShell commands that use Get-WmiObject to query Win32_Process, specifically looking for process names. This can be indicative of discovery or reconnaissance activities using WMI.

    This activity may indicate that a threat actor is performing process discovery to gather information such as the Process ID, executable path, command-line arguments, and other related data.
query: "DeviceProcessEvents\r\n| where FileName == \"powershell.exe\"\r\n| where ProcessCommandLine has_all ( \"Get-WmiObject\", \"Win32_Process\", \"$_.Name\") and ProcessCommandLine has_any (\"-like\", \"-eq\")\r\n"
query_type: kql
severity: medium
tactics:
    - TA0002
techniques:
    - T1059.001
    - T1047
    - DS0012
    - DS0005
tags:
    - kql
version: "1"
