id: cec361a2-4c68-4cfa-a104-ffd6b31b89e3
name: LOLBAS - Mshta - Suspicious Execution via mshta of Remote Files or for Ingress Tool transfer
description: |
    Identifies execution of the mshta LOLBAS utility with command arguments containing the http/https or ftp keyword, which could indicate that an attacker is executing a remotely hosted malicious file for possible code execution AND/OR attempting to ingress a file. Seen in campaigns like lumma stealer.
query: "DeviceProcessEvents\r\n| where (FolderPath endswith \"\\\\mshta.exe\" or ProcessVersionInfoOriginalFileName contains \"MSHTA.EXE\" or FileName contains \"mshta.exe\") and (ProcessCommandLine contains \"http://\" or ProcessCommandLine contains \"https://\" or ProcessCommandLine contains \"ftp://\")"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1218.005
tags:
    - sigma
    - mshta
author: Xavier
version: "1"
references:
    - https://blog.qualys.com/vulnerabilities-threat-research/2024/10/20/unmasking-lumma-stealer-analyzing-deceptive-tactics-with-fake-captcha
