id: cfe8ab60-7918-4376-9592-8ff49d66447f
name: Detect DeerStealer Delivered via Obfuscated .LNK
description: 'KQL Query from file: Detect DeerStealer Delivered via Obfuscated .LNK'
query: "DeviceEvents\r\n| where Timestamp > ago(1h)\r\n| where tostring(AdditionalFields) contains \"ShellLink\"\r\n| where parse_json(AdditionalFields)[\"ShellLinkShowCommand\"] != 'SW_SHOWNORMAL'\r\n| extend ShellLinkCommandLine = parse_json(AdditionalFields)[\"ShellLinkCommandLine\"]\r\n| extend ShellLinkIconPath = parse_json(AdditionalFields)[\"ShellLinkIconPath\"]\r\n| where ShellLinkCommandLine has \"mshta.exe\"\r\n"
query_type: kql
severity: medium
techniques:
    - T1027
tags:
    - kql
author: Steven Lim
version: "1"
