id: d29e25ab-75cd-44de-9356-6918ddf616bd
name: Low Privileged process spawning elevated process from remote session
description: Low Privileged process spawning elevated process from remote session
query: "DeviceProcessEvents\r\n| where ProcessIntegrityLevel in~ (\"Untrusted\",\"Low\",\"Medium\") and InitiatingProcessIntegrityLevel in~(\"System\",\"high\") and (IsProcessRemoteSession ==\"1\" or IsInitiatingProcessRemoteSession==\"1\")"
query_type: kql
severity: medium
tactics:
    - TA0004
techniques:
    - T1134.001
tags:
    - kql
version: "1"
