id: d4e3097b-2d3b-45f9-bb8a-6dd3dd1e8ac1
name: Unusual DNS Query Volume Detection
description: This rule identifies unusual DNS query volumes by monitoring and counting DNS queries over a set threshold in the past day.
query: |
    #### This query helps see if there is unusual amount of DNS queries.
    #### Query:
    ```KQL
    IdentityQueryEvents
    | where TimeGenerated > ago(1d)
    | where ActionType == "DNS query"
    | summarize queryCount = count()
        by
        QueryTarget,
        bin(TimeGenerated, 1h),
        DeviceName,
        IPAddress,
        Port,
        DestinationDeviceName,
        DestinationIPAddress,
        DestinationPort
    | where queryCount > 100 // Example threshold for unusual volume
    | order by queryCount desc
    | project
        TimeGenerated,
        QueryTarget,
        queryCount,
        DeviceName,
        IPAddress,
        Port,
        DestinationDeviceName,
        DestinationIPAddress,
        DestinationPort
    ```
query_type: kql
version: "1"
