id: d51af898-8a2f-46fa-abd5-090606b73c3d
name: PowerShell-Based Event Log Clearing
description: 'KQL Query from file: PowerShell-Based Event Log Clearing'
query: "DeviceProcessEvents\r\n| where FileName contains \"powershell\"\r\n| where ProcessCommandLine has_all (\"Get-WinEvent\", \"-ListLog\", \"ClearLog\")"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1070.001
tags:
    - kql
author: Thomas Carr
version: "1"
references:
    - https://www.porthas.com/blog/akira-ransomware-in-depth-technical-analysis/
