id: d66a5d40-c9d5-48c1-8b9e-daecde973d25
name: Possible Command and Control via Ngrok Tunneling Service
description: |-
    Ngrok is a legitimate tool that creates secure tunnels to localhost servers through NAT/firewalls, often used by developers.

    Additionally, Ngrok tunnels have been used by Iranian APT groups, among others, to support their operations particularly for Command and Control (C2), data exfiltration, and initial access staging.
query: "DeviceNetworkEvents\r\n| where ActionType == \"ConnectionSuccess\"\r\n| where (RemoteUrl contains 'ngrok-free.app' or\r\n        RemoteUrl contains 'ngrok-free.dev' or\r\n        RemoteUrl contains 'ngrok.app' or\r\n        RemoteUrl contains 'ngrok.dev' or\r\n        RemoteUrl contains 'ngrok.io' or\r\n        RemoteUrl contains 'ngrok-free.pizza' or\r\n        RemoteUrl contains 'ngrok.pizza')\r\n| project TimeGenerated, DeviceName, InitiatingProcessAccountDomain, InitiatingProcessAccountName, InitiatingProcessFolderPath, InitiatingProcessSHA1, RemoteUrl"
query_type: kql
severity: medium
techniques:
    - T1572
    - T1090
    - T1567
tags:
    - kql
author: Kyaw Pyiyt Htet
version: "1"
references:
    - https://ngrok.com/docs/universal-gateway/domains/
