id: d96dae72-a626-48fe-8c4b-26aba52b023b
name: Suspicious JavaScript File Creation in Temp Directory related to onsestart malware
description: "This rule detects the creation of JavaScript files in the `AppData\\Local\\Temp` directory with a specific naming convention that resembles a GUID followed by a short alphanumeric e.g. or string and the '.js' eb2262cf-d737-4d55-9b98-84324ade4763ro.js. \nThis pattern is often used by malicious scripts or droppers that generate temporary files with randomised names to evade detection.\n"
query: "DeviceFileEvents\r\n| where FileName matches regex @\"\\w{7,8}-\\w{4}-\\w{4}-\\w{4}-\\w{12,16}[a-z]{2}\\.js$\"\r\n| where FolderPath has @\"\\AppData\\Local\\Temp\\\"\r\n| project Timestamp, DeviceName, ActionType, FileName, FolderPath, InitiatingProcessFileName"
query_type: kql
severity: medium
tactics:
    - TA0005
techniques:
    - T1027
    - T1036
tags:
    - kql
version: "1"
