id: d9f724c1-355a-4d28-ad11-f3b35d5654bb
name: 'Threat Hunt: Potential Password Spray Attacks'
description: 'KQL Query from file: Threat Hunt: Potential Password Spray Attacks'
query: "DeviceLogonEvents\r\n| where ActionType == \"LogonFailed\" \r\n| summarize FailedLogonCount = count(), \r\n    DistinctAccounts = dcount(AccountName),\r\n    AccountList = make_set(AccountName) \r\n    by DeviceName, RemoteIP, RemoteDeviceName\r\n| where FailedLogonCount > 20 and DistinctAccounts >= 5\r\n| project-rename PotentialPasswordSpray = FailedLogonCount\r\n| extend Timestamp = now(), HostCustomEntity = DeviceName, IPCustomEntity = RemoteIP"
query_type: kql
severity: medium
tactics:
    - TA0006
    - TA0005
    - TA0003
    - TA0004
    - TA0001
techniques:
    - T1110.003
    - T1110.001
    - T1078
    - T1133
tags:
    - kql
author: AwaisM
version: "1"
references:
    - https://attack.mitre.org/techniques/T1110/003/
