id: dcf61d06-964e-42d7-97ee-7c8ffe10846d
name: Hunting Malicious Copilot Agent
description: 'KQL Query from file: Hunting Malicious Copilot Agent'
query: |
    // Hunting Malicious Copilot Agent

    // The "Copilot Agent" was a highlight at the recent Microsoft Ignite event. This AI-powered assistant is designed to help with a variety of tasks, such as answering questions, providing information, assisting with productivity tasks, and engaging in meaningful conversations.

    // Consider a scenario where a user account is compromised, and a threat actor uses this account to create a Copilot Agent on a highly sensitive SharePoint site that the compromised user has access to. The threat actor could then exfiltrate data by accessing the private link created by the Copilot Agent, slowly extracting information as needed by providing the relevant prompts.

    // To address such threats, I have created a KQL detection using Sentinel Behaviour Analytics and Power Platform solutions to monitor any potential malicious Copilot Agent creation.

    let HighRiskUsers =
    BehaviorAnalytics
    | where InvestigationPriority > 0
    | where UsersInsights.BlastRadius == "High"
    | where ActivityType == "LogOn"
    | where ActionType == "ResourceAccess"
    | distinct UserPrincipalName;
    PowerPlatformAdminActivity
    | where EventOriginalType in ("BotCreate", "BotComponentCreate", "BotUpdateOperation-BotPublish")
    | where ActorName has_any(HighRiskUsers)




    // MITRE ATT&CK
query_type: kql
tactics:
    - TA0010
    - TA0009
    - TA0006
    - TA0042
techniques:
    - T1020
    - T1567.004
    - T1074
    - T1213.002
    - T1558.002
    - T1586
    - T1586.003
tags:
    - kql
version: "1"
