id: dd01a242-578f-4721-b6ea-411a51b9e8a1
name: Detecting EXO MS Graph Enumeration Attacks
description: 'KQL Query from file: Detecting EXO MS Graph Enumeration Attacks'
query: "CloudAppEvents\r\n| where Timestamp > ago(1h)\r\n| where Application == @\"Microsoft Exchange Online\"\r\n| where isnotempty(parse_json(RawEventData)[\"ActorInfoString\"])\r\n| extend ActorInfoString = tostring(parse_json(RawEventData)[\"ActorInfoString\"])\r\n| where ActorInfoString has \"MS Graph API Web Client\"\r\n| where UncommonForUser has \"CountryCode\" and UncommonForUser has \"UserAgent\""
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0007
    - TA0043
techniques:
    - T1106
    - T1059.009
    - T1087.003
    - T1590
tags:
    - kql
author: Steven Lim
version: "1"
