id: dd5b1e0a-cfed-434e-b94a-a3709d1217c1
name: Uncovering Fast Flux with Sentinel Threat Intelligence
description: KQL Query
query: |
    // https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-093a

    let FastFlux =
    ThreatIntelIndicators
    | where TimeGenerated > ago(365d)
    | where now() between (ValidFrom .. ValidUntil)
    | where isnotempty(Data.labels)
    | mv-expand Data.labels
    | where Data_labels has "mitre"
    | extend MitreID = parse_json(tostring(Data_labels)).Alias
    | where MitreID == "T1568.001"
    | project ObservableValue;
    DeviceNetworkEvents
    | where TimeGenerated > ago(1h)
    | where ActionType == "DnsConnectionInspected"
    | where AdditionalFields.direction == "Out"
    | where AdditionalFields.query has_any (FastFlux)
query_type: kql
tactics:
    - TA0011
    - TA0043
    - TA0042
    - TA0010
techniques:
    - T1568.001
    - T1590.002
    - T1071.004
    - T1584.002
    - T1041
    - T1048.003
    - T1048.001
tags:
    - kql
version: "1"
