id: ddf1a285-bb89-4e87-8b81-a83bfb5235ad
name: 'Threat Hunt: Suspicious IIS Module Installation via AppCmd'
description: This query identifies suspicious use of appcmd.exe to install IIS native-code modules via command line, excluding legitimate installations initiated by iissetup.exe. It’s useful for spotting potential backdoor deployments like RGDoor or other malicious IIS extensions.
query: "DeviceProcessEvents\r\n| where FileName == \"appcmd.exe\"\r\n| where ProcessCommandLine has_all (\"install\", \"module\")\r\n| where ProcessCommandLine contains \"-name:\"\r\n| where InitiatingProcessFileName != \"iissetup.exe\"\r\n| project Timestamp, DeviceName, InitiatingProcessAccountName, FileName, ProcessCommandLine, InitiatingProcessFileName\r\n"
query_type: kql
severity: medium
techniques:
    - T1505.004
tags:
    - kql
author: AwaisM
version: "1"
