id: df3b2318-e5c7-4d87-82fc-7dad3417b385
name: Potential Data Destruction Activity Detected via Disk Overwrite Commands
description: KQL Query
query: "DeviceProcessEvents\r\n| where FileName =~ \"dd\"\r\n| where ProcessCommandLine has_any (\"/dev/zero\", \"/dev/urandom\")\r\n| where ProcessCommandLine contains \"of=/dev/\"\r\n"
query_type: kql
severity: medium
tactics:
    - TA0040
techniques:
    - T1485
tags:
    - kql
author: Kyaw Pyiyt Htet
version: "1"
