id: dfc6638f-f42f-4982-922c-e7bf0853fd9c
name: Detecting Misconfigured EXO Transport Rules
description: 'KQL Query from file: Detecting Misconfigured EXO Transport Rules'
query: |
    // Detecting Misconfigured EXO Transport Rules

    EmailEvents
    | where EmailDirection == "Inbound"
    | where isnotempty(ThreatClassification)
    | where LatestDeliveryAction == "Delivered"
    | where DeliveryLocation != "Junk folder"
    | summarize Count=count() by tostring(parse_json(AdditionalFields)["TransportRuleGuid"])
query_type: kql
tactics:
    - TA0003
    - TA0009
    - TA0005
techniques:
    - T1505.002
    - T1114
    - T1114.003
    - T1564.008
tags:
    - kql
version: "1"
