id: dff5928e-012d-427f-96de-382b2f860103
name: CrowdStrike npm Packages Supply Chain Attack Shai-Hulud Payload being Dropped
description: 'This rule detects the creation of an executable file (.exe) that is being extracted by an archive where the command line includes ''tar -xzf'' and a ''.tar.gz'' archive. '
query: "DeviceFileEvents\r\n| where InitiatingProcessParentFileName == @\"cmd.exe\"\r\n| where InitiatingProcessCommandLine has_all (\"tar\", \"-xzf\", \".tar.gz\")\r\n| where FileName endswith \".exe\"\r\n| where ActionType == @\"FileCreated\"\r\n"
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0001
techniques:
    - T1059.003
    - T1195
    - T1195.002
tags:
    - kql
version: "1"
references:
    - https://socket.dev/blog/ongoing-supply-chain-attack-targets-crowdstrike-npm-packages?utm_medium=feed
    - https://www.stepsecurity.io/blog/ctrl-tinycolor-and-40-npm-packages-compromised
