id: e17a9ab6-9822-4843-99e0-a8decb6a38b2
name: Suspicious ncrypt.dll Usage with RDP Detected
description: Detects suspicious usage of ncrypt.dll and RDP connections to unmanaged or non-TPM devices, potentially indicating Windows Hello for Business key export.
query: "# *Detect Suspicious ncrypt.dll usage with RDP connections to unmanaged or non TPM protected device*\n\n## Query Information\n\n#### MITRE ATT&CK Technique(s)\n\n| Technique ID | Title    | Link    |\n| ---  | --- | --- |\n| T1555.004 | Credentials from Password Stores: Windows Credential Manager | https://attack.mitre.org/techniques/T1555/004/ |\n| T1606 | Forge Web Credentials | https://attack.mitre.org/techniques/T1606/ |\n| T1021.001 | Remote Services: Remote Desktop Protocol | https://attack.mitre.org/techniques/T1021/001/ |\n\n#### Description\nThis detection rule uses a WDAC audit policy to ingest missing DeviceImageLoad events in MDE, and check for suspicious processes using the ncrypt.dll and devices performing RDP connection to unmanaged or non-TPM devices. More information on the attack scenario this is detection is applicable for can be found in the references.\n\n#### Risk\nBy using this detections, we can try to detect an attacker using the hellopoc.ps1 script in RoadTools to generate an assertion, and export the Windows Hello for Business keys using an RDP session. \n\n#### Author <Optional>\n- **Name:** Robbe Van den Daele\n- **Github:** https://github.com/RobbeVandenDaele\n- **Twitter:** https://x.com/RobbeVdDaele\n- **LinkedIn:** https://www.linkedin.com/in/robbe-van-den-daele-677986190/\n- **Website:** https://hybridbrothers.com/\n\n#### References\n- https://hybridbrothers.com/detecting-non-privileged-windows-hello-abuse/\n- https://github.com/dirkjanm/ROADtools/blob/master/winhello_assertion/hellopoc.ps1\n\n## Defender XDR\n```KQL\nlet cli_tools = dynamic([\"powershell\", \"python\"]);\n// Get suspicious ncrypt.dll usage via WDAC audit policy\nlet time_lookback = 1h;\nlet no_tpm_devices = (\n    ExposureGraphNodes\n    // Get device nodes with their inventory ID\n    | where NodeLabel == \"device\"\n    | mv-expand EntityIds\n    | where EntityIds.type == \"DeviceInventoryId\"\n    // Get interesting properties\n    | extend OnboardingStatus = tostring(parse_json(NodeProperties)[\"rawData\"][\"onboardingStatus\"]),\n        TpmSupported = tostring(parse_json(NodeProperties)[\"rawData\"][\"tpmData\"][\"supported\"]),\n        TpmEnabled = tostring(parse_json(NodeProperties)[\"rawData\"][\"tpmData\"][\"enabled\"]),\n        TpmActivated = tostring(parse_json(NodeProperties)[\"rawData\"][\"tpmData\"][\"activated\"]),\n        DeviceName = tostring(parse_json(NodeProperties)[\"rawData\"][\"deviceName\"]),\n        DeviceId = tostring(EntityIds.id)\n    // Search for distinct devices\n    | distinct DeviceId, DeviceName, OnboardingStatus, TpmSupported, TpmEnabled, TpmActivated\n    // Get Unmanaged devices and device not supporting a TPM\n    | where OnboardingStatus != \"Onboarded\" or (TpmSupported != \"true\" and TpmActivated != \"true\" and TpmEnabled != \"true\")\n    | extend TpmSupported = iff(TpmSupported == \"\", \"unknown\", TpmSupported),\n        TpmActivated = iff(TpmActivated == \"\", \"unknown\", TpmActivated),\n        TpmEnabled = iff(TpmEnabled == \"\", \"unknown\", TpmEnabled)\n);\nlet no_tpm_device_info = (\n    DeviceNetworkInfo\n    | where Timestamp > ago(7d)\n    // Get latest network info for each device ID\n    | summarize arg_max(Timestamp, *) by DeviceId\n    | mv-expand todynamic(IPAddresses)\n    | extend IPAddress = tostring(IPAddresses.IPAddress)\n    // Find no TPM devices and join with their network information\n    | join kind=inner no_tpm_devices on DeviceId\n    | project DeviceId, DeviceName, MacAddress, IPAddress, OnboardingStatus, TpmActivated, TpmEnabled, TpmSupported\n);\nlet dangerous_rdp_sessions = (\n    DeviceNetworkEvents\n    | where Timestamp > ago(time_lookback)\n    // Exclude MDI RDP Connections (known for NNR)\n    | where InitiatingProcessFileName !~ \"microsoft.tri.sensor.exe\"\n    // Search for RDP connections to non-tpm devices\n    | where ActionType == \"ConnectionSuccess\"\n    | where RemotePort == 3389\n    | join kind=inner no_tpm_device_info on $left.RemoteIP == $right.IPAddress\n    | project-rename RemoteDeviceId = DeviceId1, \n        RdpRemoteDeviceName = DeviceName1, \n        RdpRemoteMacAddress = MacAddress, \n        RdpRemoteDeviceOnboardingStatus = OnboardingStatus, \n        RdpRemoteDeviceTpmActivated = TpmActivated, \n        RdpRemoteDeviceTpmEnabled = TpmEnabled, \n        RdpRemoteDeviceTpmSupported = TpmSupported,\n        RdpTimeGenerated = Timestamp,\n        RdpInitiatingProcessFileName = InitiatingProcessFileName\n    | project-away IPAddress\n);\n// Get all possible nonce requests\nlet nonce_requests = (\n    DeviceNetworkEvents\n    | where Timestamp > ago(time_lookback)\n    | where ActionType == \"ConnectionSuccess\"\n    | where RemoteUrl =~ \"login.microsoftonline.com\"\n    | project-rename NonceRequestTimestamp = Timestamp\n);\n// Get suspicious ncrypt.dll usage via WDAC audit policy\nDeviceEvents\n| where Timestamp > ago(time_lookback)\n| where ActionType startswith \"AppControl\" and FileName =~ \"ncrypt.dll\"\n// Check if the same initiating process is doing a nonce request\n| join kind=inner nonce_requests on InitiatingProcessId, DeviceId\n// Only flag when nonce was request 10min before of after ncrypt usage\n| where Timestamp between (todatetime(NonceRequestTimestamp - 10m) .. todatetime(NonceRequestTimestamp + 10m))\n// Check if the same device is doing RDP Connections\n| join kind=inner dangerous_rdp_sessions on DeviceId\n// Whitelist known good processes\n| where InitiatingProcessFileName !in (\"backgroundtaskhost.exe\",\"svchost.exe\")\n// Project interesting columns\n| extend WdacPolicyName = parse_json(AdditionalFields)[\"PolicyName\"]\n| project Timestamp, DeviceName, ActionType, FileName, InitiatingProcessSHA1, InitiatingProcessFileName, \n    InitiatingProcessId, InitiatingProcessAccountName, InitiatingProcessParentFileName, WdacPolicyName, InitiatingProcessRemoteSessionDeviceName, InitiatingProcessRemoteSessionIP,\n    NonceRequestTimestamp, RdpTimeGenerated, RdpInitiatingProcessFileName, RdpRemoteDeviceName, RdpRemoteMacAddress, RdpRemoteDeviceOnboardingStatus,\n    RdpRemoteDeviceTpmActivated, RdpRemoteDeviceTpmEnabled, RdpRemoteDeviceTpmSupported\n```\n\n## Sentinel\n```KQL\nlet time_lookback = 1h;\nlet no_tpm_devices = (\n    ExposureGraphNodes\n    // Get device nodes with their inventory ID\n    | where NodeLabel == \"device\"\n    | mv-expand EntityIds\n    | where EntityIds.type == \"DeviceInventoryId\"\n    // Get interesting properties\n    | extend OnboardingStatus = tostring(parse_json(NodeProperties)[\"rawData\"][\"onboardingStatus\"]),\n        TpmSupported = tostring(parse_json(NodeProperties)[\"rawData\"][\"tpmData\"][\"supported\"]),\n        TpmEnabled = tostring(parse_json(NodeProperties)[\"rawData\"][\"tpmData\"][\"enabled\"]),\n        TpmActivated = tostring(parse_json(NodeProperties)[\"rawData\"][\"tpmData\"][\"activated\"]),\n        DeviceName = tostring(parse_json(NodeProperties)[\"rawData\"][\"deviceName\"]),\n        DeviceId = tostring(EntityIds.id)\n    // Search for distinct devices\n    | distinct DeviceId, DeviceName, OnboardingStatus, TpmSupported, TpmEnabled, TpmActivated\n    // Get Unmanaged devices and device not supporting a TPM\n    | where OnboardingStatus != \"Onboarded\" or (TpmSupported != \"true\" and TpmActivated != \"true\" and TpmEnabled != \"true\")\n    | extend TpmSupported = iff(TpmSupported == \"\", \"unknown\", TpmSupported),\n        TpmActivated = iff(TpmActivated == \"\", \"unknown\", TpmActivated),\n        TpmEnabled = iff(TpmEnabled == \"\", \"unknown\", TpmEnabled)\n);\nlet no_tpm_device_info = (\n    DeviceNetworkInfo\n    | where TimeGenerated > ago(7d)\n    // Get latest network info for each device ID\n    | summarize arg_max(TimeGenerated, *) by DeviceId\n    | mv-expand todynamic(IPAddresses)\n    | extend IPAddress = tostring(IPAddresses.IPAddress)\n    // Find no TPM devices and join with their network information\n    | join kind=inner no_tpm_devices on DeviceId\n    | project DeviceId, DeviceName, MacAddress, IPAddress, OnboardingStatus, TpmActivated, TpmEnabled, TpmSupported\n);\nlet dangerous_rdp_sessions = (\n    DeviceNetworkEvents\n    | where TimeGenerated > ago(time_lookback)\n    // Exclude MDI RDP Connections (known for NNR)\n    | where InitiatingProcessFileName !~ \"microsoft.tri.sensor.exe\"\n    // Search for RDP connections to non-tpm devices\n    | where ActionType == \"ConnectionSuccess\"\n    | where RemotePort == 3389\n    | join kind=inner no_tpm_device_info on $left.RemoteIP == $right.IPAddress\n    | project-rename RemoteDeviceId = DeviceId1, \n        RdpRemoteDeviceName = DeviceName1, \n        RdpRemoteMacAddress = MacAddress, \n        RdpRemoteDeviceOnboardingStatus = OnboardingStatus, \n        RdpRemoteDeviceTpmActivated = TpmActivated, \n        RdpRemoteDeviceTpmEnabled = TpmEnabled, \n        RdpRemoteDeviceTpmSupported = TpmSupported,\n        RdpTimeGenerated = Timestamp,\n        RdpInitiatingProcessFileName = InitiatingProcessFileName\n    | project-away IPAddress\n);\n// Get all possible nonce requests\nlet nonce_requests = (\n    DeviceNetworkEvents\n    | where TimeGenerated > ago(time_lookback)\n    | where ActionType == \"ConnectionSuccess\"\n    | where RemoteUrl =~ \"login.microsoftonline.com\"\n    | project-rename NonceRequestTimestamp = TimeGenerated\n);\n// Get suspicious ncrypt.dll usage via WDAC audit policy\nDeviceEvents\n| where TimeGenerated > ago(time_lookback)\n| where ActionType startswith \"AppControl\" and FileName =~ \"ncrypt.dll\"\n// Check if the same initiating process is doing a nonce request\n| join kind=inner nonce_requests on InitiatingProcessId, DeviceId\n// Only flag when nonce was request 10min before of after ncrypt usage\n| where TimeGenerated between (todatetime(NonceRequestTimestamp - 10m) .. todatetime(NonceRequestTimestamp + 10m))\n// Check if the same device is doing RDP Connections\n| join kind=inner dangerous_rdp_sessions on DeviceId\n// Whitelist known good processes\n| where InitiatingProcessFileName !in (\"backgroundtaskhost.exe\",\"svchost.exe\")\n// Project interesting columns\n| extend WdacPolicyName = parse_json(AdditionalFields)[\"PolicyName\"]\n| project TimeGenerated, DeviceName, ActionType, FileName, InitiatingProcessSHA1, InitiatingProcessFileName, \n    InitiatingProcessId, InitiatingProcessAccountName, InitiatingProcessParentFileName, WdacPolicyName, InitiatingProcessRemoteSessionDeviceName, InitiatingProcessRemoteSessionIP,\n    NonceRequestTimestamp, RdpTimeGenerated, RdpInitiatingProcessFileName, RdpRemoteDeviceName, RdpRemoteMacAddress, RdpRemoteDeviceOnboardingStatus,\n    RdpRemoteDeviceTpmActivated, RdpRemoteDeviceTpmEnabled, RdpRemoteDeviceTpmSupported\n```"
query_type: kql
version: "1"
