id: e2588beb-cd0b-424b-9f81-83bd9c121d51
name: 'Attempt To Flush Shimcache '
description: Shimcache flushing refers to the deliberate clearing or manipulation of the Application Compatibility Cache on a Windows system, which stores metadata about executables that have been run. This cache is valuable for forensic investigations because it provides evidence of program execution, even if the original binary has been deleted. Flushing shimcache could be considered suspicious because it is rarely performed during normal system operations and is often used by attackers to hide their tracks. By wiping this artifact, threat actors attempt to prevent incident responders from identifying which tools or malware were executed on the compromised system. This behavior is typically associated with anti-forensic techniques used by advanced persistent threats, malware, or red team operators.
query: "DeviceProcessEvents\r\n| where FileName =~ \"rundll32.exe\"\r\n| where (ProcessCommandLine has_any (\"ShimFlushCache\",@\"#250\",\"BaseFlushAppcompatCache\",@\"#46\"))\r\n\r\n"
query_type: kql
severity: medium
techniques:
    - T1112
tags:
    - kql
author: Vaasudev Kala
version: "1"
references:
    - https://blueteamops.medium.com/shimcache-flush-89daff28d15e
