id: e693656d-5d1d-49c6-803a-2cfa7e5c9aa2
name: Detection of LegionLoader - Decryption Attempt of drata.dat via 7-Zip in Traiolx Directory
description: This detection monitors the execution of 7zG.exe—the 7-Zip GUI executable—specifically when launched from the Traiolx Custom Utils or Kilo Verfair Tools directory under the user’s Roaming profile (\\AppData\\Roaming\\Traiolx Custom Utils). It identifies suspicious command-line activity where 7zG.exe is used to decrypt or extract a file named drata.dat, used to load second payload.
query: "DeviceProcessEvents\r\n| where FileName =~ \"7zG.exe\" or ProcessVersionInfoCompanyName has \"Igor Pavlov\"\r\n| where ProcessCommandLine has_any (\"Traiolx Custom Utils\", \"Kilo Verfair Tools\")\r\n| project Timestamp, DeviceName, ActionType, FileName, FolderPath, ProcessCommandLine"
query_type: kql
severity: medium
techniques:
    - T1218
    - T1027
    - T1059.003
tags:
    - LegionLoader
    - kql
author: Riordz
version: "1"
references:
    - https://x.com/Ryan_Riordz/status/1933619810362937830
