id: e69dc3a5-a5ab-4925-959d-e1d44a213d4d
name: UNIT42 - Abuse Microsoft OneNote files on the rise
description: KQL Query
query: |
    // UNIT42 - Abuse Microsoft OneNote files on the rise
    // https://www.linkedin.com/posts/activity-7199081015439495168-zjvc/

    // Analyzing onenote files sent into your tenant as email attachment.

    EmailAttachmentInfo
    | where TimeGenerated > ago(90d)
    | where FileType=="one;onenote"
    | join EmailEvents on NetworkMessageId

    // MITRE ATT&CK Mapping

    // T1566.001 - Phishing: Spearphishing Attachment:
    // This technique involves adversaries sending emails with malicious attachments to gain access to victim systems. Your query filters for specific file types in email attachments, which can be used to detect spearphishing attempts.
    // T1071.003 - Application Layer Protocol: Mail Protocols:
    // This technique involves using email protocols for command and control. By joining email events, your query can help identify suspicious email activities that might be part of a command and control operation.
    // T1114.002 - Email Collection: Remote Email Collection:
    // This technique involves adversaries collecting emails from remote servers. Your query can help detect unusual email attachment activities that might indicate email collection efforts.
query_type: kql
tactics:
    - TA0001
    - TA0011
    - TA0009
    - TA0042
    - TA0043
techniques:
    - T1566.001
    - T1071.003
    - T1114.002
    - T1586.002
    - T1114
    - T1566
    - T1598
    - T1566.002
    - T1071
tags:
    - kql
version: "1"
