id: e6e53401-21a9-41cc-97d5-0d6f899295ec
name: WMI execution from remote system
description: Hunting WMI execution from remote system
query: "DeviceEvents\r\n| where ActionType == \"RemoteWmiOperation\" and (IsProcessRemoteSession ==\"1\" or IsInitiatingProcessRemoteSession==\"1\")\r\n| extend Query =  tolower(tostring(parse_json(AdditionalFields)[\"OperationDetails\"]))\r\n| extend OperationType= tolower(tostring(parse_json(AdditionalFields)[\"OperationType\"]))\r\n| extend Namespace = tolower(tostring(parse_json(AdditionalFields)[\"Namespace\"]))\r\n| where OperationType == \"ExecQuery\""
query_type: kql
severity: medium
tactics:
    - TA0002
    - TA0043
    - TA0007
techniques:
    - T1592
    - T1047
    - T1082
tags:
    - kql
version: "1"
