id: e88cecfb-f180-4547-a545-e37e38f45ade
name: Identify emails from potential North Korean remote workers
description: This rule identifies emails originating from sender addresses listed in a GitHub-hosted CSV file, which is explicitly named 'North-Korean-Emails'. The rule's purpose is to flag incoming emails that appear to be sent from individuals or entities associated with North Korea, based on the provided list of email addresses. This could indicate potential phishing, espionage, or other malicious activities originating from North Korean threat actors.
query: |-
    EmailEvents
    | where SenderFromAddress has_any ((externaldata(Email:string)
    [h'https://raw.githubusercontent.com/St1aan/North-Korean-Emails/refs/heads/main/NorthKoreanEmails.csv'] with (format='csv')))

    //Credit to @SttyK for the list
query_type: kql
severity: medium
tactics:
    - TA0001
techniques:
    - T1566
tags:
    - kql
author: Stiaan van der Watt
version: "1"
