id: e891b56f-866d-4dd4-a1bf-177b4ed39970
name: Suspicious WebDav connections
description: 'KQL Query from file: Suspicious WebDav connections'
query: "DeviceProcessEvents\r\n| where ProcessCommandLine has \"DavSetCookie\" or InitiatingProcessCommandLine has \"DavSetCookie\"\r\n| extend Ipaddress=extract(\"http://([^/]+)/\", 1, ProcessCommandLine)\r\n| where not(Ipaddress matches regex @\"^(10\\.([0-9]{1,3}\\.){2}[0-9]{1,3}|172\\.(1[6-9]|2[0-9]|3[01])\\.[0-9]{1,3}\\.[0-9]{1,3}|192\\.168\\.[0-9]{1,3}\\.[0-9]{1,3})$\")\r\n| extend url = split(ProcessCommandLine, \"http://\")[1]\r\n| extend domain = split(url, \"/\")[0]\r\n| extend pathArray = split(url, \"/\")\r\n| extend path = strcat_array(array_slice(pathArray, 1, array_length(pathArray)), \"/\")\r\n| where domain !endswith \".local\" "
query_type: kql
severity: medium
tags:
    - kql
version: "1"
