id: e95eeaff-98b1-4fda-bdf5-3e8780cbc3e4
name: Detect Azure RBAC Elevate Access
description: Detects when a Global Administrator elevates access to all subscriptions and management groups in a tenant. When a Global Administrator elevates access they are assigned the User Access Administrator role at root scope. This Sentinel analytics rule monitors who has elevated access in your tenant so that admins can take appropriate action.
query: "AuditLogs\r\n| where Category == \"AzureRBACRoleManagementElevateAccess\"\r\n| where ActivityDisplayName == \"User has elevated their access to User Access Administrator for their Azure Resources\"\r\n| extend Actor = tostring(InitiatedBy.user.userPrincipalName)\r\n| extend IPAddress = tostring(InitiatedBy.user.ipAddress)\r\n| project TimeGenerated, Actor, ActivityDisplayName, IPAddress, LoggedByService"
query_type: kql
severity: medium
tactics:
    - TA0005
    - TA0003
    - TA0004
    - TA0001
techniques:
    - T1078
tags:
    - kql
author: Andre Zeemering
version: "1"
references:
    - https://learn.microsoft.com/en-us/azure/role-based-access-control/elevate-access-global-admin?tabs=azure-portal
