id: ea1a45ea-969f-4c57-94fb-0ccb8aebf258
name: Azure cloud account takeover
description: 'KQL Query from file: Azure cloud account takeover'
query: |
    //Azure cloud account takeover
    //https://www.linkedin.com/feed/update/urn:li:activity:7163049034528481281/

    SigninLogs
    | where TimeGenerated > ago(90d)
    | where UserAgent == "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36"
    | where AppDisplayName == "OfficeHome"

    // MITRE ATT&CK Mapping

    // Based on the KQL query, the following MITRE ATT&CK techniques are relevant:

    // T1078 - Valid Accounts: The query is filtering sign-in logs, which can be used to detect the use of valid accounts, especially if the user agent is unusual or unexpected for the environment1.
    // T1071.001 - Application Layer Protocol: Web Protocols: The specific user agent string indicates web-based access, which falls under the use of web protocols2.
    // T1204.002 - User Execution: Malicious File: If the user agent is associated with a known malicious browser or script, it could indicate an attempt to execute malicious files3.
query_type: kql
tactics:
    - TA0005
    - TA0003
    - TA0004
    - TA0001
    - TA0011
    - TA0002
techniques:
    - T1078
    - T1071.001
    - T1204.002
tags:
    - kql
version: "1"
