id: ec62b415-5366-4353-8ae6-4bd5b6079ed7
name: M365 Copilot Gone Rouge
description: 'KQL Query from file: M365 Copilot Gone Rouge'
query: |
    // https://www.linkedin.com/posts/0x534c_cybersecurity-safelinkprotection-maliciousurl-activity-7325956438965518337-JV3o

    UrlClickEvents
    | where Timestamp > ago(1h)
    | where Workload == "Copilot"
    | where ActionType == "ClickBlocked"
    | project Timestamp, AccountUpn, Url, UrlChain, IPAddress
query_type: kql
tactics:
    - TA0002
    - TA0001
techniques:
    - T1204.001
    - T1204
    - T1566
    - T1566.002
tags:
    - kql
version: "1"
