id: ed55e392-558f-4137-a147-9279d9ccc933
name: US Government GovDelivery system abused to send to phish
description: KQL Query
query: "EmailEvents\r\n| where TimeGenerated > ago(90d)\r\n| where SenderFromDomain =~ \"subscriptions.in.gov\"\r\n| where EmailDirection == \"Inbound\" and DeliveryAction != \"Blocked\"\r\n| where (LatestDeliveryLocation contains \"Inbox\" or LatestDeliveryLocation contains \"premises\") and LatestDeliveryAction == \"Delivered\" or (DeliveryAction has 'Delivered' and EmailAction !has 'Send to quarantine')"
query_type: kql
severity: medium
tags:
    - kql
author: Steven Lim
version: "1"
