id: efd2091a-55e0-480e-a38c-57ce25789c1c
name: Failed Logins to Disabled AD Accounts
description: Identifies multiple failed login attempts to disabled accounts in Active Directory indicating potential unauthorized access attempts.
query: |
    #### Identifies failed attempts to sign in to disabled accounts in Active Directory
    ## MITRE ATT&CK (Initial Access)
    ### T1078- Valid Accounts
    #### Query:
    ```KQL
    IdentityLogonEvents
    | where FailureReason == "AccountDisabled" and LogonType == "Failed logon"
    | summarize FailedAttempts = count() by AccountName, AccountUpn, Application, IPAddress, DeviceName, DestinationDeviceName, DestinationIPAddress, DestinationPort, Protocol, bin(TimeGenerated, 1h)
    | where FailedAttempts >= 5
    | project AccountName, FailedAttempts, TimeGenerated, Application, IPAddress, DeviceName, DestinationDeviceName, DestinationIPAddress, DestinationPort, Protocol
    | sort by TimeGenerated desc
    ```
query_type: kql
version: "1"
