id: f182966b-e2f0-4f13-a901-cf05041fef37
name: Blob URI Unique Domain Count
description: 'KQL Query from file: Blob URI Unique Domain Count'
query: |
    // Blob URI Unique Domain Count

    DeviceFileEvents
    | where TimeGenerated > ago(90d)
    | where FileOriginUrl startswith "blob:https://"
    | extend dURL = trim_start("blob:https", FileOriginUrl)
    | extend dURL2 = strcat("https" , dURL)
    | extend Domain = tostring(parse_url(dURL2).Host)
    | summarize Count=count() by Domain
    | sort by Count desc
query_type: kql
tactics:
    - TA0010
    - TA0009
techniques:
    - T1567.004
    - T1074
    - T1041
tags:
    - kql
version: "1"
