id: f2377f43-e484-4081-8a45-d144e2309e27
name: Lumma Stealer RunMRU Detection
description: Detects suspicious command execution patterns in the RunMRU registry key often associated with Lumma Stealer ClickFix delivery using specific executables and unusual character sets.
query: |-
    // Rule Name: Lumma Stealer - ClickFix RunMRU Execution
    // Description: Detects suspicious command execution patterns in the RunMRU registry key often associated with Lumma Stealer ClickFix delivery.
    // Author: Detections.ai
    // Date: 2025-05-23
    // References: https://www.microsoft.com/en-us/security/blog/2025/05/21/lumma-stealer-breaking-down-the-delivery-techniques-and-capabilities-of-a-prolific-infostealer/
    DeviceRegistryEvents
    | where ActionType =~ "RegistryValueSet"
    | where InitiatingProcessFileName =~ "explorer.exe"
    | where RegistryKey has @"\CurrentVersion\Explorer\RunMRU"
    | where RegistryValueData has "✅"
            or (RegistryValueData has_any ("powershell", "mshta", "curl", "msiexec", "^")
                 and RegistryValueData matches regex "[\u0400-\u04FF\u0370-\u03FF\u0590-\u05FF\u0600-\u06FF\u0E00-\u0E7F\u2C80-\u2CFF\u13A0-\u13FF\u0530-\u058F\u10A0-\u10FF\u0900-\u097F]")
            or (RegistryValueData has "mshta" and RegistryValueName !~ "MRUList" and RegistryValueData !in~ ("mshta.exe\\1", "mshta\\1"))
            or (RegistryValueData has_any ("bitsadmin", "forfiles", "ProxyCommand=") and RegistryValueName !~ "MRUList")
            or ((RegistryValueData startswith "cmd" or RegistryValueData startswith "powershell")
                and (RegistryValueData has_any ("-W Hidden ", " -eC ", "curl", "E:jscript", "ssh", "Invoke-Expression", "UtcNow", "Floor", "DownloadString", "DownloadFile", "FromBase64String",  "System.IO.Compression", "System.IO.MemoryStream", "iex", "Invoke-WebRequest", "iwr", "Get-ADDomainController", "InstallProduct", "-w h", "-X POST", "Invoke-RestMethod", "-NoP -W", ".InVOKe", "-useb", "irm ", "^", "[char]", "[scriptblock]", "-UserAgent", "UseBasicParsing", ".Content")
                  or RegistryValueData matches regex @"[-/–][Ee^]{1,2}[NnCcOoDdEeMmAa^]*\s[A-Za-z0-9+/=]{15,}"))
query_type: kql
severity: medium
techniques:
    - T1197
    - T1105
    - T1059
    - T1218.007
    - T1218.005
    - T1547.001
    - T1059.003
    - T1059.001
    - T1027
version: "1"
