id: f6cbde65-a34b-47bc-866d-bdb7dfd045bc
name: Unauthorized Agentic Access To Entra
description: 'This detection detect non corporate devices running agentic AI programs attempting '
query: "SigninLogs\r\n| where TimeGenerated > ago(1h)\r\n| where Agent.agentType == \"agenticApp\" \r\nor Agent.agentType == \"agenticAppInstance\"\r\n| where DeviceDetail.deviceId == \"\" and ResultType == \"0\""
query_type: kql
severity: medium
techniques:
    - T1588.007
tags:
    - kql
author: Steven Lim
version: "1"
