id: faba40fa-9bc5-4720-b2d1-c0d4fe0e8a25
name: MailItemsAccessed Defense
description: 'KQL Query from file: MailItemsAccessed Defense'
query: |
    // MailItemsAccessed Defense
    // https://www.linkedin.com/posts/0x534c_microsoft365-exchangeonline-defenderxdr-activity-7183335339061620738-ztfq/

    // Simple & effective custom DefenderXDR hourly rule to detect threat actors accessing Exchange mailboxes via MailItemsAccessed log entry and marked user as compromised.

    CloudAppEvents
    | where Timestamp > ago(1h)
    | where IPTags has_any ("Brute force attacker",
    "Password spray attacker", "Malicious", "Tor")
    | where ActionType == "MailItemsAccessed"


    // MITRE ATT&CK Mapping

    // Your KQL query is effectively filtering for events that could indicate various forms of credential access and email collection attacks, which are mapped to the following MITRE ATT&CK techniques:

    // T1110 - Brute Force
    // T1110.003 - Password Spraying
    // T1078 - Valid Accounts
    // T1071 - Application Layer Protocol
    // T1090.003 - Proxy: Multi-hop Proxy
    // T1114 - Email Collection
query_type: kql
tactics:
    - TA0006
    - TA0005
    - TA0003
    - TA0004
    - TA0001
    - TA0011
    - TA0009
techniques:
    - T1110
    - T1110.003
    - T1078
    - T1071
    - T1090.003
    - T1114
tags:
    - kql
version: "1"
