id: fed39347-f17f-4ffe-bccc-e6bdbe9c4fcc
name: Terminal Used for RAR File Manipulation (DeviceProcessEvents)
description: "Vidar is a sophisticated infostealer operating as Malware-as-a-Service (MaaS). Written in C++, it’s designed to harvest a wide range of sensitive data from infected systems and exfiltrate it to attacker controlled infrastructure.\n\n\U0001F9EC Script Inception: PowerShell scripts nested within PowerShell scripts, layered with 2–3 rounds of Base64 encoding.\n\n\U0001F4E6 RAR Payloads: Password protected RAR files downloaded via direct-to-IP HTTP requests over TCP port 80. Passwords are embedded in encoded scripts and passed via command line to a downloaded copy of \"unrar.exe\"."
query: |-
    DeviceProcessEvents
    | where InitiatingProcessIntegrityLevel has "Medium"
    | where InitiatingProcessFileName has_any ("cmd.exe", "powershell.exe", "powershell_ise.exe", "pwsh.exe", "wt.exe", "WindowsTerminal.exe")
    | where ProcessVersionInfoFileDescription has "Command line RAR"
    //Optional filter for password flag
    //| where ProcessCommandLine contains "-p"
query_type: kql
severity: medium
tactics:
    - TA0002
techniques:
    - T1059
tags:
    - '#vidar'
    - kql
author: '@AdairJCollins @ajc'
version: "1"
references:
    - https://www.linkedin.com/pulse/windows-defender-vidar-infostealer-detection-adair-collins-2o3ie/
    - https://tria.ge/250801-wxxvraep6z/behavioral1
    - https://tria.ge/250801-xvdvjatrw7/behavioral1
