id: 019b6df3-6dc0-74b0-9f50-c325dd367f44
name: Potential Exploitation of MongoBleed (CVE-2025-14847)
description: The rule detects potential exploitation attempts by identifying a single source IP that generates a high number of connection events (>= 100) but a very low rate of client metadata exchanges (<= 10%). This pattern, combined with a high connection rate, is strong evidence of an anomalous interaction consistent with a network-based vulnerability scan or exploitation attempt.
query: "index=_internal sourcetype=mongod id IN (22943, 51800, 22944) (\"22943\" OR \"51800\" OR \"22944\")\r\n| eval remote = coalesce('attr.remote', remote, 'attr:remote')\r\n| rex field=remote \"(?<src_ip>\\d{1,3}(?:\\.\\d{1,3}){3})\"\r\n| where src_ip != \"\"\r\n| stats\r\n    count(eval(id=\"22943\")) as connections_accepted\r\n    count(eval(id=\"51800\")) as client_metadata\r\n    count(eval(id=\"22944\")) as connections_closed\r\n    values(remote) as remote\r\n    earliest(_time) as first_seen\r\n    latest(_time) as last_seen\r\n  by src_ip\r\n| eval duration_sec = last_seen - first_seen\r\n| eval burst_rate_per_min = if(\r\n    duration_sec > 0,\r\n    round(connections_accepted * 60 / duration_sec, 2),\r\n    connections_accepted * 60\r\n)\r\n| eval metadata_rate = if(\r\n    connections_accepted > 0,\r\n    round(client_metadata / connections_accepted, 4),\r\n    0\r\n)\r\n`Change burst_rate_per_min if needed`\r\n| where connections_accepted >= 100\r\n    AND metadata_rate <= 0.10\r\n    AND burst_rate_per_min >= 400\r\n| eval first_seen = strftime(first_seen, \"%Y-%m-%d %H:%M:%S\")\r\n| eval last_seen  = strftime(last_seen,  \"%Y-%m-%d %H:%M:%S\")\r\n| sort - connections_accepted"
query_type: spl
severity: medium
techniques:
    - T1190
    - T1212
tags:
    - spl
author: Daniel Koifman (CardinalOps)
version: "1"
references:
    - https://www.varonis.com/blog/mongobleed-cve-2025-14847-memory-leak-vulnerability
    - https://github.com/Neo23x0/mongobleed-detector
