id: 019c890f-1c9e-7215-9b5b-ae5654769bab
name: AsyncRAT Activity Detection
description: This rule detects activity associated with the Blue Mockingbird threat group by identifying known malicious file hashes, network communication to specific domains, and requests for known malicious URLs. The rule correlates process events with network traffic and URL requests to provide a comprehensive detection of Blue Mockingbird activity.
query: |-
    search *
    | tstats count min(_time) as firstTime max(_time) as lastTime
      from datamodel=Endpoint.Processes
      where (Processes.process_hash IN (
          "9cce1b4841c7e08b8a2144c539d1f25b","a12f72dde21ec2dd68118a8f7d5c216c0766c93a","39384dc9b114569ca6e95228285caf71ea8f391025136bdd0bd9e31bdddfab52",
          "1ae765685481fbfb48a1dda5e6a34a69","a8dd2def4fc50c4df95d3ef69996cb712a0c275d","1cf18efac5c0fddc935dc7e588309c7d7fe4ca719dac9334420afc9ac8b45d4d",
          "d36cd55c85ed93a9946d5f7bdcd6e4d2","441110497918ba74c1076e2088a4fe4e8351dec3","609ee9852409c1ba74b452ab2e2faca6cb48d6acac9747077b27c705b88ed442",
          "52ea8cdca427b4b088fb0213b27d7a5e","d89ba521a3b3c2b026e3a1a7be222d31d40b3f95","8f5a2b047d41915a06c648148a1e96eb4bc9a888b9b57b61dd05c9eca16fe119",
          "2b6bf01bb9d1096314c8efc1d436cb70","4962789ade0cd9e1a31b76e2419a0d3e00f860d1","d469e3bb8496802577bc490a3dda4d7a6641b4c581ed28c6539408f52bba91e6",
          "53338fa3720a0c563093d4f47cfa50e3","cb2a8ddcfe50110ed37398ee4c48163c14805bde","51296e84b1546c8fbc7ee80e6cc5f8efb5e7c0c36b504b2085868cf3c9af4c29",
          "e38d2bb1ee4c4f302b25fd71af899a5d10b32a6c467ebdfc98f980feff41bca5"
        )
        OR Processes.file_hash IN (
          "9cce1b4841c7e08b8a2144c539d1f25b","a12f72dde21ec2dd68118a8f7d5c216c0766c93a","39384dc9b114569ca6e95228285caf71ea8f391025136bdd0bd9e31bdddfab52",
          "1ae765685481fbfb48a1dda5e6a34a69","a8dd2def4fc50c4df95d3ef69996cb712a0c275d","1cf18efac5c0fddc935dc7e588309c7d7fe4ca719dac9334420afc9ac8b45d4d",
          "d36cd55c85ed93a9946d5f7bdcd6e4d2","441110497918ba74c1076e2088a4fe4e8351dec3","609ee9852409c1ba74b452ab2e2faca6cb48d6acac9747077b27c705b88ed442",
          "52ea8cdca427b4b088fb0213b27d7a5e","d89ba521a3b3c2b026e3a1a7be222d31d40b3f95","8f5a2b047d41915a06c648148a1e96eb4bc9a888b9b57b61dd05c9eca16fe119",
          "2b6bf01bb9d1096314c8efc1d436cb70","4962789ade0cd9e1a31b76e2419a0d3e00f860d1","d469e3bb8496802577bc490a3dda4d7a6641b4c581ed28c6539408f52bba91e6",
          "53338fa3720a0c563093d4f47cfa50e3","cb2a8ddcfe50110ed37398ee4c48163c14805bde","51296e84b1546c8fbc7ee80e6cc5f8efb5e7c0c36b504b2085868cf3c9af4c29",
          "e38d2bb1ee4c4f302b25fd71af899a5d10b32a6c467ebdfc98f980feff41bca5"
        )
      )
      by Processes.dest Processes.user Processes.parent_process Processes.process_name Processes.process Processes.process_hash Processes.file_hash
    | `drop_dm_object_name("Processes")`
    | eval indicator_type="file_hash", indicator=coalesce(process_hash, file_hash)
    | eval src=null()
    | append [
      | tstats count min(_time) as firstTime max(_time) as lastTime
        from datamodel=Network_Traffic.All_Traffic
        where All_Traffic.dest_domain IN ("tiquetes.ddnsfree.com","orgmanos.com")
        by All_Traffic.src All_Traffic.dest All_Traffic.dest_domain All_Traffic.user
      | `drop_dm_object_name("All_Traffic")`
      | eval indicator_type="domain", indicator=dest_domain
      | eval process_name=null(), process=null(), parent_process=null()
    ]
    | append [
      | search (index=* (sourcetype="pan:traffic" OR sourcetype="zscaler:nss:web" OR sourcetype="suricata" OR sourcetype="cisco:esa"))
          (
            "*tnow-prod-enam.367791ca7abea81096902b345fee7b1f.r2.cloudflarestorage.com/2026-02-20/43a5becd360411d905e8ec8d0ffd0164/202602205w37Q8kY/qfDarL/EMITO%20FACTURA%20ELECTRONICA*" OR
            "*transfernow.net/dl/202602205w37Q8kY*" OR
            "*ia600506.us.archive.org/11/items/amd_msi/optimized_MSI.png*" OR
            "*orgmanos.com/arquivo_20260220092305.txt*"
          )
      | eval url_any=coalesce(url, uri, cs_uri, request, http_url, web_url)
      | stats count min(_time) as firstTime max(_time) as lastTime by src dest user url_any
      | eval indicator_type="url", indicator=url_any
      | eval process_name=null(), process=null(), parent_process=null()
    ]
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | table firstTime lastTime indicator_type indicator src dest user process_name process parent_process count
query_type: spl
severity: medium
tactics:
    - TA0002
    - TA0011
    - TA0001
techniques:
    - T1059
    - T1071
    - T1566
    - T1204
tags:
    - spl
version: "2"
