id: 019c989d-2599-77ca-afad-06f45930e201
name: Potential AppLocker File Tampering
description: The rule detects object access events (Event ID 4663) targeting files within the \Windows\System32\AppLocker directory. This identifies unauthorized attempts to read, write, or delete the system's application control policy cache, a behavior indicative of an attempt to tamper with endpoint security defenses.
query: index=Windows sourcetype=WinEventLog EventCode=4663 ObjectType="File" ObjectName="*\\Windows\\System32\\Applocker\\*" "4663" "windows" "system32" "applocker" | stats values(ObjectName) as ObjectName, values(SubjectUserName) as SubjectUserName, values(Accesses) as Accesses, values(ProcessName) as ProcessName, count by Computer
query_type: spl
severity: medium
techniques:
    - T1562.001
tags:
    - spl
author: CardinalOps
version: "1"
references:
    - https://ipurple.team/2026/02/02/applocker-rules-abuse/
