id: 019c48f8-8661-7428-8a54-9477c4820191
name: Ms-Settings Shell Open Command Registry Modification
description: This rule detects modifications to specific registry keys associated with the 'ms-settings' URI scheme. Specifically, it looks for changes to the '(Default)' or 'DelegateExecute' values under 'ms-settings\Shell\Open\command'. Such modifications could indicate an attempt to hijack the 'ms-settings' URI handler to execute arbitrary commands or programs when a user tries to open Windows settings, potentially leading to persistence or privilege escalation.
query: "index=windows (EventCode=13 OR EventCode=4657)\r\n(TargetObject=\"*\\\\ms-settings\\\\Shell\\\\Open\\\\command\\\\(Default)\" OR TargetObject=\"*\\\\ms-settings\\\\Shell\\\\Open\\\\command\\\\DelegateExecute\")\r\n| table _time, ComputerName, User, EventCode, TargetObject, Details, Image"
query_type: spl
tags:
    - spl
version: "1"
