id: 019c48f9-0de6-77aa-a8a9-c3d2cc25783e
name: PowerShell Launched by Explorer with Obfuscated Command Line
description: This rule detects PowerShell or PowerShell Core processes launched by explorer.exe that contain highly obfuscated command lines. The obfuscation is identified by either an unusually long sequence of spaces (100 or more) or a sequence of 50 or more spaces followed by a hash and a drive letter (e.g., '# C:\'). This pattern is often used by malware to hide malicious commands from casual inspection and some security tools.
query: "index=windows sourcetype=Microsoft-Windows-Sysmon/Operational EventCode=1\r\n| search ParentImage=\"*\\\\explorer.exe\" (Image=\"*\\\\powershell.exe\" OR Image=\"*\\\\pwsh.exe\")\r\n| regex CommandLine=\"(\\s{100,}|\\s{50,}#\\s*[A-Z]:\\\\)\"\r\n| table _time, ComputerName, User, ParentImage, Image, CommandLine"
query_type: spl
tags:
    - spl
version: "1"
