id: 019c2324-9d15-7393-b38b-3185af020dce
name: Suspicious execution of update.exe by Notepad++
description: SPL Query
query: |-
    index=__AUDIT_INDEX__ | tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name=update.exe AND (Processes.parent_process_name=GUP.exe OR Processes.parent_process_name="notepad++.exe")) by Processes.dest Processes.user Processes.parent_process_name Processes.process_name Processes.process_path Processes.process
    | `drop_dm_object_name(Processes)`
    | where (match(process_path, "(?i)AppData\Local\Temp") OR match(process_path, "(?i)AppData\Roaming"))
    | eval host=dest
    | eval message=printf("Suspicious Notepad++ update execution detected on host=%s. The process '%s' (launched by '%s') was executed from the non-standard path '%s' by user '%s'.", host, process_name, parent_process_name, process_path, user)
    | table host, user, parent_process_name, process_name, process_path, process, firstTime, lastTime, message
query_type: spl
severity: medium
tactics:
    - TA0001
techniques:
    - T1195.002
tags:
    - spl
author: Maverick
version: "2"
