id: 019c48f8-429a-7187-af2a-01c42e05905b
name: Fodhelper.exe Executed by Scripting or Command Interpreter
description: This rule detects the execution of 'fodhelper.exe' when its parent process is a common scripting or command-line interpreter. This behavior is often associated with UAC bypass techniques, where 'fodhelper.exe' is leveraged to execute arbitrary commands with elevated privileges without prompting the user. The rule specifically looks for 'fodhelper.exe' being launched by 'cmd.exe', 'powershell.exe', 'pwsh.exe', 'wscript.exe', or 'cscript.exe'.
query: "index=windows sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational EventCode=1\r\n| search Image=\"*\\\\fodhelper.exe\"\r\n| search (ParentImage=\"*\\\\cmd.exe\" OR ParentImage=\"*\\\\powershell.exe\" OR ParentImage=\"*\\\\pwsh.exe\" OR ParentImage=\"*\\\\wscript.exe\" OR ParentImage=\"*\\\\cscript.exe\")\r\n| table _time, ComputerName, User, ParentImage, Image, CommandLine"
query_type: spl
tags:
    - spl
version: "1"
