id: 019c48f7-9998-71d9-941c-32d3a7338c7f
name: Scheduled Task Creation with Credentials via Schtasks.exe
description: This rule detects the creation of scheduled tasks using schtasks.exe where the command line explicitly includes parameters for creating a task, specifying a system, a user, and a password. This combination of parameters is often used in lateral movement or persistence techniques by adversaries.
query: "index=windows source=WinEventLog:Microsoft-Windows-Sysmon/Operational EventCode=1\r\n| search Image=\"*\\\\schtasks.exe\"\r\n| search (CommandLine=\"*/Create*\" AND CommandLine=\"*/S*\" AND CommandLine=\"*/U*\" AND CommandLine=\"*/P*\")\r\n| table _time, ComputerName, User, Image, CommandLine"
query_type: spl
tags:
    - spl
version: "1"
