id: 019c98c5-1f34-72c8-bcd8-4c7e64702fd6
name: Delayed Execution via W32tm
description: The rule detects the execution of w32tm.exe with the stripchart command-line argument.
query: index=Windows sourcetype=WinEventLog EventCode=4688 NewProcessName="w32tm.exe" CommandLine="*stripchart*" | stats values(CommandLine) as CommandLine, values(ParentProcessName) as ParentProcessName, values(NewProcessName) as NewProcessName, values(SubjectUserName) as SubjectUserName, count by Computer
query_type: spl
severity: medium
tags:
    - spl
author: CardinalOps
version: "1"
references:
    - https://www.splunk.com/en_us/blog/security/common-ttps-rats-malware-analysis.html
