id: 019c98c2-e51a-74c4-9df3-8015f134a00d
name: Detection of Gorelo RMM
description: The rule detects the installation of the Gorelo RMM service by monitoring Windows System events (Event ID 7045) or Security events (Event ID 4697), which record the creation of new services. It specifically looks for service names or binary paths containing the string "gorelo", flagging the moment the agent is first established on the system.
query: index=Windows sourcetype=WinEventLog (EventCode=4697 (ServiceName="*gorelo*" OR ServiceFileName="*gorelo*")) OR (EventCode=7045 (ServiceName="*gorelo*" OR ImagePath="*gorelo*")) ("7045" OR "4697") | stats values(ServiceName) as ServiceName, values(ImagePath) as ImagePath, values(ServiceFileName) as ServiceFileName, values(SubjectUserName) as SubjectUserName, count by Computer
query_type: spl
severity: medium
techniques:
    - T1219.002
tags:
    - spl
author: CardinalOps
version: "2"
references:
    - https://lolrmm.io/tools/gorelo_rmm
