id: 019c98cc-48f2-770d-a386-2d85ec8fd2d5
name: VMCI Device Disabled via Devcon
description: The rule detects the execution of the devcon.exe process with a command-line argument containing the word "disable". This is a strong indicator that an attempt is being made to disable one or more hardware devices on the system, which is highly suspicious outside of legitimate administrative or deployment activities.
query: index=Windows sourcetype=WinEventLog EventCode=4688 NewProcessName="devcon.exe" CommandLine="*disable*" CommandLine IN ("*15AD&DEV_0740*", "*VMWVMCIHOSTDEV*") "4688" "devcon.exe" "disable" | stats values(CommandLine) as CommandLine, values(ParentProcessName) as ParentProcessName, values(NewProcessName) as NewProcessName, values(SubjectUserName) as SubjectUserName, count by Computer
query_type: spl
severity: medium
techniques:
    - T1562.001
    - T1489
tags:
    - spl
author: CardinalOps
version: "1"
references:
    - https://www.huntress.com/blog/esxi-vm-escape-exploit
