id: 019c48f8-c5ce-7064-9aa9-d29f6c694096
name: Security Log Cleared or System Log Cleared
description: This rule detects when the security log (EventCode 1102) or the system log (EventCode 104) is cleared on a Windows machine. This activity can indicate an attempt by an attacker to remove forensic evidence of their actions.
query: "index=windows (EventCode=1102 OR EventCode=104)\r\n| table _time, ComputerName, EventCode, Channel, SubjectUserName, SubjectDomainName, User"
query_type: spl
tags:
    - spl
version: "1"
