id: 019c1d02-b75c-713f-bcf3-2dd19aed26a8
name: Test Mode Enabled via Bcdedit
description: The rule detects the execution of bcdedit.exe with command-line arguments containing both "testsigning" and "on".
query: index=windows sourcetype=WinEventLog EventCode=4688 NewProcessName="bcdedit.exe" CommandLine="*testsigning*" CommandLine="* on" "4688" "bcdedit.exe" "testsigning" | stats values(CommandLine) as CommandLine, values(ParentProcessName) as ParentProcessName, values(NewProcessName) as NewProcessName, values(SubjectUserName) as SubjectUserName, count by Computer
query_type: spl
severity: medium
techniques:
    - T1542.003
    - T1562.001
tags:
    - spl
author: Daniel Koifman (Koifsec, CardinalOps)
version: "1"
references:
    - https://www.esentire.com/blog/weaponized-in-china-deployed-in-india-the-syncfuture-espionage-targeted-campaign
