id: 019c9898-c056-71c1-b748-86387a8db0f1
name: Unusual Creation of NTUSER.MAN
description: The rule detects write access to files named NTUSER.MAN by monitoring Windows Security Event Log event ID 4663.
query: index=windows sourcetype=WinEventLog EventCode=4663 ObjectType="File" Accesses="*write*" ObjectName="*\\NTUSER.MAN" "4663" "NTUSER.MAN" | stats values(ObjectName) as ObjectName, values(SubjectUserName) as SubjectUserName, values(Accesses) as Accesses, values(ProcessName) as ProcessName, count by Computer
query_type: spl
severity: medium
techniques:
    - T1547.001
    - T1112
tags:
    - spl
version: "1"
references:
    - https://www.praetorian.com/blog/corrupting-the-hive-mind-persistence-through-forgotten-windows-internals/
