id: 019c48f7-c4ce-74fc-8906-e7e14ca93036
name: Startup Folder Persistence via Sysmon Event ID 11
description: This rule detects the creation of specific file types (batch scripts, command scripts, VBScripts, JScripts, PowerShell scripts, or shortcut files) within the Windows Startup folder. This activity is often used for persistence, allowing an attacker's code to execute automatically when a user logs in or the system starts.
query: "index=windows sourcetype=WinEventLog:Microsoft-Windows-Sysmon/Operational EventCode=11\r\n| search (TargetFilename=\"*\\\\Start Menu\\\\Programs\\\\Startup\\\\*\" OR TargetFilename=\"*\\\\Start Menu\\\\Programs\\\\StartUp\\\\*\")\r\n| search (TargetFilename=\"*.bat\" OR TargetFilename=\"*.cmd\" OR TargetFilename=\"*.vbs\" OR TargetFilename=\"*.vbe\" OR TargetFilename=\"*.js\" OR TargetFilename=\"*.jse\" OR TargetFilename=\"*.ps1\" OR TargetFilename=\"*.lnk\")\r\n| table _time, ComputerName, User, Image, TargetFilename"
query_type: spl
tags:
    - spl
version: "1"
