id: 019c989a-5453-7206-925f-1c92939ca5a4
name: Detection of NetMonitor RMM
description: The rule detects the execution of processes which are unique identifiers for the NetMonitor agent.
query: index=Windows sourcetype=WinEventLog EventCode=4688 (NewProcessName IN ("nmep_ctrlagent.exe", "nmep_ctrlagentsvc.exe") OR ParentProcessName IN ("nmep_agtconfig.exe", "nmep_ctrlagent.exe", "nmep_ctrlagentsvc.exe")) "4688" ("nmep_agtconfig.exe" OR "nmep_ctrlagent.exe" OR "nmep_ctrlagentsvc.exe") | stats values(CommandLine) as CommandLine, values(ParentProcessName) as ParentProcessName, values(NewProcessName) as NewProcessName, values(SubjectUserName) as SubjectUserName, count by Computer
query_type: spl
severity: medium
techniques:
    - T1219.002
tags:
    - spl
version: "1"
references:
    - https://www.huntress.com/blog/employee-monitoring-simplehelp-abused-in-ransomware-operations
