id: 019c98ad-8856-7468-8a9c-e766ebb2a094
name: Unusual Access to AppLocker Service
description: The rule detects access attempts (Event ID 4663) to theAppIDSvc service object. This captures the moment a process interacts with the service's configuration, such as changing its startup type from "Manual" to "Auto" or forcing it to start.
query: index=Windows sourcetype=WinEventLog EventCode=4663 ObjectType="Key" ObjectName="*\\Services\\AppIDSvc" "4663" "services" "appidsvc"{{exclusion:ProcessName}} | stats values(ObjectName) as ObjectName, values(SubjectUserName) as SubjectUserName, values(Accesses) as Accesses, values(ProcessName) as ProcessName, count by Computer
query_type: spl
severity: medium
techniques:
    - T1562.001
    - T1112
tags:
    - spl
author: CardinalOps
version: "1"
references:
    - https://ipurple.team/2026/02/02/applocker-rules-abuse/
