id: 019ca9b3-53de-739f-80a0-d406b9e88ef6
name: Kerberos Ticket Using RC4 Encryption
description: This rule alerts when A Kerberos authentication ticket (TGT) was requested or generated using encryption type 0x17 (RC4-HMAC).
query: index=Windows sourcetype=WinEventLog EventCode IN (4768,4769) TicketEncryptionType=0x17 Account_Name!=*$ ("4768" OR "4769") "0x17" | stats values(Account_Name) as Account_Name by Source_Workstation
query_type: spl
severity: medium
tags:
    - spl
version: "1"
