id: 019c1cfc-3c6b-7649-ae33-85d018950b29
name: W32tm.exe Executing with Stripchart Argument
description: Detects the execution of w32tm.exe with the 'stripchart' argument. This command is used for monitoring the time synchronization status of a system and can be leveraged by adversaries for delayed execution.
query: index=Windows sourcetype=WinEventLog EventCode=4688 NewProcessName="w32tm.exe" CommandLine="*stripchart*" | stats values(CommandLine) as CommandLine, values(ParentProcessName) as ParentProcessName, values(NewProcessName) as NewProcessName, values(SubjectUserName) as SubjectUserName, count by Computer
query_type: spl
severity: medium
tags:
    - spl
author: Daniel Koifman (Koifsec, CardinalOps)
version: "2"
references:
    - https://www.splunk.com/en_us/blog/security/common-ttps-rats-malware-analysis.html
