id: 019c98c8-cef7-77dc-9a1b-33249baac21a
name: Unusual CIM Method Invocation
description: The rule detects the execution of PowerShell where the command line includes invoke-CimMethod. This specifically highlights the programmatic invocation of CIM methods, alerting analysts to potential WMI-based attacks or unauthorized administrative actions being performed via script.
query: index=Windows sourcetype=WinEventLog EventCode=4688 NewProcessName IN ("powershell.exe", "pwsh.exe") CommandLine="*invoke-cimmethod*" "4688" ("powershell.exe" OR "pwsh.exe") "invoke-cimmethod" | stats values(CommandLine) as CommandLine, values(ParentProcessName) as ParentProcessName, values(NewProcessName) as NewProcessName, values(SubjectUserName) as SubjectUserName, count by Computer
query_type: spl
severity: medium
techniques:
    - T1059.001
    - T1047
tags:
    - spl
author: CardinalOps
version: "1"
references:
    - https://www.malwarebytes.com/blog/news/2026/01/can-you-use-too-many-lolbins-to-drop-some-rats
