id: 019c48f9-aa4e-73e2-898e-caf401469a7c
name: Vyatta chmod 777 Execution
description: This rule detects the use of the 'chmod' command with highly permissive file permissions (777, 0777, a=rwx, ugo+rwx, a+rwx) on Vyatta systems. This activity could indicate an attempt to weaken file system security, potentially for privilege escalation or to facilitate malware execution.
query: "index=vyatta sourcetype=syslog type=EXECVE \"*chmod*\"\r\n| search (a0=\"chmod\" OR a1=\"*chmod*\" OR a2=\"*chmod*\" OR CommandLine=\"*chmod*\")\r\n| search (a1=\"777\" OR a1=\"0777\" OR a1=\"a=rwx\" OR a1=\"ugo+rwx\" OR a1=\"a+rwx\" OR\r\n a2=\"777\" OR a2=\"0777\" OR a2=\"a=rwx\" OR a2=\"ugo+rwx\" OR a2=\"a+rwx\" OR\r\n a3=\"777\" OR a3=\"0777\" OR a3=\"a=rwx\" OR a3=\"ugo+rwx\" OR a3=\"a+rwx\" OR\r\n CommandLine=\"*777*\" OR CommandLine=\"*0777*\" OR CommandLine=\"*a=rwx*\" OR CommandLine=\"*ugo+rwx*\" OR CommandLine=\"*a+rwx*\")\r\n| table _time, host, a0, a1, a2"
query_type: spl
tags:
    - spl
version: "1"
