id: 019c989b-e506-711a-b397-9e09d483157d
name: Code Execution via SyncAppvPublishingServer
description: The rule detects the execution of a command line containing both SyncAppvPublishingServer.vbs and a semicolon (;).
query: index=Windows sourcetype=WinEventLog EventCode=4688 NewProcessName="wscript.exe" CommandLine="*SyncAppvPublishingServer.vbs*" CommandLine="*;*" "4688" "wscript.exe" "SyncAppvPublishingServer.vbs" | stats values(CommandLine) as CommandLine, values(ParentProcessName) as ParentProcessName, values(NewProcessName) as NewProcessName, values(SubjectUserName) as SubjectUserName, count by Computer
query_type: spl
severity: medium
techniques:
    - T1218
    - T1216.002
tags:
    - spl
author: CardinalOps
version: "1"
references:
    - https://pentestlab.blog/tag/syncappvpublishingserver/
