id: 019c48f8-102e-702e-8572-1cb8a1071a7c
name: Suspicious PowerShell Activity via Registry or File System Access
description: This rule detects suspicious PowerShell activity by monitoring Windows events for process creation (EventCode 13) or registry modifications (EventCode 4657) that involve PowerShell or pwsh. It specifically looks for the use of obfuscation or evasion techniques within the command details, such as 'iex', 'Invoke-Expression', 'DownloadString', 'DownloadFile', '.Net.WebClient', 'FromBase64String', hidden window styles ('-w hidden', '-windowstyle hidden'), execution policy bypass ('-ep bypass', '-executionpolicy bypass'), or encoded commands ('-enc', '-encodedcommand'). This combination of event codes and keywords suggests an attempt to execute malicious or obfuscated PowerShell scripts.
query: "index=windows (EventCode=13 OR EventCode=4657)\r\n| search (Details=\"*powershell*\" OR Details=\"*pwsh*\")\r\n| search (Details=\"*iex*\" OR Details=\"*Invoke-Expression*\" OR Details=\"*DownloadString*\" OR Details=\"*DownloadFile*\" OR Details=\"*Net.WebClient*\" OR Details=\"*FromBase64String*\" OR Details=\"*-w hidden*\" OR Details=\"*-windowstyle hidden*\" OR Details=\"*-ep bypass*\" OR Details=\"*-executionpolicy bypass*\" OR Details=\"*-enc *\" OR Details=\"*-encodedcommand*\")\r\n| table _time, ComputerName, User, EventCode, TargetObject, Details, Image"
query_type: spl
tags:
    - spl
version: "1"
