id: 019c98c7-8563-75c5-9e97-c101190848c1
name: Potential UAC Bypass via ICMLuaUtil
description: The rule detects the execution of dllhost.exe where the command line includes the Class ID (CLSID) for the CMSTPLUA or ICMLuaUtil interfaces.
query: index=Windows sourcetype=WinEventLog EventCode=4688 NewProcessName="dllhost.exe" CommandLine IN ("*/Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}*", "*/Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}*") "4688" "dllhost.exe" | stats values(CommandLine) as CommandLine, values(ParentProcessName) as ParentProcessName, values(NewProcessName) as NewProcessName, values(SubjectUserName) as SubjectUserName, count by Computer
query_type: spl
severity: medium
techniques:
    - T1559.001
    - T1548.002
tags:
    - spl
author: CardinalOps
version: "1"
references:
    - https://www.varonis.com/blog/blackcat-ransomware
