id: 019c989e-d7df-74bd-9175-538f0c37fb5a
name: Potential AppLocker Rule Enumeration
description: The rule detects handle requests and access attempts (Event ID 4663) to the SrpV2\Exe registry key.
query: index=Windows sourcetype=WinEventLog EventCode=4663 ObjectType="Key" ObjectName="*\\policies\\microsoft\\windows\\srpv2\\exe\\*" "4663" "policies" "microsoft" "\\srpv2" | stats values(ObjectName) as ObjectName, values(SubjectUserName) as SubjectUserName, values(Accesses) as Accesses, values(ProcessName) as ProcessName, count by Computer
query_type: spl
severity: medium
techniques:
    - T1012
    - T1518.001
tags:
    - spl
author: CardinalOps
version: "1"
references:
    - https://ipurple.team/2026/02/02/applocker-rules-abuse/
