id: 019c48f9-8ad0-7220-9d92-02994ebcc141
name: NTDS.dit File Access
description: This rule detects the creation or modification of the 'ntds.dit' file, which is the Active Directory database. This file contains critical information, including user credentials, and its access or exfiltration is a common objective for attackers attempting to gain control over a Windows domain. The rule specifically looks for Sysmon Event ID 11, which indicates file creation, and filters for events where the 'TargetFilename' ends with 'ntds.dit'. This activity is highly suspicious and often indicative of credential dumping or reconnaissance attempts against Active Directory.
query: "index=windows source=WinEventLog:Microsoft-Windows-Sysmon/Operational EventCode=11\r\n| search TargetFilename=\"*ntds.dit\"\r\n| table _time, ComputerName, User, Image, TargetFilename"
query_type: spl
tags:
    - spl
version: "1"
