id: 019c8cdc-9914-7019-b245-52be8489fb0e
name: Active Directory Object Access with Specific Object Types
description: This rule detects attempts to access specific Active Directory object types (identified by their GUIDs) with an access mask of 0x100 (which typically indicates 'Write Property' access). It filters out common service accounts and system accounts to reduce noise.
query: "index=windows source=WinEventLog:Security EventCode=4662 Access_Mask=0x100\r\n| search (Object_Type=\"*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2*\" OR Object_Type=\"*1131f6aa-9c07-11d1-f79f-00c04fc2dcd2*\" OR Object_Type=\"*9923a32a-3607-11d2-b9be-0000f87a36b2*\" OR Object_Type=\"*89e95b76-444d-4c62-991a-0facbeda640c*\" OR Object_Type=\"*19195a5b-6da0-11d0-afd3-00c04fd930c9*\")\r\n| search NOT (Account_Domain=\"Window Manager\" OR Account_Name=\"NT AUT*\" OR Account_Name=\"MSOL_*\" OR Account_Name=\"*$\")\r\n| table _time, ComputerName, Account_Name, Account_Domain, Object_Type, Access_Mask"
query_type: spl
severity: medium
techniques:
    - DS0026
tags:
    - spl
version: "1"
