id: 019c48f8-64af-758b-9dc5-318fa4973a65
name: Fodhelper.exe Parent Process
description: This rule detects the execution of a process where the parent process is 'fodhelper.exe'. This behavior can be indicative of privilege escalation or UAC bypass techniques, as fodhelper.exe is a legitimate Windows binary that has been abused by adversaries to execute arbitrary commands with elevated privileges without triggering a UAC prompt. The rule specifically looks for Sysmon EventCode 1 (process creation) where the ParentImage field contains '*\fodhelper.exe'.
query: "index=windows sourcetype=WinEventLog:Microsoft-Windows-Sysmon/Operational EventCode=1\r\n| search ParentImage=\"*\\\\fodhelper.exe\"\r\n| table _time, ComputerName, User, ParentImage, Image, CommandLine"
query_type: spl
tags:
    - spl
version: "1"
