id: 10859ca7-af94-46ff-9164-64143e7166a8
name: PANW Firewall Medium Severity Correlation Event Detected
description: Detects medium severity correlation events generated by Palo Alto Networks firewall's automated correlation engine. The correlation engine connects isolated network events and looks for patterns that indicate a more significant event. This helps identify suspicious traffic patterns and network anomalies which, when correlated, indicate with a high probability that a host on the network has been compromised.
query: "index=* sourcetype=\"pan:correlation\" severity=\"medium\"\r\n| stats count by src_ip, dest_ip, threat_name, severity, correlation_type\r\n| where count > 0"
query_type: spl
severity: medium
tags:
    - spl
version: "1"
