id: 11332e58-13f6-4e5e-bf28-46b37578e1f7
name: Possible Golden Ticket Usage Detected via Kerberos Anomalies
description: This detection identifies potential Golden Ticket attacks by correlating multiple Windows Security Event IDs that are indicative of forged Kerberos TGT usage. Specifically, it focuses on accounts requesting TGTs using uncommon or high-privilege encryption types (0x17, 0x18, 0x12), interacting with the krbtgt service, and logging in using elevated privileges and interactive logon types (4624, 4672). The rule filters out computer accounts and performs deduplication and correlation across a series of Kerberos-related activities, aiming to surface accounts that could be using forged Kerberos tickets for lateral movement or privilege escalation.
query: "index=windows (sourcetype=WinEventLog:Security OR sourcetype=WinEventLog:ForwardedEvents) \r\n| search EventCode=4768 \r\n| where Ticket_Encryption_Type IN (\"0x17\", \"0x18\", \"0x12\")\r\n| search NOT Account_Name=*$* \r\n| eval Account_Name=lower(replace(Account_Name, \"@.*\", \"\")) \r\n| dedup Account_Name, _time \r\n    | search [ search index=windows (sourcetype=WinEventLog:Security OR sourcetype=WinEventLog:ForwardedEvents) \r\n    | search EventCode=4769 \r\n    | where Ticket_Encryption_Type IN (\"0x17\", \"0x18\", \"0x12\") \r\n    | search NOT Account_Name=*$* \r\n    | search Service_Name=krbtgt \r\n    | search Ticket_Options IN (\"0x40810000\", \"0x60810010\") \r\n    | eval Account_Name=lower(replace(Account_Name, \"@.*\", \"\")) \r\n    | table Account_Name ] \r\n| search [ search index=windows (sourcetype=WinEventLog:Security OR sourcetype=WinEventLog:ForwardedEvents) \r\n    | search EventCode=4672 \r\n    | search NOT Account_Name=*$* \r\n    | eval Account_Name=lower(Account_Name) \r\n    | table Account_Name ] \r\n| search [ search index=windows (sourcetype=WinEventLog:Security OR sourcetype=WinEventLog:ForwardedEvents) \r\n    | search EventCode=4624 \r\n    | search NOT Account_Name=*$* \r\n    | eval Account_Name=lower(Account_Name) \r\n    | where Logon_Type IN (\"3\", \"10\") \r\n    | table Account_Name ] \r\n| stats count, earliest(_time) as FirstSeen, latest(_time) as LastSeen, values(ComputerName) as InvolvedHosts by Account_Name \r\n| eval FirstSeen=strftime(FirstSeen, \"%Y-%m-%d %H:%M:%S\") \r\n| eval LastSeen=strftime(LastSeen, \"%Y-%m-%d %H:%M:%S\")\r\n| where count > 1 \r\n| rename Account_Name as \"Potentially Compromised Account\", count as \"Event Count\", FirstSeen as \"First Seen\", LastSeen as \"Last Seen\", InvolvedHosts as \"Involved Hosts\" \r\n| table \"Potentially Compromised Account\", \"Event Count\", \"First Seen\", \"Last Seen\", \"Involved Hosts\""
query_type: spl
severity: medium
tags:
    - attack.t1558.001
    - attack.t1078
    - detection.golden_ticket
author: Jorden Smith
version: "1"
