id: 14c3e306-2916-425a-bf2e-5999ac4c6b83
name: PANW Firewall Malware Allowed
description: Detects active network communication associated with known malware that is being allowed by the Palo Alto Networks firewall. This may indicate an ongoing security threat, where malicious traffic is bypassing firewall protections, potentially leading to system compromise, data exfiltration, or further infiltration within the network.
query: "index=* sourcetype=\"pan:threat\" subtype=\"virus\" NOT (action IN (\"deny\", \"drop\", \"reset\", \"block\"))\r\n| stats count by src_ip, dest_ip, threat_name, action, severity\r\n| where count > 0"
query_type: spl
severity: medium
tactics:
    - TA0011
    - TA0042
techniques:
    - T1588.001
tags:
    - spl
version: "1"
