id: 2a3fbdae-63fd-42ad-b39b-a3d1c81d9681
name: PANW Firewall High Severity Correlation Event Detected
description: Detects high and critical severity correlation events generated by Palo Alto Networks firewalls' automated correlation engine. The correlation engine connects isolated network events and looks for patterns that indicate a more significant event. This helps identify suspicious traffic patterns and network anomalies which, when correlated, indicate with a high probability that a host on the network has been compromised.
query: "index=* sourcetype=\"pan:correlation\" severity IN (\"high\", \"critical\")\r\n| stats count by src_ip, dest_ip, threat_name, severity, correlation_type\r\n| where count > 0"
query_type: spl
severity: medium
tags:
    - spl
version: "1"
