id: 5fb12647-afd2-4454-a792-8e1f98c45782
name: Failed Authentication to Non-existing Accounts
description: 'SPL Query from file: Failed Authentication to Non-existing Accounts'
query: source="WinEventLog:security" sourcetype="WinEventLog:Security" EventCode=4625 Sub_Status=0xC0000064 |eval Date=strftime(_time, "%Y/%m/%d") |rex "Which\sLogon\sFailed:\s+Security\sID:\s+\S.*\s+\w+\s\w+\S\s.(?<uacct>\S.*)" | stats count by Date, uacct, host | rename count as "Attempts" | sort - Attempts
query_type: spl
severity: medium
tactics:
    - TA0006
    - TA0005
    - TA0003
    - TA0004
    - TA0001
techniques:
    - T1110
    - T1078.002
tags:
    - spl
version: "1"
references:
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4625
