id: 65a8d672-6056-41bb-a30a-4e912f43dd6f
name: PANW Firewall Traffic to Phishing URL Allowed
description: Detects when the Palo Alto Networks firewall does not block traffic to a URL known to be used in phishing attacks. An adversary can abuse this by directing victims to the phishing site, potentially stealing credentials, deploying malware, or conducting other malicious activities.
query: "index=* sourcetype=\"pan:threat\" subtype=\"url\" (threat_category=\"phishing\" OR url_category=\"phishing\") severity IN (\"critical\", \"high\", \"medium\") NOT (action IN (\"deny\", \"drop\", \"reset\", \"block\"))\r\n| stats count by src_ip, dest_ip, url, threat_name, action, severity\r\n| where count > 0"
query_type: spl
severity: medium
tactics:
    - TA0001
techniques:
    - T1566
tags:
    - spl
version: "1"
