id: 83740b90-4e7c-4bbc-ad9a-96b2f22500a3
name: PANW Firewall Traffic to Malicious URL Allowed
description: Detects when the Palo Alto Networks firewall does not block traffic to a URL associated with malware distribution or operation. This typically indicates a lapse in the firewall's threat intelligence or a misconfiguration. An adversary can abuse this by using the unblocked URL to download malware onto a target system, establish a command and control channel, or exfiltrate data.
query: "index=* sourcetype=\"pan:traffic\" (app=\"tor\" OR app_name=\"tor\") action=\"allow\"\r\n| stats count by src_ip, dest_ip, app, action, bytes_sent, bytes_received\r\n| where count > 0"
query_type: spl
severity: medium
tactics:
    - TA0011
tags:
    - spl
version: "1"
