id: da94eeb2-e62c-4812-a6d8-3528fcd2b1c5
name: Detect Web Shell Activity (Command Execution from Web Directory)
description: This rule detects the execution of common command-line utilities (wget, curl, nc, bash, python, perl, php, sh) within web server directories. This activity is highly suspicious as it could indicate an attacker attempting to download malicious files, execute web shells, or perform other post-exploitation activities on a compromised web server.
query: "index=os_logs OR index=webserver_logs\r\n(process_name=\"*\" OR cmdline=\"*\")\r\n| search cmdline IN (\"wget*\", \"curl*\", \"nc*\", \"bash*\", \"python*\", \"perl*\", \"php*\", \"sh*\")\r\n| where like(file_path, \"/var/www%\") OR like(file_path, \"C:\\\\inetpub\\\\wwwroot%\")\r\n| stats count by host, user, file_path, cmdline, _time"
query_type: spl
severity: medium
tactics:
    - TA0011
    - TA0002
    - TA0003
techniques:
    - T1105
    - T1059
    - T1059.004
    - T1059.006
    - T1505.003
tags:
    - spl
version: "1"
