id: dda432df-4607-4516-b25f-314e004a3e71
name: Identified Network Connections via Mshta Execution
description: "The detection functionality is specifically on the zscaler a notable proxy, depending on the proxy technology being leveraged, this could perhaps be used for others.\n\nThe detection's focus is anchored what the HTTP content is, and its associated user-agent which is tied to MSHTA Execution. We couple these because using the user-agent alone, is too general resulting in a massive amount of events. Coupling the content focusing on HTA does in fact hone in on pulling an hta payload down into the environment. \n\nmshta.exe (Microsoft HTML Application Host) is a legitimate Windows utility used to execute HTML Application (HTA) files and can also be used to run scripts, such as JavaScript or VBScript, directly from the command line. This technique involves abusing mshta.exe, a legitimate Windows utility, to execute malicious scripts or commands by proxy. Since mshta.exe is Microsoft-signed, attackers use it to bypass security tools or avoid detection (a technique known as living off the land)."
query: "index=zscaler_proxy http_referrer=\"None\" useragent=\"Mozilla/4.0 (compatible; MSIE *\" http_content_type=\"application/hta\" \n```The User-Agent here is the default of what MSHTA leverages, as the binary behind the scenes uses the IE Engine.```\n| stats count values(file_name) as \"files\" values(filesubtype) as \"fileTypes\" by devicehostname, src, status, dest_ip, user, deviceowner, useragent, url, http_referrer, http_content_type"
query_type: spl
severity: medium
tags:
    - T1218
    - T1218.005
author: ZeroChill
version: "1"
