id: ea23b993-6cde-47a3-a6d6-f45bbb8b3c22
name: PANW Firewall TOR Traffic Allowed
description: Detects allowed network traffic to the TOR network. Adversaries can use TOR to anonymize their network activity, bypass security controls, and evade detection while conducting malicious operations. This could lead to unauthorized access, data exfiltration, and compliance violations if deemed malicious.
query: "index=* sourcetype=\"pan:traffic\" (app=\"tor\" OR app_name=\"tor\") action=\"allow\"\r\n| stats count by src_ip, dest_ip, app, action, bytes_sent, bytes_received\r\n| where count > 0"
query_type: spl
severity: medium
tags:
    - spl
version: "1"
