id: ef3be2cb-51e0-4b8d-a41c-6f94d65c53c8
name: Possible DCSync Attack Detected via AD Replication and Network Indicators
description: Detects potential DCSync attacks by correlating Active Directory replication requests (Event ID 4662) with suspicious network activity (Sysmon Event ID 3). DCSync allows attackers with replication privileges to request credential data from domain controllers, mimicking legitimate replication traffic.
query: "index=windows (sourcetype=WinEventLog:Security OR sourcetype=WinEventLog:ForwardedEvents) EventCode=4662 \r\n| where like(Object_Type, \"%19195a5b-6da0-11d0-afd3-00c04fd930c9%\") OR  \r\n        like(Object_Type, \"%1131f6aa-9c07-11d1-f79f-00c04fc2dcd2%\") OR \r\n        like(Object_Type, \"%1131f6ad-9c07-11d1-f79f-00c04fc2dcd2%\") OR \r\n        like(Object_Type, \"%89e95b76-444d-4c62-991a-0facbeda640c%\") OR\r\n        like(Object_Type, \"%replicationSynchronization%\") OR\r\n        like(Object_Type, \"%replicating Directory Changes All%\")\r\n| search Access_Mask=0x100\r\n| eval Ticket_Time = _time\r\n| eval Account_Name=lower(Account_Name)\r\n| eval Descriptive_Object_Type = case(\r\n    like(Object_Type, \"%19195a5b-6da0-11d0-afd3-00c04fd930c9%\"), \"Directory Replication\",\r\n    like(Object_Type, \"%1131f6aa-9c07-11d1-f79f-00c04fc2dcd2%\"), \"Replicating Directory Changes\",\r\n    like(Object_Type, \"%1131f6ad-9c07-11d1-f79f-00c04fc2dcd2%\"), \"Replicating Directory Changes All\",\r\n    like(Object_Type, \"%89e95b76-444d-4c62-991a-0facbeda640c%\"), \"Replicating Directory Changes In Filtered Set\",\r\n    like(Object_Type, \"%replicationSynchronization%\"), \"General Replication Synchronization\",\r\n    like(Object_Type, \"%replicating Directory Changes All%\"), \"General Replication of All Directory Changes\",\r\n    1==1, \"Unknown\"\r\n)\r\n| table Account_Name, Ticket_Time, Descriptive_Object_Type\r\n| append [\r\n    search index=windows sourcetype=WinEventLog:Microsoft-Windows-Sysmon/Operational EventCode=3 \r\n    (DestinationPort=135 OR DestinationPort=389 OR DestinationPort=88)\r\n    | rex field=_raw \"User:\\s(?[^\\s]+)\"\r\n    | eval Account_Name=lower(mvindex(split(user_domain, \"\\\\\"),1))\r\n    | eval Network_Time = _time\r\n    | table Account_Name, Network_Time, Image, DestinationPort\r\n]\r\n| stats values(Descriptive_Object_Type) as Object_Type, values(Image) as Image, values(DestinationPort) as DestinationPort, \r\n        min(Ticket_Time) as Ticket_Time, min(Network_Time) as Network_Time, \r\n        count(eval(isnotnull(Ticket_Time))) as Ticket_Count, \r\n        count(eval(isnotnull(Network_Time))) as Network_Count by Account_Name\r\n| where isnotnull(Object_Type) AND isnotnull(Network_Time)\r\n| where abs(Ticket_Time - Network_Time) <= 1800\r\n| eval Network_Time=strftime(Network_Time, \"%Y-%m-%d %H:%M:%S\")\r\n| eval Ticket_Time=strftime(Ticket_Time, \"%Y-%m-%d %H:%M:%S\")\r\n| table Account_Name, Object_Type, Image, DestinationPorts, Network_Time, Network_Count. Ticket_Time, Ticket_Count"
query_type: spl
severity: medium
tags:
    - attack.t1003.006
    - attack.t1078.002
    - detection.dcsync
author: Jorden Smith
version: "1"
