id: 0199f271-3547-75ab-b598-ebae62448e59
name: UNC5142 Malware Hashes
description: Detects known malicious file hashes associated with malware families (VIDAR, LUMMAC.V2, RADTHIEF, ATOMIC) distributed by the threat actor UNC5142.
query: |
    title: UNC5142 Malware Hashes
    id: a90dc6d7-bb59-4a63-bfc0-f30e9dfbd018
    status: experimental
    description: Detects known malicious file hashes associated with malware
      families (VIDAR, LUMMAC.V2, RADTHIEF, ATOMIC) distributed by the threat actor
      UNC5142.
    references:
      - https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware/
    author: detections.ai
    date: 2025-10-17
    tags:
      - attack.t1003
      - threat_actor.unc5142
      - malware.vidar
      - malware.lummac
      - malware.radthief
      - malware.atomic
    logsource:
      category:
        - file_event
        - process_creation
    detection:
      # This selection matches known SHA256 hashes of malware distributed by UNC5142
      selection:
        hash.sha256:
          - 'bcbdb74f97092dfd68e7ec1d6770b6d1e1aae091f43bcebb0b7bce6c8188e310' # VIDAR
          - '88019011af71af986a64f68316e80f30d3f57186aa62c3cef5ed139eb49a6842' # VIDAR
          - '27105be1bdd9f15a1b1a2b0cc5de625e2ecd47fdeaed135321641eea86ad6cb0' # VIDAR
          - '72d8fa46f402dcc4be78306d0535c9ace0eb9fabae59bd3ba3cc62a0bdf3db91' # LUMMAC.V2
          - '3023b0331baff73ff894087d1a425ea4b2746caf514ada624370318f27e29c2c' # LUMMAC.V2
          - '4b47b55ae448668e549ffc04e82aee41ac10e3c8b183012a105faf2360fc5ec1' # RADTHIEF
          - '091f9db54382708327f5bb1831a4626897b6710ffe11d835724be5c224a0cf83' # ATOMIC
      condition: selection
    falsepositives:
      - Unlikely, as this detection is based on known malicious file hashes. A hash
        collision is theoretically possible but practically improbable.
    level: critical
query_type: sigma
severity: medium
tactics:
    - TA0006
techniques:
    - T1003
author: detections.ai
version: "2"
references:
    - https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware/
