id: 0199ca9d-05d8-74cc-8cf3-634529db4f3a
name: Potential Command Injection Vulnerability In Progress Flowmon (CVE-2024-2389)
description: Detects CVE-2024-2389 detected on April 23 on Progress Flowmon. This rule detecting access to the vulnerable function parameters in specific endpoin (/service.pdfs/confluence). Attacker can be use vulnerable file and pluginPath variables directly requesting them. Howewer, to able to use those two variables lang must set to any value.
query: |-
    title: Potential Command Injection Vulnerability In Progress Flowmon (CVE-2024-2389)
    id: e0fe58e5-4a08-46a4-ad77-5f326db2cd86
    status: stable
    description: Detects CVE-2024-2389 detected on April 23 on Progress Flowmon. This rule detecting access to the vulnerable function parameters in specific endpoin (/service.pdfs/confluence). Attacker can be use vulnerable file and pluginPath variables directly requesting them. Howewer, to able to use those two variables lang must set to any value.
    references:
    - https://rhinosecuritylabs.com/research/cve-2024-2389-in-progress-flowmon/
    author: Ziya DENİZ
    date: 2024-04-23
    tags:
    - attack.execution
    - attack.t1190
    logsource:
      category: webserver
    detection:
     selection:
      c-uri-query|contains|all:
       - /service.pdfs/confluence?
       - file=
       - lang=
       - pluginPath=
      cs-method:
       - 'GET'
     condition: selection
    falsepositives:
     - It can be produced false positive during legitimate access. File and PluginPath inputs must be checked to determine the request is falsepositive or not.
     - Vulnerability scans.
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0002
techniques:
    - T1190
tags:
    - attack.execution
    - attack.t1190
author: Ziya DENİZ
version: "1"
references:
    - https://rhinosecuritylabs.com/research/cve-2024-2389-in-progress-flowmon/
data_sources:
    - webserver
