id: 019ab1d2-7f0b-7238-90d5-25047efeca55
name: Lumma Stealer C2 Communication - museumtespaceorsp.shop
description: Detects HTTP/HTTPS POST requests to known Lumma Stealer C2 domain
query: |
    title: Lumma Stealer C2 Communication - museumtespaceorsp.shop
    status: experimental
    description: Detects HTTP/HTTPS POST requests to known Lumma Stealer C2 domain
    references:
      - https://www.joesandbox.com/analysis/1448921
      - >-
        https://any.run/report/a6e7292e734c3a15cfa654bba8dea72a2f55f1c24cf6bbdc2fd7e63887e9315a
    logsource:
      category: proxy
      product: firewall
    detection:
      selection_domain:
        c-uri|contains: museumtespaceorsp.shop
      selection_path:
        cs-uri-stem|contains:
          - /api
          - /c2sock
      condition: selection_domain or (selection_domain and selection_path)
    falsepositives:
      - None expected
    level: critical
    tags:
      - attack.command_and_control
      - attack.t1071.001
      - attack.exfiltration
      - attack.t1041
query_type: sigma
severity: medium
tactics:
    - TA0011
    - TA0010
techniques:
    - T1071.001
    - T1041
tags:
    - attack.command_and_control
    - attack.t1071.001
    - attack.exfiltration
    - attack.t1041
version: "2"
references:
    - https://www.joesandbox.com/analysis/1448921
    - https://any.run/report/a6e7292e734c3a15cfa654bba8dea72a2f55f1c24cf6bbdc2fd7e63887e9315a
data_sources:
    - proxy
    - firewall
