id: 019ae121-c1b5-768f-bcb2-80676766fd0a
name: ShadyPanda Malicious Edge Add-on ID
description: Detects the presence of malicious Microsoft Edge add-on IDs associated with the ShadyPanda campaign. These extensions are part of an active spyware operation affecting millions of users by exfiltrating browsing history, search queries, and other sensitive data.
query: |
    title: ShadyPanda Malicious Edge Add-on ID
    id: fd09a458-58eb-4537-993b-ca69748a9ae3
    status: experimental
    description: Detects the presence of malicious Microsoft Edge add-on IDs
      associated with the ShadyPanda campaign. These extensions are part of an
      active spyware operation affecting millions of users by exfiltrating browsing
      history, search queries, and other sensitive data.
    references:
      - https://www.koi.ai/blog/4-million-browsers-infected-inside-shadypanda-7-year-malware-campaign
    author: detections.ai
    date: 2025-12-02
    tags:
      - attack.t1574.005
      - attack.defense_evasion
    logsource:
      category: file_event
      product: windows
    detection:
      # Detects the base path for Microsoft Edge extensions
      base_path:
        file.path|contains|all:
          - '\Microsoft\Edge\User Data\'
          - '\Extensions\'
        # List of malicious extension IDs provided in the report
      extension_ids:
        file.path|contains:
          - 'aadnmeanpbokjjahcnikajejglihibpd'
          - 'acogeoajdpgplfhidldckbjkkpgeebod'
          - 'afooldonhjnhddgnfahlepchipjennab'
          - 'agdlpnhabjfcbeiempefhpgikapcapjb'
          - 'ahebpkbnckhgjmndfjejibjjahjdlhdb'
          - 'akialmafcdmkelghnomeneinkcllnoih'
          - 'alknmfpopohfpdpafdmobclioihdkhjh'
          - 'bafbmfpfepdlgnfkgfbobplkkaoakjcl'
          - 'bbdioggpbhhodagchciaeaggdponnhpa'
          - 'bdhjinjoglaijpffoamhhnhooeimgoap'
          - 'bjdclfjlhgcdcpjhmhfggkkfacipilai'
          - 'bmlifknbfonkgphkpmkeoahgbhbdhebh'
          - 'bboeoilakaofjkdmekpgeigieokkpgfn'
          - 'boiciofdokedkpmopjnghpkgdakmcpmb'
          - 'bpelnogcookhocnaokfpoeinibimbeff'
          - 'bpngofombcjloljkoafhmpcjclkekfbh'
          - 'bppelgkcnhfkicolffhlkbdghdnjdkhi'
          - 'cacbflgkiidgcekflfgdnjdnaalfmkob'
          - 'cbijiaccpnkbdpgbmiiipedpepbhioel'
          - 'cbkogccidanmoaicgphipbdofakomlak'
          - 'ccdimkoieijdbgdlkfjjfncmihmlpanj'
          - 'cgehahdmoijenmnhinajnojmmlnipckl'
          - 'cgjgmbppcoolfkbkjhoogdpkboohhgel'
          - 'chmcepembfffejphepoongapnlchjgil'
          - 'dbagndmcddecodlmnlcmhheicgkaglpk'
          - 'dfakjobhimnibdmkbgpkijoihplhcnil'
          - 'dhjmmcjnajkpnbnbpagglbbfpbacoffm'
          - 'dkkpollfhjoiapcenojlmgempmjekcla'
          - 'dmpceopfiajfdnoiebfankfoabfehdpn'
          - 'domfmjgbmkckapepjahpedlpdedmckbj'
          - 'ebileebbekdcpfjlekjapgmbgpfigled'
          - 'ehmnkbambjnodfbjcebjffilahbfjdml'
          - 'eholblediahnodlgigdkdhkkpmbiafoj'
          - 'ejdihbblcbdfobabjfebfjfopenohbjb'
          - 'ejfocpkjndmkbloiobcdhkkoeekcpkik'
          - 'ekndlocgcngbpebppapnpalpjfnkoffh'
          - 'elckfehnjdbghpoheamjffpdbbogjhie'
          - 'emiocjgakibimbopobplmfldkldhhiad'
          - 'enaigkcpmpohpbokbfllbkijmllmpafm'
          - 'enkihkfondbngohnmlefmobdgkpmejha'
          - 'fbbmnieefocnacnecccgmedmcbhlkcpm'
          - 'fcidgbgogbfdcgijkcfdjcagmhcelpbc'
          - 'fckphkcbpgmappcgnfieaacjbknhkhin'
          - 'ffgihbmcfcihmpbegcfdkmafaplheknk'
          - 'fhababnomjcnhmobbemagohkldaeicad'
          - 'fjigdpmfeomndepihcinokhcphdojepm'
          - 'fjioinpkgmlcioajfnncgldldcnabffe'
          - 'fkbcbgffcclobgbombinljckbelhnpif'
          - 'fmgfcpjmmapcjlknncjgmbolgaecngfo'

          - 'fnnigcfbmghcefaboigkhfimeolhhbcp'
          - 'fodcokjckpkfpegbekkiallamhedahjd'
          - 'fomlombffdkflbliepgpgcnagolnegjn'
          - 'fpokgjmlcemklhmilomcljolhnbaaajk'
          - 'fppchnhginnfabgenhihpncnphhafmac'
          - 'gbcjipmcpedgndgdnfofbhgnkmghoamm'
          - 'gdnhikbabcflemolpeaaknnieodgpiie'
          - 'ghaggkcfafofhcfppignflhlocmcfimd'
          - 'ghhddclfklljabeodmcejjjlhoaaiban'
          - 'gkanlgbbnncfafkhlchnadcopcgjkfli'
          - 'gkhggnaplpjkghjjcmpmnmidjndojpcn'
          - 'glfddenhiaacfmhoiebfeljnfkkkmbjb'
          - 'googojfbnbhbbnpfpdnffnklipgifngn'
          - 'gpolcigkhldaighngmmmcjldkkiaonbg'
          - 'hadkldcldaanpomhhllacdmglkoepaed'
          - 'hajlmbnnniemimmaehcefkamdadpjlfa'
          - 'hbghbdhfibifdgnbpaogepnkekonkdgc'
          - 'hdfknlljfbdfjdjhfgoonpphpigjjjak'
          - 'hegpgapbnfiibpbkanjemgmdpmmlecbc'
          - 'hfeialplaojonefabmojhobdmghnjkmf'
          - 'hgolomhkdcpmbgckhebdhdknaemlbbaa'
          - 'hiodlpcelfelhpinhgngoopbmclcaghd'
          - 'hjfmkkelabjoojjmjljidocklbibphgl'
          - 'hlglicejgohbanllnmnjllajhmnhjjel'
          - 'hmbacpfgehmmoloinfmkgkpjoagiogai'
          - 'hofaaigdagglolgiefkbencchnekjejl'
          - 'hohobnhiiohgcipklpncfmjkjpmejjni'
          - 'iaccapfapbjahnhcmkgjjonlccbhdpjl'
          - 'ibfpbjfnpcgmiggfildbcngccoomddmj'
          - 'ibmgdfenfldppaodbahpgcoebmmkdbac'
          - 'idjhfmgaddmdojcfmhcjnnbhnhbmhipd'
          - 'iedkeilnpbkeecjpmkelnglnjpnacnlh'
          - 'igiakpjhacibmaichhgbagdkjmjbnanl'
          - 'ikajognfijokhbgjdhgpemljgcjclpmn'
          - 'ikgaleggljchgbihlaanjbkekmmgccam'
          - 'ikkoanocgpdmmiamnkogipbpdpckcahn'
          - 'ileojfedpkdbkcchpnghhaebfoimamop'
          - 'ipnidmjhnoipibbinllilgeohohehabl'
          - 'iphacjobmeoknlhenjfiilbkddgaljad'
          - 'ipokalojgdmhfpagmhnjokidnpjfnfik'
          - 'jbajdpebknffiaenkdhopebkolgdlfaf'
          - 'jelgelidmodjpmohbapbghdgcpncahki'
          - 'jhgfinhjcamijjoikplacnfknpchndgb'
          - 'jiiggekklbbojgfmdenimcdkmidnfofl'
          - 'jocnjcakendmllafpmjailfnlndaaklf'
          - 'jpoofbjomdefajdjcimmaoildecebkjc'
          - 'kcpkoopmfjhdpgjohcbgkbjpmbjmhgoi'
          - 'kgmlodoegkmpfkbepkfhgeldidodgohd'
          - 'klggeioacnkkpdcnapgcoicnblliidmf'
          - 'klgjbnheihgnmimajhohfcldhfpjnahe'
          - 'kpfbijpdidioaomoecdbfaodhajbcjfl'
          - 'laholcgeblfbgdhkbiidbpiofdcbpeeo'
          - 'lfgakdlafdenmaikccbojgcofkkhmolj'
          - 'lgnjdldkappogbkljaiedgogobcgemch'
          - 'lhfdakoonenpbggbeephofdlflloghhi'
          - 'ljjngehkphcdnnapgciajcdbcpgmpknc'
          - 'ljkgnegaajfacghepjiajibgdpfmcfip'
          - 'ljmcneongnlaecabgneiippeacdoimaa'
          - 'llilhpmmhicmiaoancaafdgganakopfg'
          - 'lljplndkobdgkjilfmfiefpldkhkhbbd'
          - 'lmnjiioclbjphkggicmldippjojgmldk'
          - 'mddfnhdadbofiifdebeiegecchpkbgdb'
          - 'mnophppbmlnlfobakddidbcgcjakipin'
          - 'ncapkionddmdmfocnjfcfpnimepibggf'
          - 'nchdmembkfgkejljapneliogidkchiop'
          - 'nnceocbiolncfljcmajijmeakcdlffnh'
          - 'nemkiffjklgaooligallbpmhdmmhepll'
          - 'ngbfciefgjgijkkmpalnmhikoojilkob'
          - 'nhdiopbebcklbkpfnhipecgfhdhdbfhb'
          - 'njoedigapanaggiabjafnaklppphempm'
          - 'nkjomoafjgemogbdkhledkoeaflnmgfi'
          - 'nlcebdoehkdiojeahkofcfnolkleembf'
          - 'nokknhlkpdfppefncfkdebhgfpfilieo'
          - 'oaacndacaoelmkhfilennooagoelpjop'
          - 'oghgaghnofhhoolfneepjneedejcpiic'
          - 'omkjakddaeljdfgekdjebbbiboljnalk'
          - 'onifebiiejdjncjpjnojlebibonmnhog'
          - 'opakkgodhhongnhbdkgjgdlcbknacpaa'
          - 'opncjjhgbllenobgbfjbblhghmdpmpbj'
          - 'paghkadkhiladedijgodgghaajppmpcg'
          - 'papedehkgfhnagdiempdbhlgcnioofnd'
          - 'pkjfghocapckmendmgdmppjccbplccbg'
      condition: base_path and 1 of extension_ids
    falsepositives:
      - This rule is based on specific extension IDs and paths, making false
        positives unlikely. The detection is most effective when monitoring for
        directory or file creation events.
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
    - TA0004
    - TA0005
techniques:
    - T1574
    - T1574.005
tags:
    - attack.t1574.005
    - attack.defense_evasion
author: detections.ai
version: "2"
references:
    - https://www.koi.ai/blog/4-million-browsers-infected-inside-shadypanda-7-year-malware-campaign
data_sources:
    - file_event
    - windows
