id: 019aa5b9-cae8-717d-9ea1-f4f151edda5d
name: Suspicious PowerShell Execution from Script Host
description: Detects the execution of a hidden PowerShell process with a bypassed execution policy, spawned from a script host process (cscript.exe or wscript.exe). This behavior is indicative of a multi-stage dropper, as observed in the analysis of a batch file that uses a VBScript to launch a PowerShell stager invisibly.
query: |
    title: Suspicious PowerShell Execution from Script Host
    id: faa882a0-2e10-4453-988f-763db5f9a6c4
    status: experimental
    description: >-
      Detects the execution of a hidden PowerShell process with a bypassed execution
      policy, spawned from a script host process (cscript.exe or wscript.exe). This
      behavior is indicative of a multi-stage dropper, as observed in the analysis
      of a batch file that uses a VBScript to launch a PowerShell stager invisibly.
    references:
      - https://medium.com/@shubhandrew/analysis-of-bat-file-dropper-19ea60bd8bb6
    author: Subhankar H.
    date: 2025-11-21T00:00:00.000Z
    tags:
      - attack.execution
      - attack.t1059.001
      - attack.t1059.005
      - attack.defense_evasion
      - attack.t1027
    logsource:
      category: process_creation
      product: windows
    detection:
      selection_parent:
        ParentImage|endswith:
          - \cscript.exe
          - \wscript.exe
      selection_child_process:
        Image|endswith: \powershell.exe
      selection_child_flags_short:
        CommandLine|contains|all:
          - '-w hidden'
          - '-nop'
          - '-ex bypass'
      selection_child_flags_long:
        CommandLine|contains|all:
          - '-WindowStyle Hidden'
          - '-NoProfile'
          - '-ExecutionPolicy Bypass'
      condition: >-
        selection_child_process and selection_parent and (1 of
        selection_child_flags_*)
    falsepositives:
      - Legitimate administrative scripts.
    level: high
query_type: sigma
severity: high
tactics:
    - TA0002
    - TA0005
techniques:
    - T1059.001
    - T1059.005
    - T1027
    - T1564.003
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1059.005
    - attack.defense_evasion
    - attack.t1027
author: Subhankar H.
version: "3"
references:
    - https://medium.com/@shubhandrew/analysis-of-bat-file-dropper-19ea60bd8bb6
data_sources:
    - process_creation
    - windows
