id: 019aa6e0-ee98-71db-8713-caebef3fb805
name: Kimsuky/XWorm Suspicious Archive Extraction
description: Detects the execution of the UnRAR utility with a password to extract an archive. This technique is used by threat actors like the Kimsuky group and XWorm RAT to deliver malicious payloads.
query: |
    title: Kimsuky/XWorm Suspicious Archive Extraction
    id: e2052039-0cbe-4eb1-84d8-10bd29e0fba6
    status: experimental
    description: >-
      Detects the execution of the UnRAR utility with a password to extract an
      archive. This technique is used by threat actors like the Kimsuky group and
      XWorm RAT to deliver malicious payloads.
    references:
      - >-
        https://medium.com/@shubhandrew/analysis-of-kimsuky-apt-group-powershell-payloads-one-of-them-attributed-to-xworm-rat-ea8a96ea53fe
    author: Subhankar H.
    date: 2025-11-21T00:00:00.000Z
    tags:
      - attack.t1105
      - attack.t1218
      - attack.g0094
    logsource:
      category: process_creation
      product: windows
    detection:
      selection:
        OriginalFileName: UnRAR.exe
        CommandLine|contains: '-p'
      condition: selection
    falsepositives:
      - Legitimate administrative scripts.
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0011
    - TA0005
techniques:
    - T1105
    - T1218
tags:
    - attack.t1105
    - attack.t1218
    - attack.g0094
author: Subhankar H.
version: "2"
references:
    - https://medium.com/@shubhandrew/analysis-of-kimsuky-apt-group-powershell-payloads-one-of-them-attributed-to-xworm-rat-ea8a96ea53fe
data_sources:
    - process_creation
    - windows
