id: 019ae568-5c61-72a8-82cb-ebab798f9b4a
name: Evilginx Phishing Domains
description: Detects network connections to domains known to be used as infrastructure for an ongoing, highly evasive Evilginx phishing campaign targeting SSO portals.
query: |
    title: Evilginx Phishing Domains
    id: b86acb4b-dd0c-4cab-9e3f-f5d892c1792b
    status: experimental
    description: Detects network connections to domains known to be used as
      infrastructure for an ongoing, highly evasive Evilginx phishing campaign
      targeting SSO portals.
    references:
      - https://blogs.infoblox.com/threat-intelligence/dns-uncovers-infrastructure-used-in-sso-attacks/
    author: detections.ai
    date: 2025-12-03
    tags:
      - attack.initial_access
      - attack.t1566.002
      - attack.t1568.002
    logsource:
      category: network
      product: any
    detection:
      selection:
        # List of domains associated with the Evilginx campaign. 'endswith' is used to match subdomains as well.
        destination.domain|endswith:
          - 'acmsquared.com'
          - 'ads2ads.com'
          - 'aghomesandproperties.com'
          - 'allwebdirectories.com'
          - 'amj-international.com'
          - 'apartamentosmalaga.com'
          - 'armingaud.com'
          - 'bazmepaigham.com'
          - 'bedrijvenregister.com'
          - 'bestshayari.com'
          - 'brillianceboundielts.com'
          - 'brownak.com'
          - 'buildonhope.com'
          - 'cappadociavisittours.com'
          - 'catering-amato.com'
          - 'cccsok.com'
          - 'citywideprayer.com'
          - 'controlunlimited.com'
          - 'coralridgehour.com'
          - 'dartsinireland.com'
          - 'data-logistics.com'
          - 'dhoughton.com'
          - 'dogcuty.com'
          - 'e-briefe.com'
          - 'eggcoo.com'
          - 'eheringe-trauringe.com'
          - 'ehsantrust.com'
          - 'esdetodo.com'
          - 'fluffybascha.com'
          - 'forty-something.com'
          - 'freaksandfriends.com'
          - 'geegletee.com'
          - 'georgiayr.com'
          - 'goraba.com'
          - 'hafikoman.com'
          - 'heisseliebe.com'
          - 'hurenkontakte.com'
          - 'ideallivingsolutions.com'
          - 'igreensoft.com'
          - 'ilchirone.com'
          - 'impexinc.com'
          - 'inkdchronicles.com'
          - 'intellipex.com'
          - 'intercuba.com'
          - 'ispamembers.com'
          - 'jimmylange.com'
          - 'joshuasdodds.com'
          - 'kbdav.com'
          - 'l2storm.com'
          - 'littlenuggetsco.com'
          - 'lost-signal.com'
          - 'lpdeco.com'
          - 'monnalissaboutique.com'
          - 'mpoterbaru2024.com'
          - 'mykidsfashion.com'
          - 'northstarcouncil.com'
          - 'qrcodespoweredbygs1.com'
          - 'schnaitsee.com'
          - 'sercanaydin.com'
          - 'srpskazemlja.com'
          - 'thelovecity.com'
          - 'thermalresistivity.com'
          - 'transusasia.com'
          - 'tubeunderwater.com'
          - 'weddingsarahetemmanuel.com'
          - 'winbet299mas.com'
          - 'yoopuipui.com'
      condition: selection
    falsepositives:
      - Unlikely, as this detection is based on a list of known malicious domains.
    level: high
query_type: sigma
severity: high
tactics:
    - TA0001
    - TA0006
techniques:
    - T1566.002
    - T1566
    - T1539
tags:
    - attack.initial_access
    - attack.t1566.002
    - attack.t1568.002
author: detections.ai
version: "2"
references:
    - https://blogs.infoblox.com/threat-intelligence/dns-uncovers-infrastructure-used-in-sso-attacks/
data_sources:
    - network
    - any
