id: 019b74d2-4e3b-747d-9b6f-a6626fdcd8cd
name: .NET Deserialization Guard Bypass Attempt
description: Detects an attempt to disable .NET deserialization safeguards by modifying the 'disableActivitySurrogateSelectorTypeCheck' field. This technique was observed in an APT36 campaign where it was used to prepare the environment for the in-memory execution of a malicious DLL via unsafe deserialization.
query: |
    title: .NET Deserialization Guard Bypass Attempt
    id: 60e29dc2-84dd-4885-8d8a-db840962eb7e
    status: experimental
    description: Detects an attempt to disable .NET deserialization safeguards by
      modifying the 'disableActivitySurrogateSelectorTypeCheck' field. This
      technique was observed in an APT36 campaign where it was used to prepare the
      environment for the in-memory execution of a malicious DLL via unsafe
      deserialization.
    references:
      - https://www.cyfirma.com/research/apt36-multi-stage-lnk-malware-campaign-targeting-indian-government-entities/
    author: timdetections.ai
    date: 2025-12-31
    tags:
      - attack.t1059.005
      - attack.g0064
    logsource:
      category: process_creation
      product: windows
    detection:
      selection_process:
        Image|endswith: '\mshta.exe' # This technique was observed being executed by mshta.exe in the APT36 campaign.
      selection_cli:
        CommandLine|contains|all:
          - 'disableActivitySurrogateSelectorTypeCheck' # Specific .NET field targeted for modification.
          - 'true' # The value set to disable the security check.
      condition: all of selection_*
    falsepositives:
      - Unlikely
    level: high
query_type: sigma
severity: high
tactics:
    - TA0002
    - TA0005
techniques:
    - T1059
    - T1218.005
tags:
    - attack.t1059.005
    - attack.g0064
author: tim@detections.ai
version: "3"
references:
    - https://www.cyfirma.com/research/apt36-multi-stage-lnk-malware-campaign-targeting-indian-government-entities/
data_sources:
    - process_creation
    - windows
