id: 019b5b1e-73da-77bc-9f6f-36dd3dfa1a42
name: ColdFusion WDDX JNDI Injection Attempt
description: Detects HTTP POST requests containing WDDX XML payloads that attempt to exploit a deserialization vulnerability in Adobe ColdFusion (CVE-2023-26359). The attack leverages a JNDI injection with the 'com.sun.rowset.JdbcRowSetImpl' gadget chain.
query: |
    title: ColdFusion WDDX JNDI Injection Attempt
    id: 510024f0-81cc-4556-af59-372819373cae
    status: experimental
    description: >-
      Detects HTTP POST requests containing WDDX XML payloads that attempt to
      exploit a deserialization vulnerability in Adobe ColdFusion (CVE-2023-26359).
      The attack leverages a JNDI injection with the 'com.sun.rowset.JdbcRowSetImpl'
      gadget chain.
    references:
      - https://www.labs.greynoise.io/grimoire/2025-12-26-coldfusion/
    author: timdetections.ai
    date: 2025-12-26T00:00:00.000Z
    tags:
      - attack.initial_access
      - attack.t1190
      - attack.t1059.007
      - cve.2023.26359
    logsource:
      category: webserver
      service: apache
    detection:
      selection_base:
        http.method: 'POST'
        http.request.body|contains|all:
          - "<struct type='com.sun.rowset.JdbcRowSetImpl'>"
          - "<var name='dataSourceName'>"
      selection_protocol:
        http.request.body|contains:
          - 'ldap://'
          - 'rmi://'
      condition: selection_base and selection_protocol
    falsepositives:
      - This activity may be generated by vulnerability scanners or security
        researchers. However, such usage in a production environment is highly
        suspicious.
    level: high
    associated_cves:
      - CVE-2023-26359
query_type: sigma
severity: high
tactics:
    - TA0001
techniques:
    - T1190
tags:
    - attack.initial_access
    - attack.t1190
    - attack.t1059.007
    - cve.2023.26359
author: timdetections.ai
version: "4"
references:
    - https://www.labs.greynoise.io/grimoire/2025-12-26-coldfusion/
data_sources:
    - webserver
