id: 019bfcb0-c5d0-761c-8ca8-6d0f609af5c2
name: GOGITTER VBScript Execution
description: Detects the execution of a VBScript file named 'windows_api.vbs' from common public or appdata directories, a characteristic behavior of the GOGITTER malware as part of the Gopher Strike campaign.
query: |
    title: GOGITTER VBScript Execution
    id: 01a75821-1e40-4365-8357-1224667203b8
    status: experimental
    description: >-
      Detects the execution of a VBScript file named 'windows_api.vbs' from common
      public or appdata directories, a characteristic behavior of the GOGITTER
      malware as part of the Gopher Strike campaign.
    references:
      - >-
        https://www.zscaler.com/blogs/security-research/apt-attacks-target-indian-government-using-gogitter-gitshellpad-and-goshell
    author: detections.ai
    date: 2026-01-27T00:00:00.000Z
    tags:
      - attack.execution
      - attack.t1059.005
      - attack.defense_evasion
      - attack.t1036.005
    logsource:
      category: process_creation
      product: windows
    detection:
      selection_process:
        Image|endswith:
          - \wscript.exe
          - \cscript.exe
      selection_path_1:
        CommandLine|contains|all:
          - \Users\Public\Downloads\
          - windows_api.vbs
      selection_path_2:
        CommandLine|contains|all:
          - \Users\Public\Pictures\
          - windows_api.vbs
      selection_path_3:
        CommandLine|contains|all:
          - \AppData\Roaming\
          - windows_api.vbs
      condition: selection_process and 1 of selection_path_*
    falsepositives:
      - Legitimate scripts with the same name, although unlikely in these specific
        locations.
    level: high
query_type: sigma
severity: high
tactics:
    - TA0002
    - TA0005
techniques:
    - T1059.005
    - T1036.005
tags:
    - attack.execution
    - attack.t1059.005
    - attack.defense_evasion
    - attack.t1036.005
author: detections.ai
version: "2"
references:
    - https://www.zscaler.com/blogs/security-research/apt-attacks-target-indian-government-using-gogitter-gitshellpad-and-goshell
data_sources:
    - process_creation
    - windows
