id: 019c9b97-3063-716b-8327-9e9d32dbf477
name: Windows Event Logs Cleared
description: Detects clearing of Windows event logs. This can be used to hide what happened on a host.
query: |
    title: Windows Event Logs Cleared
    id: 4f1a2c3b-7d8e-4a9b-8c0d-1e2f3a4b5c6d
    status: experimental
    description: >-
      Detects clearing of Windows event logs. This can be used to hide what happened
      on a host.
    author: Daniel Jeremiah
    date: 2026-02-26T00:00:00.000Z
    references:
      - >-
        https://thedfirreport.com/2026/02/23/apache-activemq-exploit-leads-to-lockbit-ransomware/
    logsource:
      product: windows
      service: security
    detection:
      selection_1102:
        EventID: 1102
      selection_104_system:
        Channel: System
        EventID: 104
      selection_104_application:
        Channel: Application
        EventID: 104
      condition: selection_1102 or selection_104_system or selection_104_application
    falsepositives:
      - >-
        Some organisations clear logs during approved maintenance, confirm change
        records
    level: high
    tags:
      - attack.defense_evasion
      - attack.t1070.001
query_type: sigma
severity: medium
tactics:
    - TA0005
techniques:
    - T1070.001
tags:
    - attack.defense_evasion
    - attack.t1070.001
author: Daniel Jeremiah
version: "2"
references:
    - https://thedfirreport.com/2026/02/23/apache-activemq-exploit-leads-to-lockbit-ransomware/
data_sources:
    - windows
    - security
