id: 019cca1c-80dd-727f-928f-241f7ab7e627
name: Linux VNC Application Usage
description: Detects VNC-based activities. Looking for specific VNC processes
query: |
    title: Linux VNC Application Usage
    id: 72ee52da-31e1-40bb-9726-31366e13b036
    status: experimental
    description: Detects VNC-based activities. Looking for specific VNC processes
    references:
      - https://attack.mitre.org/techniques/T1021/005/
    author: zendannyy
    date: 2026-03-05T00:00:00.000Z
    tags:
      - attack.lateral_movement
      - attack.t1021.005
      - linux.vnc
    logsource:
      category: network_connection
      product: linux
    detection:
      selection_vnc_ports:
        dst_port:
          - 5900
          - 5901
          - 5902
          - 5903
      selection_vnc_process:
        Image|endswith:
          - tightvnc
          - vncserver
          - x11vnc
      selection_successful_connection:
        connection_state: established
      condition: >-
        selection_vnc_ports and selection_vnc_process and
        selection_successful_connection
    falsepositives:
      - Legitimate remote desktop access by an admin
      - Remote administration
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0008
techniques:
    - T1021.005
tags:
    - attack.lateral_movement
    - attack.t1021.005
    - linux.vnc
author: zendannyy
version: "1"
references:
    - https://attack.mitre.org/techniques/T1021/005/
data_sources:
    - network_connection
    - linux
