id: 019c1eaa-518b-7385-b54b-476f2113debb
name: TA584 Infrastructure IOCs (IP)
description: Detects network traffic to or from known IP addresses associated with TA584 command and control (C2) servers and hosting infrastructure. This actor is a known initial access broker, and infections can lead to ransomware.
query: |
    title: TA584 Infrastructure IOCs (IP)
    id: b5c8ac65-8bc6-493c-8caa-e0b4aedbf910
    status: experimental
    description: Detects network traffic to or from known IP addresses associated
      with TA584 command and control (C2) servers and hosting infrastructure. This
      actor is a known initial access broker, and infections can lead to ransomware.
    references:
      - https://www.proofpoint.com/us/blog/threat-insight/cant-stop-wont-stop-ta584-innovates-initial-access
    author: detections.ai
    date: 2026-02-02
    tags:
      - attack.command_and_control
      - attack.t1071
    logsource:
      category: network_connection
    detection:
      # List of known TA584 C2 and hosting IPs from Proofpoint report
      ips:
        - '94.159.113.37' # TA584 Host
        - '85.236.25.119' # Tsundere Bot C2
        - '80.64.19.148' # XWorm C2
        - '85.208.84.208' # XWorm C2
        - '178.16.52.242' # XWorm C2
        - '94.159.113.64' # XWorm C2
        - '193.17.183.126' # Tsundere Bot C2
      selection_destination:
        DestinationIp|contains: ips
      selection_source:
        SourceIp|contains: ips
      condition: 1 of them
    falsepositives:
      - These IP addresses could be reassigned to benign services in the future. It
        is recommended to verify the current status of these indicators before
        alerting.
    level: high
query_type: sigma
severity: high
tactics:
    - TA0011
    - TA0001
    - TA0042
techniques:
    - T1071
    - T1650
tags:
    - attack.command_and_control
    - attack.t1071
author: detections.ai
version: "2"
references:
    - https://www.proofpoint.com/us/blog/threat-insight/cant-stop-wont-stop-ta584-innovates-initial-access
data_sources:
    - network_connection
