id: 019cca1e-8717-75fe-8138-3fd7744e6600
name: Linux VNC Lateral Movement
description: Detects VNC-based lateral movement activities. East to West traffic
query: |
    title: Linux VNC Lateral Movement
    id: 9015766d-6e74-4ea4-9d09-b6fcbb37fa54
    status: experimental
    description: Detects VNC-based lateral movement activities. East to West traffic
    references:
      - https://attack.mitre.org/techniques/T1021/005/
    author: zendannyy
    date: 2026-03-05T00:00:00.000Z
    tags:
      - attack.lateral_movement
      - attack.t1021.005
      - linux.vnc
    logsource:
      category: network_connection
      product: linux
    detection:
      selection_vnc_ports:
        dst_port:
          - 5900
          - 5901
          - 5902
          - 5903
      selection_internal_ip:
        src_ip|cidr:
          - 10.0.0.0/8
          - 172.16.0.0/12
          - 192.168.0.0/16
        dst_ip|cidr:
          - 10.0.0.0/8
          - 172.16.0.0/12
          - 192.168.0.0/16
      selection_successful_connection:
        connection_state: established
      condition: >-
        selection_vnc_ports and selection_internal_ip and
        selection_successful_connection
    falsepositives:
      - Legitimate remote desktop access by an admin
      - Remote administration
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0008
techniques:
    - T1021.005
tags:
    - attack.lateral_movement
    - attack.t1021.005
    - linux.vnc
author: zendannyy
version: "1"
references:
    - https://attack.mitre.org/techniques/T1021/005/
data_sources:
    - network_connection
    - linux
