id: 019ca349-cec1-769e-8062-03e9a004ebaf
name: .NET Process Hollowing InstallUtil case study
description: This detection identifies activity related to .NET Process Hollowing, specifically focusing on the use of InstallUtil.exe as the target process. It triggers when InstallUtil.exe attempts to access a source image located in a user's AppData or Temp directory, with a file extension of .exe or .bin. This behavior is indicative of a specific threat intelligence report detailing process hollowing techniques involving InstallUtil.exe. A match suggests a strong reason for investigation, as it aligns with published threat reporting, though it does not confirm compromise or success of the activity.
query: |
    title: ".NET Process Hollowing InstallUtil case study"
    id: e649bc51-8306-417f-8355-4c00648faaab
    status: experimental
    description: >-
      This detection identifies activity related to .NET Process Hollowing,
      specifically focusing on the use of InstallUtil.exe as the target process. It
      triggers when InstallUtil.exe attempts to access a source image located in a
      user's AppData or Temp directory, with a file extension of .exe or .bin. This
      behavior is indicative of a specific threat intelligence report detailing
      process hollowing techniques involving InstallUtil.exe. A match suggests a
      strong reason for investigation, as it aligns with published threat reporting,
      though it does not confirm compromise or success of the activity.
    author: Daniel Jeremiah
    date: 2026-02-25T00:00:00.000Z
    references:
      - >-
        https://cloud.google.com/blog/topics/threat-intelligence/time-travel-debugging-using-net-process-hollowing
    logsource:
      product: windows
      service: sysmon
      category: process_access
    detection:
      selection_event:
        EventID: 8
        TargetImage|endswith: \InstallUtil.exe
      selection_source_susp:
        SourceImage|re: (?i)\\Users\\.*\\(AppData\\|Temp\\)\\.*\.(exe|bin)$
      condition: selection_event and selection_source_susp
    level: medium
    tags:
      - attack.t1055.012
      - attack.t1218
      - attack.t1059
    falsepositives:
      - "Rare: security tooling that injects into InstallUtil for monitoring
        (validate signer)"
query_type: sigma
severity: medium
tactics:
    - TA0005
    - TA0004
    - TA0002
techniques:
    - T1055.012
    - T1218
    - T1059
    - T1218.004
tags:
    - attack.t1055.012
    - attack.t1218
    - attack.t1059
author: Daniel Jeremiah
version: "5"
references:
    - https://cloud.google.com/blog/topics/threat-intelligence/time-travel-debugging-using-net-process-hollowing
data_sources:
    - windows
    - sysmon
