id: 019cefc4-6863-732d-989d-2fdfd5c0fe6b
name: Linux Setcap Assuming All Capabilities
description: |
    Detects the use of the 'setcap' utility with parameters that assign all Linux capabilities to a binary file.
    This capability can be abused to create a backdoored binary, for privilege escalation, and bypassing security controls.
query: |
    title: Linux Setcap Assuming All Capabilities
    id: 1928dd52-1453-43ae-b8a8-d210c704cf4a
    status: test
    description: >
      Detects the use of the 'setcap' utility with parameters that assign all Linux
      capabilities to a binary file.

      This capability can be abused to create a backdoored binary, for privilege
      escalation, and bypassing security controls.
    references:
      - https://man7.org/linux/man-pages/man8/setcap.8.html
      - https://man7.org/linux/man-pages/man7/cap_text_formats.7.html
    author: zendanny
    date: 2026-03-11T00:00:00.000Z
    tags:
      - attack.defense-evasion
      - attack.privilege-escalation
      - attack.persistence
      - attack.t1554
    logsource:
      product: linux
      category: process_creation
      service: audit
    detection:
      selection_all:
        Image|endswith: /setcap
        CommandLine|contains:
          - ' ='
          - ' all='
      selection_explicit:
        Image|endswith: /setcap
        CommandLine|contains:
          - ' =e'
          - ' =i'
          - ' =p'
      condition: selection_all or selection_explicit
    falsepositives:
      - Development/Debugging
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0005
    - TA0004
    - TA0003
techniques:
    - T1554
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1554
author: zendanny
version: "2"
references:
    - https://man7.org/linux/man-pages/man8/setcap.8.html
    - https://man7.org/linux/man-pages/man7/cap_text_formats.7.html
data_sources:
    - process_creation
    - linux
    - audit
