id: 019c1d09-06b3-71cf-a6d6-db2d4bc09e62
name: Potential UAC Bypass via ICMLuaUtil
description: The rule detects the execution of dllhost.exe where the command line includes the Class ID (CLSID) for the CMSTPLUA or ICMLuaUtil interfaces.
query: |
    title: Potential UAC Bypass via ICMLuaUtil
    id: 23e026e5-6126-4b39-a2e7-c410a4009ea3
    status: experimental
    description: >-
      The rule detects the execution of dllhost.exe where the command line includes
      the Class ID (CLSID) for the CMSTPLUA or ICMLuaUtil interfaces.
    references:
      - https://www.varonis.com/blog/blackcat-ransomware
    author: Daniel Koifman (KoifSec, CardinalOps)
    date: 2026-02-02T00:00:00.000Z
    tags:
      - attack.execution
      - attack.privilege-escalation
      - attack.defense-evasion
      - attack.t1559.001
      - attack.t1548.002
    logsource:
      product: windows
      category: process_creation
      service: security
    detection:
      selection_img:
        - Image|startswith: \dllhost.exe
        - OriginalFileName: dllhost.exe
      selection_command:
        - CommandLine|contains:
            - Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}
            - Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}
      condition: all of selection_*
    level: medium
query_type: sigma
severity: medium
techniques:
    - T1559.001
    - T1548.002
tags:
    - attack.execution
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1559.001
    - attack.t1548.002
author: Daniel Koifman (KoifSec, CardinalOps)
version: "2"
references:
    - https://www.varonis.com/blog/blackcat-ransomware
data_sources:
    - process_creation
    - windows
    - security
