id: 019cdcfa-2446-72c9-879e-60a74007f4f7
name: AWS Typosquatted Phishing Domain DNS Query
description: Detects DNS queries for domains associated with an active adversary-in-the-middle (AiTM) phishing campaign targeting AWS credentials.
query: |
    title: AWS Typosquatted Phishing Domain DNS Query
    id: e73826d2-abe4-4812-aed0-a49cc2b48986
    status: experimental
    description: >-
      Detects DNS queries for domains associated with an active
      adversary-in-the-middle (AiTM) phishing campaign targeting AWS credentials.
    author: tim@detections.ai
    references:
      - >-
        https://securitylabs.datadoghq.com/articles/behind-the-console-aws-aitm-phishing-campaign/
    date: 2026-03-11T00:00:00.000Z
    tags:
      - attack.initial_access
      - attack.credential_access
      - attack.t1566.002
      - attack.t1583.001
    logsource:
      category: dns
      product: aws
    detection:
      selection:
        dns.question.name|endswith:
          - cloud-recovery.net
          - cloud-policy.com
          - cloud-recovery.us
      condition: selection
    falsepositives:
      - These domains are highly specific to this phishing campaign, so the risk of
        false positives is considered low.
    level: high
query_type: sigma
severity: high
tactics:
    - TA0001
    - TA0042
techniques:
    - T1566.002
    - T1583.001
tags:
    - attack.initial_access
    - attack.credential_access
    - attack.t1566.002
    - attack.t1583.001
author: tim@detections.ai
version: "3"
references:
    - https://securitylabs.datadoghq.com/articles/behind-the-console-aws-aitm-phishing-campaign/
data_sources:
    - dns
    - all
