id: 019c8921-0554-721a-97e0-9bf57a5de7a2
name: Suspected MultiRAT IOCs Detected
description: This rule detects known Indicators of Compromise (IOCs) associated with Remcos RAT activity, including file hashes, command and control (C2) domains, and specific URL paths used for malware delivery.
query: |
    title: Suspected MultiRAT IOCs Detected
    id: ca68b1bc-bac6-4ec4-a330-f9e82dabf3ab
    status: experimental
    description: >-
      This rule detects known Indicators of Compromise (IOCs) associated with Remcos
      RAT activity, including file hashes, command and control (C2) domains, and
      specific URL paths used for malware delivery.
    author: Adarsh Pandey
    date: 2026-02-23T00:00:00.000Z
    tags:
      - attack.command_and_control
      - attack.execution
      - attack.t1105
      - attack.s0332
    logsource:
      category: dns
      product: windows
    detection:
      selection_hashes:
        - md5:
            - c4e78124249a37731c4f545dd1fa82d3
            - 9fecf141f84e1d395ca4242eea5e66bc
            - f22cee63879a0435671894e34f73606b
            - 09e85c4dc5ada3c0e33d24ba2270ec95
            - 3b75064acf7a403c2896f00f2a2eed91
            - 0f23827522cf83c8ec81d82bde2670a4
            - 2a967af456e5dec7ab3c9309504c4997
            - 3b330ec8f01b2f3102a812dd917dece7
            - 9c680e93047283719a65bac1e964862b
            - 91695b27eb95b291303eefb76f6f1496
            - 1d9c98ff562a387578e11e61c787ab8b
            - 56d6d368e27f915668cad8db3497a0a6
            - 698a238edfd0c817e963d7f8c822707e
            - 99062a3f541b007e61fbb486ee11b2a8
            - cf73911e0ca8259e75caaefcda181d8c
            - 3fe52a7b3d39e26dd30800a9fbd95945
            - 64056d2f3bc21a45e4ab8742a904786b
            - 8aa9d35d9026c19e82a9f200bf758e6f
            - 49fa1c9fa746f1807063a9856962f5ab
            - b9c150bcc3f5b109ced6d421698a02e2
            - 08c876c128c66fae857e847bfd3569d4
        - sha1:
            - 304761bf1d071f6c1bfd75bd688608f4782462b2
            - 86daa8d47a2d313521b1db4024a7260c4000e1b8
            - d9d00845a36536c33f1c8af3bb58ef5366611737
            - 7251b5de7f413318b4d989cb82562b2fcb24b44c
            - 9e8b61c6b515ef6f685c67728d28471b38fc2c87
            - 7eec4db7b2ea72624d91ec0dc2c6bf9987a31965
            - f5eebbfd20e17045abb5238dfe972cf0f549ab4b
            - 3522eb62a33289e6cac2a1ea3f8c7206cc9f55b3
            - 887d4a0cd622760e02552d0c11018f55857ebad0
            - 6c6d63951f4810e98cd96c1e1bcec7e780970b52
            - 8be13f9353cfcdf48f782e219c2f9aad0d4f257a
            - b0689d10089dbbec79ddcb6e84be2296159e607a
            - a8251ca5d0215e4d70a290cbcb574d9b46f17d05
            - 2ad0753eda92e267cc6292565cb2458808fa6caa
            - 46826b46fdbace015f83be40d36fcd58d7cb3bd0
            - ca00bb814bb7ab92c738dc10362a06b7aaf9247e
            - bfc6dbb94f02f7a61145f86e550015f75d5829b6
            - a97f124854c8ddd7b52a7669a51c22b7a021ee78
            - 4b5a76cc7c7dfb4e066fdfc05ea5b8be7e9730e0
            - dd20452fe68f41c19b069e6bba4fd2a4f80eaca5
            - 6c94f3ac29b2c220c71be36473801501dfb06043
        - sha256:
            - fc1ab45050f31952badbd176fc8e5e2c1b18788376cda5655b80ea99ee0ef1ae
            - 218628edc95f7c425fad294048adca65e235ae3024f084c9afaf483f66f71b6c
            - b1174963806b2e2a8ea711435bb5560b5b6fe2aa5baf6c90f2f0a7300d29eb0a
            - 723931f1a88f70a654ed1c3f34b9e25411ebe3569537e9d65d307a9ca971ac43
            - c184350d6f6342803f0ef19754e5e65147d1f63b85c574fb34c7bc61e0a26bd7
            - be154f68ee3159abb4ec6de6122b959daedca4030ff57dc05ba66d1bf15cb6d2
            - 8aff8d0312ead73fde52a65b3256eea154d2e628f4874793d14bbdc10037fc38
            - 94e901de862c0aec125f8203d460f2f14001ff25acfcc7722767dbe2ff1443ae
            - d68bb7890bee5a9d51c40e17f9b0169c46e1cb1546a536727397695985337fbf
            - 832d57d685b0053e3e0c6836de54ea05b130e4166fb314e6435b2871fa0abdc7
            - 5609712d748096ec39a473450f24b99d0a06546d19f1c88e3d0ae6ff0102abad
            - d8e90ce7d0c1e274b49c5364b84326a77914e8d7b190b529ffed0d6444d1e8e7
            - 3b9c9e971e77fd4e1aea662be5c3169bde39decc658a351d1c47d52bab3eff3b
            - dcbdc6a7f0ad4e6afcfa8f23a028d66f0353d6630588a1ea62abd56aa615ab68
            - 0877bfffd0efc19ca758da1d1d44380d714123c10755719f7391dcc478513023
            - 281d1dd17f3815e27db411a955d222105d47814b3bc6c7c0c96b6647e1548221
            - 9d879a24e8e8206114f579e5ef89766c84cea43798b7a3c9fb0b56e3f2944736
            - 364cf1fc5d729fd4cb8d52bfe86109545d6ce574fe6b121b8643d8de06f445b0
            - 2f833222f17155f54e7da723b309b64dd4b9dcb9dd378875cc020a499b0bcb3a
            - 3e1cc51054335123345210c3ecad500232a394b5bd3e1f042d085db2429dfee4
            - 977547ac60da4d87c11abb57c3e53f828a14e96f6746557b0ac7e2e0a886eceb
      selection_domains:
        - destination.domain:
            - female-cooler-flowers-vids.trycloudflare.com
            - volvogroup20.duckdns.org
            - hy647dhon.duckdns.org
            - y57kdsa.duckdns.org
        - dns.question.name:
            - female-cooler-flowers-vids.trycloudflare.com
            - volvogroup20.duckdns.org
            - hy647dhon.duckdns.org
            - y57kdsa.duckdns.org
      selection_urls:
        url.original|contains:
          - /pro/dl/zx6s3x
          - /1Feb02ST.zip
          - /UKF182.txt
          - /xv/ukf18.wsf
          - /1Feb02MA.zip
          - /UKF181.txt
          - /zx6s3x/QB_Transaction_copy.pdf.zip
          - /ulo/cmd.exe
          - /1Feb02SU.txt
      condition: 1 of them
    falsepositives:
      - This rule detects specific IOCs and is expected to have a low false positive
        rate. However, domains for legitimate services like trycloudflare.com,
        duckdns.org, and sendspace.com are included, which could cause false
        positives if matched too broadly. The rule attempts to mitigate this by
        matching on specific subdomains and URL paths.
    level: high
query_type: sigma
severity: high
tactics:
    - TA0011
    - TA0002
techniques:
    - T1105
tags:
    - attack.command_and_control
    - attack.execution
    - attack.t1105
    - attack.s0332
author: Adarsh Pandey
version: "3"
data_sources:
    - proxy
    - windows
