id: 019c19be-2784-74c7-9cca-9e416e69cf29
name: Fortinet system configuration export
description: Detects if the Fortinet firewall configuration has been exported.
query: |
    title: Fortinet system configuration export
    description: Detects if the Fortinet firewall configuration has been exported.
    references:
      - https://cybersecuritynews.com/fortigate-devices-sso-vulnerabilities/
      - https://arcticwolf.com/resources/blog/cve-2025-59718-and-cve-2025-59719/
      - https://arcticwolf.com/resources/blog/console-chaos-targets-fortinet-fortigate-firewalls/
    author: mdecrevoisier
    status: experimental
    logsource:
      product: firewall
    detection:
      selection:
        subtype: System
        msg|startswith: System config file has been downloaded*
      condition: selection
    level: medium
    associated_cves:
      - CVE-2025-59718
      - CVE-2025-59719
query_type: sigma
severity: medium
techniques:
    - T1602.002
author: mdecrevoisier
version: "4"
references:
    - https://cybersecuritynews.com/fortigate-devices-sso-vulnerabilities/
    - https://arcticwolf.com/resources/blog/cve-2025-59718-and-cve-2025-59719/
    - https://arcticwolf.com/resources/blog/console-chaos-targets-fortinet-fortigate-firewalls/
data_sources:
    - firewall
