id: 019ca09b-2b4b-745a-a625-be327f848cb8
name: Indrik Ransomware Mutex Detection
description: This rule detects the creation of specific mutexes known to be associated with Indrik ransomware activity. The detection specifically looks for a mutex named 'Global\Indrik'. The presence of this mutex indicates potential Indrik ransomware infection or execution on a Windows system.
query: |-
    title: Indrik Ransomware Mutex Detection
    status: experimental
    description: Detects known mutexes associated with Indrik ransomware activity.
    author: '@adhikara13'
    date: 2024/08/01
    references:
      - 'https://id-ransomware.blogspot.com/2019/01/unnamed-desync-ransomware.html'
    tags:
      - 'attack.impact.t1486'
      - 'malware.ransomware.indrik'
    logsource:
      category: process_creation
      product: windows
    detection:
      selection:
        MutexName:
          - 'Global\Indrik'
      condition: selection
    falsepositives:
      - 'Legitimate applications using similar mutex names (unlikely for these specific strings)'
    level: critical
query_type: sigma
severity: critical
tactics:
    - TA0040
techniques:
    - T1486
tags:
    - attack.impact.t1486
    - malware.ransomware.indrik
author: '@adhikara13'
version: "1"
references:
    - https://id-ransomware.blogspot.com/2019/01/unnamed-desync-ransomware.html
data_sources:
    - process_creation
    - windows
