id: 019ca093-5751-77c0-b1e8-17eca6521b05
name: 3LOSH RAT Mutex Detection
description: This rule detects the creation of specific mutexes known to be associated with 3LOSH RAT activity. Specifically, it looks for the mutex named 'AsyncMutex_Devil'.
query: |-
    title: 3LOSH RAT Mutex Detection
    status: experimental
    description: Detects known mutexes associated with 3LOSH RAT activity.
    author: '@adhikara13'
    date: 2024/12/19
    references:
      - 'https://tria.ge/221215-ssfh5acf75/behavioral3/analog?main_event=Mutex&q=&mutant=AsyncMutex_Devil'
      - 'https://app.any.run/tasks/a8254afb-57de-4e78-a8b6-173ce88ffb62?malconf=66fcb7d32f4ad79febb7fb05'
    tags:
      - 'attack.command_and_control.t1219'
      - 'malware.rat.3losh_rat'
    logsource:
      category: process_creation
      product: windows
    detection:
      selection:
        MutexName:
          - 'AsyncMutex_Devil'
      condition: selection
    falsepositives:
      - 'Legitimate applications using similar mutex names (unlikely for these specific strings)'
    level: critical
query_type: sigma
severity: critical
tactics:
    - TA0011
techniques:
    - T1219
tags:
    - attack.command_and_control.t1219
    - malware.rat.3losh_rat
author: '@adhikara13'
version: "1"
references:
    - https://tria.ge/221215-ssfh5acf75/behavioral3/analog?main_event=Mutex&q=&mutant=AsyncMutex_Devil
    - https://app.any.run/tasks/a8254afb-57de-4e78-a8b6-173ce88ffb62?malconf=66fcb7d32f4ad79febb7fb05
data_sources:
    - process_creation
    - windows
