id: 019c22c2-7fa5-7132-84cf-10a4b5dcf829
name: Possible DLL Hijacking of log.dll
description: This rule alerts on outbound network activity initiated by gup.exe where the destination URL is not associated with expected Notepad++ update endpoints.
query: |
    title: Possible DLL Hijacking of log.dll
    id: 4c3b9c04-d274-4114-be1c-7a2724ac874e
    status: experimental
    description: >-
      This rule alerts on outbound network activity initiated by gup.exe where the
      destination URL is not associated with expected Notepad++ update endpoints.
    references:
      - >-
        https://www.rapid7.com/blog/post/tr-chrysalis-backdoor-dive-into-lotus-blossoms-toolkit/
    author: Daniel Koifman (KoifSec, CardinalOps)
    date: 2026-02-03T00:00:00.000Z
    tags:
      - attack.initial-access
      - attack.command-and-control
      - attack.t1195.002
      - attack.t1105
    logsource:
      product: windows
      category: dns
    detection:
      selection_exe:
        - Image|endswith: \gup.exe
      selection_filter:
        - QueryName|contains:
            - notepad-plus-plus.org
            - github.com
            - githubusercontent.com
      condition: selection_exe and not selection_filter
    level: high
query_type: sigma
severity: medium
techniques:
    - T1195.002
    - T1105
tags:
    - attack.initial-access
    - attack.command-and-control
    - attack.t1195.002
    - attack.t1105
author: Daniel Koifman (KoifSec, CardinalOps)
version: "1"
references:
    - https://www.rapid7.com/blog/post/tr-chrysalis-backdoor-dive-into-lotus-blossoms-toolkit/
data_sources:
    - dns
    - windows
