id: 019ca094-2e43-761e-9c51-7b0d5b0559d9
name: Atlas Clipper Mutex Detection
description: The rule detects the creation of a process that utilizes a specific mutex name, 'YourMutex'. This mutex name is associated with Atlas Clipper malware activity. The detection aims to identify potential Atlas Clipper infections by monitoring for this known indicator.
query: |-
    title: Atlas Clipper Mutex Detection
    status: experimental
    description: Detects known mutexes associated with Atlas Clipper activity.
    author: '@adhikara13'
    date: 2025/07/14
    references:
      - 'https://cyble.com/blog/multiple-new-clipper-malware-variants-discovered-in-the-wild/'
    tags:
      - 'attack.collection.t1115'
      - 'malware.clipper.atlas_clipper'
    logsource:
      category: process_creation
      product: windows
    detection:
      selection:
        MutexName:
          - 'YourMutex'
      condition: selection
    falsepositives:
      - 'Legitimate applications using similar mutex names (unlikely for these specific strings)'
    level: critical
query_type: sigma
severity: critical
tactics:
    - TA0009
techniques:
    - T1115
tags:
    - attack.collection.t1115
    - malware.clipper.atlas_clipper
author: '@adhikara13'
version: "1"
references:
    - https://cyble.com/blog/multiple-new-clipper-malware-variants-discovered-in-the-wild/
data_sources:
    - process_creation
    - windows
