id: 019c3b50-4368-764b-8aa8-081647de87c6
name: XONER Dropper Download Attempt
description: |-
    Let's create a detection rule for "XONER dropper (multi-key download/execution)" based on xoner.sh. The key IOCs are as follows:
    - C2/Hosting: 165.232.165.152:8080
    - Download path (pattern): /xoner_* (e.g., xoner_armv7l, xoner_mips, xoner_x86_64, etc.)
    - Drop file name: xoner
    - Action: Save to /tmp, /dev/shm, or /var/run → chmod 777 xoner → ./xoner xoner & execute → Delete file

    Reported by Team_D4rkn3ttz
    Detected by @bishop0218
query: |
    title: XONER Dropper Download Attempt
    logsource:
      category: webserver
      product: aws
    detection:
      selection:
        http.method: GET
        http.uri|contains: /xoner_
      condition: selection
    level: high
    description: >-
      Let's create a detection rule for "XONER dropper (multi-key
      download/execution)" based on xoner.sh. The key IOCs are as follows:

      - C2/Hosting: 165.232.165.152:8080

      - Download path (pattern): /xoner_* (e.g., xoner_armv7l, xoner_mips,
      xoner_x86_64, etc.)

      - Drop file name: xoner

      - Action: Save to /tmp, /dev/shm, or /var/run → chmod 777 xoner → ./xoner
      xoner & execute → Delete file


      Reported by Team_D4rkn3ttz

      Detected by @bishop0218
    references:
      - >-
        https://www.virustotal.com/gui/file/ed8a62a9ab02182d0d1f806af9a21d785801c0aaf7c8e265e077682f053c6b67
      - >-
        https://mwdb.cert.pl/file/ed8a62a9ab02182d0d1f806af9a21d785801c0aaf7c8e265e077682f053c6b67
      - >-
        https://virusshare.com/file?ed8a62a9ab02182d0d1f806af9a21d785801c0aaf7c8e265e077682f053c6b67
      - https://virus.exchange/samples/
      - https://tria.ge/260207-pgmaradz2c
      - >-
        https://www.threat.rip/file/ed8a62a9ab02182d0d1f806af9a21d785801c0aaf7c8e265e077682f053c6b67
      - >-
        https://jaffacakes118.dev/analysis/ed8a62a9ab02182d0d1f806af9a21d785801c0aaf7c8e265e077682f053c6b67
    author: https://x.com/Team_D4rkn3ttz
    tags:
      - xoner
      - dropper
      - Unix Shell
query_type: sigma
severity: medium
techniques:
    - T1059.004
    - T1070.004
    - T1105
    - T1222.002
tags:
    - xoner
    - dropper
    - Unix Shell
author: https://x.com/Team_D4rkn3ttz
version: "4"
references:
    - https://www.virustotal.com/gui/file/ed8a62a9ab02182d0d1f806af9a21d785801c0aaf7c8e265e077682f053c6b67
    - https://mwdb.cert.pl/file/ed8a62a9ab02182d0d1f806af9a21d785801c0aaf7c8e265e077682f053c6b67
    - https://virusshare.com/file?ed8a62a9ab02182d0d1f806af9a21d785801c0aaf7c8e265e077682f053c6b67
    - https://virus.exchange/samples/
    - https://tria.ge/260207-pgmaradz2c
    - https://www.threat.rip/file/ed8a62a9ab02182d0d1f806af9a21d785801c0aaf7c8e265e077682f053c6b67
    - https://jaffacakes118.dev/analysis/ed8a62a9ab02182d0d1f806af9a21d785801c0aaf7c8e265e077682f053c6b67
data_sources:
    - webserver
    - aws
