id: 0340caf1-777f-497e-8450-f3cf5d1cfb1b
name: Exe Launched By ReflectiveLoader Dll
description: exe launched by dll with ReflectiveLoader export function
query: |
    title: Exe Launched By ReflectiveLoader Dll
    status: experimental
    description: exe launched by dll with ReflectiveLoader export function
    author: Joe Security
    date: 2019-10-18
    id: 200001
    threatname:
    behaviorgroup: 1
    classification: 5
    mitreattack: T1055

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            ParentCommandLine: '*rundll32.exe C:\\*.dll,ReflectiveLoader*'
            CommandLine:
                -'*\\*.exe*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
tactics:
    - TA0005
    - TA0004
techniques:
    - T1055
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
