id: 035b7970-f773-409a-a35b-0257bd92f074
name: SAM database user credentials dump with Mimikatz
description: Detects scenarios where an attacker dump the LSASS memory content using Mimikatz (sekurlsa module).
query: |-
    title: SAM database user credentials dump with Mimikatz
    description: Detects scenarios where an attacker dump the LSASS memory content using Mimikatz (sekurlsa module).
    correlation: correlate TargetLogonId from ID 4624 with SubjectLogonId from ID 4661 to identify the source of the enumeration.
    requirements: extended rights auditing enabled (https://www.manageengine.com/products/active-directory-audit/active-directory-auditing-configuration-guide-configure-object-level-auditing-manually.html)
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
    - https://ivanitlearning.wordpress.com/2019/09/07/mimikatz-and-password-dumps/
    tags:
    - attack.credential_access
    - attack.t1003.001
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4661
        ProcessName|endswith: '\lsass.exe'
        ObjectServer: Security Account Manager
        ObjectType: SAM_USER
        ObjectName|startswith: 'S-1-5-21-' # User SID dumped
        AccessList|contains|all:
          - '%%5446' # ChangePassword
          - '%%5447' # SetPassword
      filter:
        SubjectUserName|endswith: '$'
      condition: selection and not filter | count(ObjectName) by Computer > 10
    falsepositives:
    - None
    level: high
query_type: sigma
severity: high
tactics:
    - TA0006
techniques:
    - T1003.001
    - T1003
tags:
    - attack.credential_access
    - attack.t1003.001
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
    - https://ivanitlearning.wordpress.com/2019/09/07/mimikatz-and-password-dumps/
data_sources:
    - windows
    - security
