id: 052791b0-7047-4205-a541-06e4208213e4
name: Schedule system process
description: Schedule system process
query: |
    title: Schedule system process
    status: experimental
    description: Schedule system process
    author: Joe Security
    date: 2021-05-06
    id: 200101
    threatname:
    behaviorgroup: 2
    classification: 8
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*schtasks /create*svchost*'
                - '*schtasks /create*rundll32*'
                - '*schtasks /create*powershell*'
                - '*schtasks /create*regsvr32*'
                - '*schtasks /create*spoolsv*'
                - '*schtasks /create*lsass*'
                - '*schtasks /create*smss*'
                - '*schtasks /create*csrss*'
                - '*schtasks /create*conhost*'
                - '*schtasks /create*wininit*'
                - '*schtasks /create*winlogon*'
                - '*schtasks /create*taskhost*'
                - '*schtasks /create*Taskmgr*'
                - '*schtasks /create*RuntimeBroker*'
                - '*schtasks /create*smartscreen*'
                - '*schtasks /create*dllhost*'
                - '*schtasks* /create*svchost*'
                - '*schtasks* /create*rundll32*'
                - '*schtasks* /create*powershell*'
                - '*schtasks* /create*regsvr32*'
                - '*schtasks* /create*spoolsv*'
                - '*schtasks* /create*lsass*'
                - '*schtasks* /create*smss*'
                - '*schtasks* /create*csrss*'
                - '*schtasks* /create*conhost*'
                - '*schtasks* /create*wininit*'
                - '*schtasks* /create*winlogon*'
                - '*schtasks* /create*taskhost*'
                - '*schtasks* /create*Taskmgr*'
                - '*schtasks* /create*RuntimeBroker*'
                - '*schtasks* /create*smartscreen*'
                - '*schtasks* /create*dllhost*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
