id: 09122c93-bb76-409a-bdf7-e2a796e8a3de
name: Permissions changed on a Group Policy (GPO)
description: Detects scenarios where an attacker will attempt to take control over a group policy.
query: |-
    title: Permissions changed on a Group Policy (GPO)
    description: Detects scenarios where an attacker will attempt to take control over a group policy.
    requirements: auditing SACL "Modify permissions" must be placed on the "Policies" container using the Active Directory console (https://www.manageengine.com/products/active-directory-audit/active-directory-auditing-configuration-guide-configure-object-level-auditing-manually.html).
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1222.001-File%20and%20Directory%20Permissions%20Modification
    tags:
    - attack.privilege_escalation
    - attack.t1484.001
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 5136
        AttributeLDAPDisplayName: ntSecurityDescriptor
        ObjectClass: groupPolicyContainer
        OperationType: '%%14674' # Value is added
      filter:
        SubjectUserName: # AGPM servers (to customize)
          - SRVAGPM01$
          - SRVAGPM02$
      condition: selection and not filter
    falsepositives:
    - Group policy administrator activity / AGPM activity
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0005
    - TA0004
techniques:
    - T1484.001
    - T1222.001
tags:
    - attack.privilege_escalation
    - attack.t1484.001
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1222.001-File%20and%20Directory%20Permissions%20Modification
data_sources:
    - windows
    - security
