id: 0ad77280-8dae-4ad0-bfe4-a6b62953926c
name: Firewall rule added using PowerShell or CMD
description: Detects scenarios where a firewall rule is added using PowerShell or CMD.
query: |-
    title: Firewall rule added using PowerShell or CMD
    description: Detects scenarios where a firewall rule is added using PowerShell or CMD.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.004-Impair%20Defenses-Disable%20or%20Modify%20System%20Firewall
    - https://kb.eventtracker.com/evtpass/evtPages/EventId_2004_Microsoft-Windows-WindowsFirewallwithAdvancedS_65673.asp
    tags:
    - attack.defense_evasion
    - attack.t1562.004
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: firewall-as
    detection:
      selection:
        EventID: 2004
        ModifyingApplication|endswith:
          - '\WmiPrvSE.exe' # PowerShell
          - '\netsh.exe' # CMD console
      condition: selection
    falsepositives:
    - Administrator activity
    - New application installation
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0005
techniques:
    - T1562.004
tags:
    - attack.defense_evasion
    - attack.t1562.004
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.004-Impair%20Defenses-Disable%20or%20Modify%20System%20Firewall
    - https://kb.eventtracker.com/evtpass/evtPages/EventId_2004_Microsoft-Windows-WindowsFirewallwithAdvancedS_65673.asp
data_sources:
    - windows
    - firewall-as
