id: 12d71129-d546-4108-883e-f855b5ef7bc9
name: Powershell create lnk in startup
description: Powershell create lnk in startup
query: |
    title: Powershell create lnk in startup
    status: experimental
    description: Powershell create lnk in startup
    author: Joe Security
    date: 2020-02-17
    id: 200054
    threatname:
    behaviorgroup: 2
    classification: 1
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*powershell*.createshortcut(*\appdata\roaming\microsoft\windows\start menu\programs\startup*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
