id: 15d4ff44-444f-43a9-94db-b435490d7074
name: RMSRemoteAdmin
description: RMS RemoteAdmin tool
query: |
    title: RMSRemoteAdmin
    status: experimental
    description: RMS RemoteAdmin tool
    author: Joe Security
    date: 2020-11-02
    id: 200090
    threatname: RMSRemoteAdmin
    behaviorgroup: 21
    classification: 4
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*hkcu\software\tektonit\remote manipulator system\host*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
