id: 1620aa00-1cfc-4c22-aa64-26764cb065d7
name: AWS IAM MFA Deactivation detected
description: Detects suspicious AWS API calls to DeactivateMFADevice and DeleteVirtualMFADevice, which may indicate attempts to disable MFA and evade detection.
query: |
    title: AWS IAM MFA Deactivation detected
    status: experimental
    description: >-
      Detects suspicious AWS API calls to DeactivateMFADevice and
      DeleteVirtualMFADevice, which may indicate attempts to disable MFA and evade
      detection.
    author: Lingeshwaran Rameshkumar
    date: 2024/11/20
    logsource:
      product: aws
      service: cloudtrail
    detection:
      selection:
        EventName:
          - DeactivateMFADevice
          - DeleteVirtualMFADevice
      condition: selection
    fields:
      - EventName
      - UserName
      - SourceIPAddress
      - RequestParameters
    falsepositives:
      - Legitimate administrative activities
    level: high
    tags:
      - attack.t1556.006
      - attack.impact
      - attack.persistence
    references:
      - >-
        https://docs.aws.amazon.com/IAM/latest/UserGuide/id_credentials_mfa_disable.html
query_type: sigma
severity: high
tactics:
    - TA0006
    - TA0005
    - TA0003
techniques:
    - T1556.006
tags:
    - attack.t1556.006
    - attack.impact
    - attack.persistence
author: Lingeshwaran Rameshkumar
version: "1"
references:
    - https://docs.aws.amazon.com/IAM/latest/UserGuide/id_credentials_mfa_disable.html
data_sources:
    - aws
    - cloudtrail
