id: 197fafd4-0484-4911-af45-a49aea5b207d
name: MSSQL Destructive Query
description: |
    Detects the invocation of MS SQL transactions that are destructive towards table or database data, such as "DROP TABLE" or "DROP DATABASE".
query: |
    title: MSSQL Destructive Query
    description: |
        Detects the invocation of MS SQL transactions that are destructive towards table or database data, such as "DROP TABLE" or "DROP DATABASE".
    references:
        - https://learn.microsoft.com/en-us/sql/t-sql/statements/drop-table-transact-sql?view=sql-server-ver16
        - https://learn.microsoft.com/en-us/sql/t-sql/statements/drop-database-transact-sql?view=sql-server-ver16
        - https://learn.microsoft.com/en-us/sql/t-sql/statements/truncate-table-transact-sql?view=sql-server-ver16
    author: Daniel Degasperi '@d4ns4n_'
    tags:
        - attack.exfiltration
        - attack.impact
        - attack.t1485
    logsource:
        product: windows
        service: application
        definition: 'Requirements: MSSQL audit policy must be enabled in order to receive this event (event id 33205)'
    detection:
        selection:
            Provider_Name: 'MSSQLSERVER$AUDIT'
            EventID: 33205
            Data|contains:
                - 'statement:TRUNCATE TABLE'
                - 'statement:DROP TABLE'
                - 'statement:DROP DATABASE'
        condition: selection
    falsepositives:
        - Legitimate transaction from a sysadmin.
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0010
    - TA0040
techniques:
    - T1485
tags:
    - attack.exfiltration
    - attack.impact
    - attack.t1485
author: Daniel Degasperi '@d4ns4n_'
version: "1"
references:
    - https://learn.microsoft.com/en-us/sql/t-sql/statements/drop-table-transact-sql?view=sql-server-ver16
    - https://learn.microsoft.com/en-us/sql/t-sql/statements/drop-database-transact-sql?view=sql-server-ver16
    - https://learn.microsoft.com/en-us/sql/t-sql/statements/truncate-table-transact-sql?view=sql-server-ver16
data_sources:
    - windows
    - application
