id: 1b6662df-fe0b-4fe7-86b1-831cf4813b30
name: Remcos
description: detect log.dat of remcos and registry entry
query: |
    title: Remcos
    status: experimental
    description: detect log.dat of remcos and registry entry
    author: Joe Security
    date: 2019-10-29
    id: 200014
    threatname: Remcos
    behaviorgroup: 20
    classification: 4
    logsource:
        service: sysmon
        product: windows
    detection:
        selection:
            EventID: 11
            TargetFilename:
                - '*\AppData\Roaming\remcos\logs*.dat*'
                - '*\ProgramData\remcos\logs.dat*'
        selection1:
            EventID: 13
            TargetObject:
                - '*\Software\Remcos*exepath*'
                - '*\Software\Rmc-*exepath*'
                - '*\microsoft\windows\currentversion\run*remcos*'
        condition: selection or selection1
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - windows
    - sysmon
