id: 24674b24-1c6d-4724-bf2d-8258c48229ed
name: APT28 Covenant Grunt Stager Detection
description: Detects Covenant Grunt Stager modules used by APT28 in the Phantom Net Voxel campaign based on known file hashes. This rule specifically looks for the MD5 hashes of these stager modules in file event logs.
query: |
    title: APT28 Covenant Grunt Stager
    id: 6e754b50-2c00-42d8-880d-f8f68920d67b
    status: experimental
    description: Detects Covenant Grunt Stager modules used by APT28 in the Phantom Net Voxel campaign based on known file hashes.
    references:
      - https://blog.sekoia.io/apt28-operation-phantom-net-voxel/#h-iocs-and-technical-details
    author: detections.ai
    date: 2025-09-16
    tags:
      - attack.execution
      - threat_actor.apt28
      - malware.covenant
    logsource:
      category: file_event
      product: windows
    detection:
        # Detects specific MD5 hashes of the Covenant Grunt Stager
      selection:
        hash.md5:
          - 'f442db1753a7475842607307a439870e'
          - '8edc3c4868f2ef688c5250119c8aa6bb'
          - 'c60991effda994e4168ec2a63406cd6a'
          - '8f916b6661e013ffbf318ed78e24a7c2'
      condition: selection
    falsepositives:
      - Unlikely, as the detection is based on specific file hashes.
    level: high
query_type: sigma
severity: high
tactics:
    - TA0002
tags:
    - attack.execution
    - threat_actor.apt28
    - malware.covenant
author: detections.ai
version: "1"
references:
    - https://blog.sekoia.io/apt28-operation-phantom-net-voxel/#h-iocs-and-technical-details
data_sources:
    - file_event
    - windows
