id: 25c2f3c1-33a1-4a2e-9d72-1f442d3c183f
name: Wmic Launch Msiexec
description: Wmic launch msiexec to download file from internet
query: |
    title: Wmic Launch Msiexec
    status: experimental
    description: Wmic launch msiexec to download file from internet
    author: Joe Security
    date: 2019-11-06
    id: 200018
    threatname:
    behaviorgroup: 10
    classification: 1
    mitreattack: T1218

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*wmic process call create *msiexec /i http* /q*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
tactics:
    - TA0005
techniques:
    - T1218
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
