id: 26b958a9-e119-4ddb-a9fd-1c9b6952f9b8
name: VjW0rm
description: VjW0rm Registry key
query: |
    title: VjW0rm
    status: experimental
    description: VjW0rm Registry key
    author: Joe Security
    date: 2022-08-30
    id: 200104
    threatname: VjW0rm
    behaviorgroup: 2
    classification: 4
    mitreattack:

    logsource:
        product: windows
        category: registry_event
    detection:
        selection:
            EventID: 13
            TargetObject:
                - '*HKEY_CURRENT_USER\vjw0rm*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - registry_event
    - windows
