id: 288da810-d429-48d0-9158-4bb3daa3a3c3
name: IcedID Downloader
description: IcedID Downloader
query: |
    title: IcedID Downloader
    status: experimental
    description: IcedID Downloader
    author: Joe Security
    date: 2020-08-07
    id: 200083
    threatname:
    behaviorgroup: 20
    classification: 4
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*\programdata\1.exe /urlcache /f http*.php?*.cab c:\programdata\1.tmp*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
