id: 29d1de94-319e-4526-a30f-c0cd4e76b2f2
name: Execute Scriptlet from internet Via Regsvr32
description: regsvr32.exe to execute a COM scriptlet from internet
query: |+
    title: Execute Scriptlet from internet Via Regsvr32
    status: experimental
    description:  regsvr32.exe to execute a COM scriptlet from internet
    author: Joe Security
    date: 2021-03-05
    id: 200099
    threatname:
    behaviorgroup: 2
    classification: 8
    mitreattack: T1218.010

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*regsvr32*http*scrobj*'
        condition: selection
    level: critical

query_type: sigma
severity: critical
tactics:
    - TA0005
techniques:
    - T1218.010
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
