id: 300ceb9c-46b8-4f6c-89c2-58d7c16aaa86
name: Powershell launch wscript
description: Powershell launch wscript
query: |
    title: Powershell launch wscript
    status: experimental
    description: Powershell launch wscript
    author: Joe Security
    date: 2020-02-17
    id: 200053
    threatname:
    behaviorgroup: 10
    classification: 8
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*powershell*wscript.shell*.run(*wscript.exe /e:*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
