id: 316c991f-9905-4333-90a4-6dffccc03d14
name: Potential Fake Captcha Code Execution via Run Dialog
description: |
    This rule detects potential fake captcha code execution through the Windows "Run" dialog box. Attackers will often pad the end of a malicious command string with a fake
    comment like "I am not a robot: CAPTCHA Verification UID:7811" to trick users into executing malicious code.
query: |
    title: Potential Fake Captcha Code Execution via Run Dialog
    id: d3c26cd6-e2e6-480c-a21a-aeea7e525f47
    status: experimental
    description: |
      This rule detects potential fake captcha code execution through the Windows "Run" dialog box. Attackers will often pad the end of a malicious command string with a fake
      comment like "I am not a robot: CAPTCHA Verification UID:7811" to trick users into executing malicious code.
    author: Tim Peck
    references:
      - https://www.trendmicro.com/en_us/research/25/e/unmasking-fake-captcha-cases.html
      - https://www.securonix.com/blog/analyzing-obscurebat-threat-actors-lure-victims-into-executing-malicious-batch-scripts-to-deploy-stealthy-rootkits/
      - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/resurgence-of-a-fake-captcha-malware-campaign/
      - https://gadellnet.com/malware-alert-fake-captcha-prompts-using-verification-keys/
      - https://www.netskope.com/blog/lumma-stealer-fake-captchas-new-techniques-to-evade-detection
      - https://www.infostealers.com/article/anatomy-of-a-lumma-stealer-attack-via-fake-captcha-pages/
    date: 2025/07/23
    logsource:
      product: windows
      category: process_creation
      service: security
    detection:
      selection:
        Image|endswith: \explorer.exe
        CommandLine|contains:
          - 'Confirm that you are human'
          - 'not a robot'
          - 'reCAPTCHA'
          - 'captcha-verif'
      condition: selection
    level: high
    tags:
      - attack.execution
      - attack.T1204.004
      - threat.obscure_bat
      - threat.lumma_stealer
      - threat.vidar
      - threat.stealc
      - threat.FakeCAPTCHA
      - threat.ClickFix
      - threat.netsupport
      - threat.amadey
    falsepositives:
      - Security testing or regular activity containing matching comments
query_type: sigma
severity: medium
tactics:
    - TA0002
techniques:
    - T1204.004
tags:
    - attack.execution
    - attack.T1204.004
    - threat.obscure_bat
    - threat.lumma_stealer
    - threat.vidar
    - threat.stealc
    - threat.FakeCAPTCHA
    - threat.ClickFix
    - threat.netsupport
    - threat.amadey
author: Tim Peck
version: "1"
references:
    - https://www.trendmicro.com/en_us/research/25/e/unmasking-fake-captcha-cases.html
    - https://www.securonix.com/blog/analyzing-obscurebat-threat-actors-lure-victims-into-executing-malicious-batch-scripts-to-deploy-stealthy-rootkits/
    - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/resurgence-of-a-fake-captcha-malware-campaign/
    - https://gadellnet.com/malware-alert-fake-captcha-prompts-using-verification-keys/
    - https://www.netskope.com/blog/lumma-stealer-fake-captchas-new-techniques-to-evade-detection
    - https://www.infostealers.com/article/anatomy-of-a-lumma-stealer-attack-via-fake-captcha-pages/
data_sources:
    - process_creation
    - windows
    - security
