id: 32ba94b5-67a5-4e77-8677-69e3f5532309
name: Certutil payload obfuscation (command)
description: Detects scenarios where an attacker attempts to abuse certutil command to download obfuscated malicious payload. Tools like Tchopper can trigger this rule.
query: |-
    title: Certutil payload obfuscation (command)
    description: Detects scenarios where an attacker attempts to abuse certutil command to download obfuscated malicious payload. Tools like Tchopper can trigger this rule.
    references:
    - https://www.elastic.co/guide/en/security/current/suspicious-certutil-commands.html
    - https://www.bleepingcomputer.com/news/security/certutilexe-could-allow-attackers-to-download-malware-while-bypassing-av/
    - https://attack.mitre.org/software/S0160/
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
    - https://www.sentinelone.com/blog/malware-living-off-land-with-certutil/
    - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
    tags:
    - attack.defense_evasion
    - attack.t1140
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      category: process_creation
    detection:
      selection:
        NewProcessName|endswith: '\certutil.exe'
        CommandLine|contains:
          #- urlcache # see other related rule
          - decode
          - encode
          - encodehex
          - decodehex
      condition: selection
    falsepositives:
    - CSAT Cyber Security Assessment Tool
    level: high
query_type: sigma
severity: high
tactics:
    - TA0005
techniques:
    - T1140
tags:
    - attack.defense_evasion
    - attack.t1140
author: mdecrevoisier
version: "1"
references:
    - https://www.elastic.co/guide/en/security/current/suspicious-certutil-commands.html
    - https://www.bleepingcomputer.com/news/security/certutilexe-could-allow-attackers-to-download-malware-while-bypassing-av/
    - https://attack.mitre.org/software/S0160/
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
    - https://www.sentinelone.com/blog/malware-living-off-land-with-certutil/
    - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
data_sources:
    - process_creation
    - windows
