id: 39326048-b97f-4494-bfa0-953a44809113
name: Schedule CERTUTIL windows binary
description: Schedule CERTUTIL windows binary
query: |
    title: Schedule CERTUTIL windows binary
    status: experimental
    description: Schedule CERTUTIL windows binary
    author: Joe Security
    date: 2020-05-22
    id: 200077
    threatname:
    behaviorgroup: 5
    classification: 8
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*schtasks /create * certutil*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
