id: 3afc4b74-7724-468d-aa37-cae91c1f916c
name: SQL Server - Connection attempt using a disabled account
description: Detects scenarios where an attacker attempts authenticate to the database using a disabled user accont
query: |-
    title: SQL Server - Connection attempt using a disabled account
    description: Detects scenarios where an attacker attempts authenticate to the database using a disabled user accont
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0001-Initial%20access/T1078-Valid%20accounts
    - https://www.eraofdata.com/sql-server/connectivity/login-failures/
    - https://docs.microsoft.com/en-us/previous-versions/sql/sql-server-2008-r2/ms366351(v=sql.105)
    tags:
    - attack.valid_account
    - attack.t1078
    author: mdecrevoisier
    status: experimental
    logsource:
      product: mssql
      category: application
    detection:
      selection_basic:
        EventID: 18470

      selection_advanced:
        EventID: 33205
        action_id:
          - LGFL # FAILED_LOGIN_GROUP
          - LGIF # LOGIN FAILED
        class_type: LX # LOGIN
        additional_information|contains: "<state>7</state>" # User account is disabled
      condition: selection_basic or selection_advanced
    falsepositives:
    - Miss configured accounts or scripts
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0001
    - TA0005
    - TA0003
    - TA0004
techniques:
    - T1078
tags:
    - attack.valid_account
    - attack.t1078
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0001-Initial%20access/T1078-Valid%20accounts
    - https://www.eraofdata.com/sql-server/connectivity/login-failures/
    - https://docs.microsoft.com/en-us/previous-versions/sql/sql-server-2008-r2/ms366351(v=sql.105)
data_sources:
    - application
    - mssql
