id: 3d28e9c1-ed80-4682-909a-006a7fb751b8
name: Dll-sideloading attempts via licensingdiag.exe
description: Detects dll-sideloading attempts via licensingdiag.exe
query: |
    title: Dll-sideloading attempts via licensingdiag.exe
    id: 385889b1-8afa-446e-a480-cca35f9b8614
    status: stable
    description: Detects dll-sideloading attempts via licensingdiag.exe
    references:
      - https://borncity.com/win/2024/09/01/windows-side-loading-dll-attacks-via-licensingdiag-exe/
      - https://x.com/0gtweet/status/1827991604918890968
    author: "MBOWER"
    date: 2025-07-07
    tags:
      - attack.defense-evasion
      - attack.privilege-escalation
      - attack.persistence
      - attack.t1574.001
    logsource:
      category: registry_event
      product: windows
    detection:
      selection_type:
        EventType:
          - 'RegistryKeyCreated'
          - 'RegistryValueSet'
      selection_key:
        TargetObject|contains:
          - '\CurrentVersion\LicensingDiag'
        Details|contains:
          - '.dll'
      condition: all of selection_*
    falsepositives:
      - Unknown
    level: critical
query_type: sigma
severity: critical
tactics:
    - TA0005
    - TA0004
    - TA0003
techniques:
    - T1574.001
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1574.001
author: MBOWER
version: "1"
references:
    - https://borncity.com/win/2024/09/01/windows-side-loading-dll-attacks-via-licensingdiag-exe/
    - https://x.com/0gtweet/status/1827991604918890968
data_sources:
    - registry_event
    - windows
