id: 4a085576-1f1d-48bb-8887-82e753f7e299
name: Execute Scriptlet Via Regsvr32
description: regsvr32.exe to execute a COM scriptlet
query: |+
    title: Execute Scriptlet Via Regsvr32
    status: experimental
    description:  regsvr32.exe to execute a COM scriptlet
    author: Joe Security
    date: 2019-10-30
    id: 200016
    threatname:
    behaviorgroup: 2
    classification: 8
    mitreattack: T1218.010

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*\system32\regsvr32.EXE /s /n /u /i:*\AppData\Roaming\\* scrobj*'
        condition: selection
    level: critical

query_type: sigma
severity: critical
tactics:
    - TA0005
techniques:
    - T1218.010
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
