id: 4dee6344-e9c8-4f31-b5fe-c0cd05f5e037
name: MedusaLocker
description: MedusaLocker key
query: |+
    title: MedusaLocker
    status: experimental
    description: MedusaLocker key
    author: Joe Security
    date: 2022-11-11
    id: 200108
    threatname: MedusaLocker
    behaviorgroup: 15
    classification: 0
    mitreattack:

    logsource:
        product: windows
        category: registry_event
    detection:
        selection:
            EventID: 13
            TargetObject:
                - '*\Software\MDSLK*Self*'
        condition: selection
    level: critical

query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - registry_event
    - windows
