id: 52988430-a3ae-402e-8375-9df00c267888
name: Suspicious modification of a fake domain controller SPN (DCshadow)
description: Detects scenarios where an attacker updates the Service Principal Name (SPN) of a fake domain controller account in order to perform DCshadow attack.
query: |-
    title: Suspicious modification of a fake domain controller SPN (DCshadow)
    description: Detects scenarios where an attacker updates the Service Principal Name (SPN) of a fake domain controller account in order to perform DCshadow attack.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/t1207-creating-rogue-domain-controllers-with-dcshadow
    - https://medium.com/@maarten.goet/dcshadow-detecting-a-rogue-domain-controller-replicating-malicious-changes-to-your-active-1e22440df9ad
    - https://github.com/shellster/DCSYNCMonitor
    - https://stealthbits.com/blog/detecting-dcshadow-with-event-logs/
    - https://www.labofapenetrationtester.com/2018/05/dcshadow-sacl.html
    - https://blog.stealthbits.com/creating-persistence-with-dcshadow/
    - https://book.hacktricks.xyz/windows/active-directory-methodology/dcshadow
    tags:
    - attack.persistence
    - attack.t1098
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4742
        ServicePrincipalNames|contains: 'GC/'
      filter:
        SubjectUserName|endswith: '$'
      condition: selection and not filter
    falsepositives:
    - New domain controller registration
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
    - TA0004
    - TA0005
techniques:
    - T1098
    - T1207
tags:
    - attack.persistence
    - attack.t1098
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/t1207-creating-rogue-domain-controllers-with-dcshadow
    - https://medium.com/@maarten.goet/dcshadow-detecting-a-rogue-domain-controller-replicating-malicious-changes-to-your-active-1e22440df9ad
    - https://github.com/shellster/DCSYNCMonitor
    - https://stealthbits.com/blog/detecting-dcshadow-with-event-logs/
    - https://www.labofapenetrationtester.com/2018/05/dcshadow-sacl.html
    - https://blog.stealthbits.com/creating-persistence-with-dcshadow/
    - https://book.hacktricks.xyz/windows/active-directory-methodology/dcshadow
data_sources:
    - windows
    - security
