id: 5942efa6-dcc8-43c9-9406-138fa25c95d5
name: Get2 Downloader
description: Get2 downloader associated with TA505
query: |
    title: Get2 Downloader
    status: experimental
    description: Get2 downloader associated with TA505
    author: Joe Security
    references:
        -https://www.proofpoint.com/us/threat-insight/post/ta505-distributes-new-sdbbot-remote-access-trojan-get2-downloader
    id: 200003
    threatname: Get2Downloader
    behaviorgroup: 2
    classification: 4
    logsource:
        service: sysmon
        product: windows
    detection:
        selection:
            EventID: 11
            Image:
                - '*\Microsoft Office\Office*'
                - '*\Microsoft Office\root\Office*'
            TargetFilename: '*Temp\oleObject1.bin'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - windows
    - sysmon
