id: 5a8d28f4-ccb7-44a8-bfc5-c892a7cf19d0
name: DNS hosts file accessed via network share
description: Detects scenarios where an attacker attempt read the Hosts file content via network share.
query: |-
    title: DNS hosts file accessed via network share
    description: Detects scenarios where an attacker attempt read the Hosts file content via network share.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1018-Remote%20System%20Discovery
    - https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks
    - https://github.com/login-securite/DonPAPI
    tags:
    - attack.discovery
    - attack.t1018
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 5145
        ShareName: '\\*\C$'
        RelativeTargetName: 'Windows\System32\Drivers\etc\hosts'
      condition: selection
    falsepositives:
    - None
    level: high
query_type: sigma
severity: high
tactics:
    - TA0007
techniques:
    - T1018
tags:
    - attack.discovery
    - attack.t1018
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1018-Remote%20System%20Discovery
    - https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks
    - https://github.com/login-securite/DonPAPI
data_sources:
    - windows
    - security
