id: 5d036c20-fa1b-4d8f-b9c7-6152a6947fc3
name: WMI registration
description: Detects scenarios where an attacker createsan instance of a WMI class using tools like WMImplant or PowerLurk.
query: |
    title: WMI registration
    description: Detects scenarios where an attacker createsan instance of a WMI class using tools like WMImplant or PowerLurk.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1546-Event%20Triggered%20Execution
    - https://github.com/Sw4mpf0x/PowerLurk
    - https://github.com/FortyNorthSecurity/WMImplant
    - https://www.netspi.com/blog/technical/adversary-simulation/getting-started-wmi-weaponization-part-5/
    - https://www.darkoperator.com/blog/2017/10/14/basics-of-tracking-wmi-activity
    tags:
    - attack.persistence
    - attack.t1546.003
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      category: wmi_event
    detection:
      selection:
        EventID:
          - 19 # WmiEventFilter activity detected
          - 20 # WmiEventConsumer activity detected
          - 21 # WmiEventConsumerToFilter activity detected
      condition: selection
    falsepositives:
    - legitimate WMI class registration
    - monitoring products
    - Microsoft System Center or security products
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
    - TA0004
techniques:
    - T1546.003
    - T1546
tags:
    - attack.persistence
    - attack.t1546.003
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1546-Event%20Triggered%20Execution
    - https://github.com/Sw4mpf0x/PowerLurk
    - https://github.com/FortyNorthSecurity/WMImplant
    - https://www.netspi.com/blog/technical/adversary-simulation/getting-started-wmi-weaponization-part-5/
    - https://www.darkoperator.com/blog/2017/10/14/basics-of-tracking-wmi-activity
data_sources:
    - wmi_event
    - windows
