id: 5eb65750-bd96-4c34-a49e-21b412ed4e42
name: Drops a DLL with WLL extension to the startup
description: Drops a DLL with WLL extension to the startup
query: |
    title: Drops a DLL with WLL extension to the startup
    status: experimental
    description: Drops a DLL with WLL extension to the startup
    author: Joe Security
    date: 2020-03-16
    id: 200064
    threatname:
    behaviorgroup: 2
    classification: 8
    logsource:
        service: sysmon
        product: windows
    detection:
        selection:
            EventID: 11
            TargetFilename:
                - '*\appdata\roaming\microsoft\\*\startup\\*.wll*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - windows
    - sysmon
