id: 6119bc12-1ec1-4e0f-be53-3ccc2259426c
name: Azure Windows virtual machine login via serial console
description: Detects if an attacker logs on using the serial console.
query: |-
    title: Azure Windows virtual machine login via serial console
    description: Detects if an attacker logs on using the serial console.
    references:
    - https://msrc.microsoft.com/blog/2023/08/azure-serial-console-attack-and-defense-part-1/
    - https://learn.microsoft.com/en-us/troubleshoot/azure/virtual-machines/serial-console-cmd-ps-commands
    - https://www.mandiant.com/resources/blog/sim-swapping-abuse-azure-serial
    tags:
    - attack.initial_access
    - attack.privilege_escalation
    - attack.t1078 # valid accounts
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4624
        LogonProcess|contains: 'sacsess.exe'
        LogonType: 2
      condition: selection
    falsepositives:
    - Virtual machine recovery by administrator
    level: high
query_type: sigma
severity: high
tactics:
    - TA0005
    - TA0003
    - TA0004
    - TA0001
techniques:
    - T1078
tags:
    - attack.initial_access
    - attack.privilege_escalation
    - attack.t1078
author: mdecrevoisier
version: "1"
references:
    - https://msrc.microsoft.com/blog/2023/08/azure-serial-console-attack-and-defense-part-1/
    - https://learn.microsoft.com/en-us/troubleshoot/azure/virtual-machines/serial-console-cmd-ps-commands
    - https://www.mandiant.com/resources/blog/sim-swapping-abuse-azure-serial
data_sources:
    - windows
    - security
