id: 61e3f89f-5bed-4eae-8732-ddeb0a797ea6
name: New rights granted to an account for privilege escalation
description: Detects scenarios where an attacker grants new rights to an account in order to escalate privileges
query: |-
    title: New rights granted to an account for privilege escalation
    description: Detects scenarios where an attacker grants new rights to an account in order to escalate privileges
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0004-Privilege%20Escalation/T1134-Access%20Token%20Manipulation
    - https://medium.com/palantir/windows-privilege-abuse-auditing-detection-and-defense-3078a403d74e
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4717
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/user-rights-assignment
    - https://medium.com/falconforce/falconfriday-detecting-lsass-dumping-with-debug-privileges-0xff1f-328fdb78f5be
    tags:
    - attack.privilege_escalation
    - attack.t1134
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID:
          - 4717 # logon right changed
          - 4704 # right assigned
      filter:
        SubjectUserName|endswith: '$'
      condition: selection and not filter
    falsepositives:
    - Specific account configuration
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0004
    - TA0005
techniques:
    - T1134
tags:
    - attack.privilege_escalation
    - attack.t1134
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0004-Privilege%20Escalation/T1134-Access%20Token%20Manipulation
    - https://medium.com/palantir/windows-privilege-abuse-auditing-detection-and-defense-3078a403d74e
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4717
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/user-rights-assignment
    - https://medium.com/falconforce/falconfriday-detecting-lsass-dumping-with-debug-privileges-0xff1f-328fdb78f5be
data_sources:
    - windows
    - security
