id: 63a1454b-38e3-47e0-9a68-1062f3ff28ff
name: Check external IP via Powershell
description: Check external IP via Powershell
query: |
    title: Check external IP via Powershell
    status: experimental
    description: Check external IP via Powershell
    author: Joe Security
    date: 2020-07-20
    id: 200081
    threatname:
    behaviorgroup: 8
    classification: 6
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*powershell*api.ipify.org*'
                - '*invoke-webrequest -uri https://iplogger*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
