id: 643f2e48-6776-4dc1-bb2a-0f5f2f1a66cb
name: Powershell download file from base64 url
description: Powershell download file from base64 url
query: |
    title: Powershell download file from base64 url
    status: experimental
    description: Powershell download file from base64 url
    author: Joe Security
    date: 2020-04-13
    id: 200072
    threatname:
    behaviorgroup: 1
    classification: 8
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*.downloadfile([system.text.encoding]::ascii.getstring([system.convert]::frombase64string(*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
