id: 6545a2fb-77f4-4c35-bfaa-dad44aca542e
name: Tomcat Kernel Backdoor Host Activity
description: Detects host-based artifacts of the Tomcat remote Kernel Backdoor, specifically the communication between the LKM and the userland component via the /proc/acpi/pcicard file.
query: |
    title: "Tomcat Kernel Backdoor Host Activity"
    id: a60d89aa-3bc1-47a8-935f-e4fad8e6a0c9
    status: experimental
    description: Detects host-based artifacts of the Tomcat remote Kernel Backdoor,
      specifically the communication between the LKM and the userland component via
      the /proc/acpi/pcicard file.
    references:
      - https://phrack.org/issues/72/7_md
    author: Jamari Donovan(JDtheHiddenOne)
    date: 2025-08-25
    tags:
      - attack.persistence
      - attack.defense_evasion
      - attack.t1014
      - threat_actor.kimsuky
    logsource:
      category: process_creation
      product: linux
    detection:
      selection:
        CommandLine|contains|all:
          - 'echo' # Command used to write to the proc file.
          - '-n' # Flag used in the specific backdoor command.
          - '/proc/acpi/pcicard' # Specific proc file created by the LKM for communication.
      condition: selection
    falsepositives:
      - Unlikely, as the `/proc/acpi/pcicard` file is created by the backdoor's LKM
        and is not a standard procfs entry.
    level: high
query_type: sigma
severity: medium
tactics:
    - TA0003
    - TA0005
techniques:
    - T1014
tags:
    - attack.persistence
    - attack.defense_evasion
    - attack.t1014
    - threat_actor.kimsuky
author: Jamari Donovan(JDtheHiddenOne)
version: "1"
references:
    - https://phrack.org/issues/72/7_md
data_sources:
    - process_creation
    - linux
