id: 661f78e8-aaf1-46c5-84c9-e8fa3baf8783
name: Steal Google chrome login data
description: Steal Google chrome login data
query: |
    title: Steal Google chrome login data
    status: experimental
    description: Steal Google chrome login data
    author: Joe Security
    date: 2019-12-09
    id: 200036
    threatname:
    behaviorgroup: 20
    classification: 4
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*/c copy*\appdata\local\google\chrome\user data\default\login data*\appdata\local\temp\db1*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
