id: 671ef38a-3d2d-4fb4-af51-120cd1b2f07e
name: High risk Active Directory group membership change
description: Detects scenarios where a suspicious group membership is changed.
query: |-
    title: High risk Active Directory group membership change
    description: Detects scenarios where a suspicious group membership is changed.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://ss64.com/nt/syntax-groups.html
    - https://docs.microsoft.com/en-us/windows/security/identity-protection/access-control/security-identifiers
    tags:
    - attack.persistence
    - attack.t1098
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID:
          - 4728 # security global group member added
          - 4756 # universal group member added
          #- 4732 # local and domain local group are covered in another rule
        TargetSid|startswith: 'S-1-5-21-'
        TargetSid|endswith:
          - '-512' # Domain Admins (global)
          - '-518' # Schema Admins (universal)
          - '-519' # Enterprise Admins (universal)
          - '-520' # Group Policy Creator Owners (global)
          #- '-525' # Protected users (global) > focus only on removal actions, not adding . See dedicated rule
          - '-526' # Key Admins (global)
          - '-527' # Enterprise Key Admins (universal)
      condition: selection
    falsepositives:
    - Administrator activity
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
    - TA0004
techniques:
    - T1098
tags:
    - attack.persistence
    - attack.t1098
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://ss64.com/nt/syntax-groups.html
    - https://docs.microsoft.com/en-us/windows/security/identity-protection/access-control/security-identifiers
data_sources:
    - windows
    - security
