id: 68704bd4-3176-4785-ad2f-c06ec59d35f6
name: SQL Server - Brutforce enumeration with non existing users (login)
description: Detects scenarios where an attacker attempts to enumerate potential existing SQL users, resulting in failed logins with unexisting or invalid accounts.
query: |-
    title: SQL Server - Brutforce enumeration with non existing users (login)
    description: Detects scenarios where an attacker attempts to enumerate potential existing SQL users, resulting in failed logins with unexisting or invalid accounts.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1110.xxx-Brut%20force
    - https://www.eraofdata.com/sql-server/connectivity/login-failures/
    - https://docs.microsoft.com/en-us/previous-versions/sql/sql-server-2008-r2/ms366351(v=sql.105)
    tags:
    - attack.credential_access
    - attack.t1110
    author: mdecrevoisier
    status: experimental
    logsource:
      product: mssql
      category: application
    detection:
      selection:
        EventID: 33205
        action_id:
          - LGFL # FAILED_LOGIN_GROUP
          - LGIF # LOGIN FAILED
        class_type: LX # LOGIN
        additional_information|contains:
          - "<state>2</state>" # User ID is not valid
          - "<state>5</state>" # Login not found
      condition: selection | count(server_principal_name) by Computer > 20
      timeframe: 30m
    falsepositives:
    - Missconfigured application
    level: high
query_type: sigma
severity: high
tactics:
    - TA0006
techniques:
    - T1110
tags:
    - attack.credential_access
    - attack.t1110
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1110.xxx-Brut%20force
    - https://www.eraofdata.com/sql-server/connectivity/login-failures/
    - https://docs.microsoft.com/en-us/previous-versions/sql/sql-server-2008-r2/ms366351(v=sql.105)
data_sources:
    - application
    - mssql
