id: 692f309d-6873-465a-9828-873c95254c07
name: Delete Shadow Copy Via Powershell
description: Delete Shadow Copy Via Powershell
query: |+
    title: Delete Shadow Copy Via Powershell
    status: experimental
    description: Delete Shadow Copy Via Powershell
    author: Joe Security
    date: 2019-10-25
    id: 200011
    threatname:
    behaviorgroup: 18
    classification: 8
    mitreattack: T1490

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*powershell*RwBlAHQALQBXAG0AaQBPAGIAagBlAGMAdAAgAFcAaQBuADMAMgBfAFMAaABhAGQAbwB3AGMAbwBwAHkAIAB8ACAARgBvAHIARQBhAGMAaAAtAE8AYgBqAGUAYwB0ACAAewAkAF8ALgBEAGUAbABlAHQAZQAoACkAOwB9AA==*'
        condition: selection
    level: critical

query_type: sigma
severity: critical
tactics:
    - TA0040
techniques:
    - T1490
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
