id: 697a69d9-886c-41f5-96c2-477e26fc7139
name: Microsoft Defender massive virus outbreach
description: Detects scenarios where a same threat is detected on different hosts in a short period of time
query: |-
    title: Microsoft Defender massive virus outbreach
    description: Detects scenarios where a same threat is detected on different hosts in a short period of time
    references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-antivirus/troubleshoot-microsoft-defender-antivirus
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/Antivirus
    tags:
    - malware
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: windefend
    detection:
      selection:
        EventID: 1116 # Threat detected, no action taken
      condition: selection | count(Computer) by ThreatName > 10
      timeframe: 30m
    falsepositives:
    - EICAR test file
    level: high
query_type: sigma
severity: high
tags:
    - malware
author: mdecrevoisier
version: "1"
references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-antivirus/troubleshoot-microsoft-defender-antivirus
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/Antivirus
data_sources:
    - windows
    - windefend
