id: 6b7b5824-afb8-4480-b68c-0f73a1780e15
name: WScript Launched By Powershell
description: powershell launches WScript, WScript executes file from startup
query: |
    title: WScript Launched By Powershell
    status: experimental
    description: powershell launches WScript, WScript executes file from startup
    author: Joe Security
    date: 2019-10-21
    id: 200004
    threatname:
    behaviorgroup: 1
    classification: 5
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            ParentCommandLine: '*\powershell.exe*'
            CommandLine:
                -'*\WScript.exe*\appdata\roaming\microsoft\word\startup\\*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
