id: 6f0e9e2b-151a-460c-8ca5-23f1e65c8542
name: Suspicious Kerberos password account reset to issue potential Golden ticket
description: Detects scenarios where a suspicious password reset of the Krbtgt account is performed by attacker to issue a potential Golden ticket.
query: |-
    title: Suspicious Kerberos password account reset to issue potential Golden ticket
    description: Detects scenarios where a suspicious password reset of the Krbtgt account is performed by attacker to issue a potential Golden ticket.
    references:
    - https://cert.europa.eu/static/WhitePapers/CERT-EU-SWP_14_07_PassTheGolden_Ticket_v1_1.pdf
    - https://adsecurity.org/?p=483
    tags:
    - attack.credential_access
    - attack.t1558.001
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4724
        TargetSid|endswith: '-502' # Krbtgt account SID
      condition: selection
    falsepositives:
    - Administrators following best practices and reseting the Krbtgt password 1 or 2 times a year
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0006
techniques:
    - T1558.001
tags:
    - attack.credential_access
    - attack.t1558.001
author: mdecrevoisier
version: "1"
references:
    - https://cert.europa.eu/static/WhitePapers/CERT-EU-SWP_14_07_PassTheGolden_Ticket_v1_1.pdf
    - https://adsecurity.org/?p=483
data_sources:
    - windows
    - security
