id: 7174b3c6-b4b6-43ac-ad32-9e807a0cb52c
name: WebDAV Mount Point Detection
description: This rule detects file events where the target object path indicates a WebDAV mount point, specifically looking for paths containing '\Device\Mup\;WebDavRedirector\.*\DavWWWRoot\.*' combined with a domain name or IP address. This pattern is often associated with forced authentication attempts or ingress tool transfer via WebDAV.
query: |
    # WEBDAV FILE MOUNT POINT
    logsource:
      category: file_event
      product: windows
    detection:
      selection:
        TargetObject|regex: '\\Device\\Mup\\;WebDavRedirector\\.*\\DavWWWRoot\\.*'
      filter_domain_or_ip:
        TargetObject|regex:
          - '[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}'
          - '(\d{1,3}\.){3}\d{1,3}'
      condition: selection and filter_domain_or_ip
    falsepositives:
      - Legitimate use of WebDAV with valid domains or IPs for file sharing or
        collaboration.
    title: WebDAV Mount Point Detection
    description: This rule detects file events where the target object path
      indicates a WebDAV mount point, specifically looking for paths containing
      '\Device\Mup\;WebDavRedirector\.*\DavWWWRoot\.*' combined with a domain name
      or IP address. This pattern is often associated with forced authentication
      attempts or ingress tool transfer via WebDAV.
    author: "Chaitanya B (Mr.Alien)"
query_type: sigma
severity: medium
tactics:
    - TA0006
    - TA0011
techniques:
    - T1187
    - T1105
author: Chaitanya B (Mr.Alien)
version: "1"
data_sources:
    - file_event
    - windows
