id: 72571391-c26b-47e3-b032-1758ff0b5644
name: Webserver IIS configuration edited (SYSMON)
description: Detects scenarios where an attacker attempts to edit IIS configuration file in order to load a module.
query: |-
    title: Webserver IIS configuration edited (SYSMON)
    description: Detects scenarios where an attacker attempts to edit IIS configuration file in order to load a module.
    requirements: requires to update SYSMON configuration to include the IIS application path.
    references:
    - https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
    - https://docs.microsoft.com/en-us/iis/get-started/planning-your-iis-architecture/introduction-to-applicationhostconfig
    tags:
    - attack.persistence
    - attack.t1505.004
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      category: file_event
    detection:
      selection:
        EventID: 11
        TargetFilename|endswith: '\inetsrv\config\applicationHost.config'
      condition: selection
    falsepositives:
    - rare administrator change
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
techniques:
    - T1505.004
tags:
    - attack.persistence
    - attack.t1505.004
author: mdecrevoisier
version: "1"
references:
    - https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
    - https://docs.microsoft.com/en-us/iis/get-started/planning-your-iis-architecture/introduction-to-applicationhostconfig
data_sources:
    - file_event
    - windows
