id: 7831e011-d68e-4a0e-baea-66e060314170
name: BITS payload downloaded via commandline
description: Detects scenarios where an attacker downloads a payload by abusing BITS software. For more precise information, inspect "Bits-client" event log and search for ID 59 and 60.
query: |-
    title: BITS payload downloaded via commandline
    description: Detects scenarios where an attacker downloads a payload by abusing BITS software. For more precise information, inspect "Bits-client" event log and search for ID 59 and 60.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1197-BITS%20jobs
    - https://medium.com/@threathuntingteam/background-intelligent-transfer-protocol-ab81cd900aa7
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/bitsadmin-examples
    - https://www.microsoft.com/security/blog/2019/12/12/multi-stage-downloader-trojan-sload-abuses-bits-almost-exclusively-for-malicious-activities/
    - https://medium.com/@threathuntingteam/background-intelligent-transfer-protocol-ab81cd900aa7
    - https://www.hackingarticles.in/windows-for-pentester-bitsadmin/
    - https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
    tags:
    - attack.exfiltration
    - attack.t1048 # Exfiltration Over Alternative Protocol
    - attack.lateral_movement
    - attack.t1570 # Lateral Tool Transfer
    - attack.Command_and_control
    - attack.t1105 # Ingress Tool Transfer
    - attack.persistence
    - attack.t1197 # Bits jobs
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      category: process_creation
    detection:
      selection:
        NewProcessName|endswith: '\bitsadmin.exe'
        CommandLine|contains:
        - '/transfer'
        - '/download'
      condition: selection
    falsepositives:
    - None
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0010
    - TA0003
    - TA0008
    - TA0011
    - TA0005
techniques:
    - T1048
    - T1570
    - T1105
    - T1197
tags:
    - attack.exfiltration
    - attack.t1048
    - attack.lateral_movement
    - attack.t1570
    - attack.Command_and_control
    - attack.t1105
    - attack.persistence
    - attack.t1197
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1197-BITS%20jobs
    - https://medium.com/@threathuntingteam/background-intelligent-transfer-protocol-ab81cd900aa7
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/bitsadmin-examples
    - https://www.microsoft.com/security/blog/2019/12/12/multi-stage-downloader-trojan-sload-abuses-bits-almost-exclusively-for-malicious-activities/
    - https://medium.com/@threathuntingteam/background-intelligent-transfer-protocol-ab81cd900aa7
    - https://www.hackingarticles.in/windows-for-pentester-bitsadmin/
    - https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
data_sources:
    - process_creation
    - windows
