id: 79083d3f-b636-4aa4-a2f8-6e6cb8550b2a
name: Capture Wi-Fi password
description: Capture Wi-Fi password
query: |
    title: Capture Wi-Fi password
    status: experimental
    description: Capture Wi-Fi password
    author: Joe Security
    date: 2020-05-07
    id: 200075
    threatname:
    behaviorgroup: 20
    classification: 6
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*netsh* wlan show profile*'
                - '*netsh wlan show profile*'
                - '*netsh wlan export profile key=clear folder=*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
