id: 835703a8-bfb4-4c59-9930-117d1d2fce78
name: Active Directory PowerShell module called from a non administrative host
description: Detects scenarios where an attacker attempts to load the Active Directory PowerShell module on a non administrative host in order to enumerate users, groups, ... Also note that no user information is reported by this event ID and that some correation would be required.
query: |
    title: Active Directory PowerShell module called from a non administrative host
    description: Detects scenarios where an attacker attempts to load the Active Directory PowerShell module on a non administrative host in order to enumerate users, groups, ... Also note that no user information is reported by this event ID and that some correation would be required.
    correlation: correlate EventID 600 with ID 800 using field "HostId" or "RunspaceId" to obtain the user that triggered the action.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1087-Account%20discovery
    tags:
    - attack.discovery
    - attack.t1087.002
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 600
        ProviderName: ActiveDirectory
      filter:
        - Computer: '%admin_workstation%'
        - Computer: '%domain_controllers%'
      condition: selection and not filter
    falsepositives:
    - Adminitrative host, jump host, domain controllers, Exchange servers, application interacting with Active Directory modules
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0007
techniques:
    - T1087.002
    - T1087
tags:
    - attack.discovery
    - attack.t1087.002
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1087-Account%20discovery
data_sources:
    - windows
    - security
