id: 85387582-478f-4ef0-9cf6-06384335bd63
name: Suspicious modification of a computer account SPN
description: Detects scenarios where an attacker update the Service Principal Name (SPN) of a computer account in order to perform "Kerberos redirection" and escalate privileges.
query: |-
    title: Suspicious modification of a computer account SPN
    description: Detects scenarios where an attacker update the Service Principal Name (SPN) of a computer account in order to perform "Kerberos redirection" and escalate privileges.
    references:
    - https://dirkjanm.io/krbrelayx-unconstrained-delegation-abuse-toolkit/
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    tags:
    - attack.persistence
    - attack.t1098
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4742
      filter:
        SubjectUserName|endswith: '$'
        ServicePrincipalNames: '-'
        ServicePrincipalNames|contains: 'GC/' # covered by dedicated DCshadow rule
      condition: selection and not filter
    falsepositives:
    - Rare administrator modifications on computer objects
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
    - TA0004
techniques:
    - T1098
tags:
    - attack.persistence
    - attack.t1098
author: mdecrevoisier
version: "1"
references:
    - https://dirkjanm.io/krbrelayx-unconstrained-delegation-abuse-toolkit/
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
data_sources:
    - windows
    - security
