id: 85637ca2-331e-4140-922a-a785b3fecb6b
name: Account set with reversible encryption (weakness introduction)
description: Detects scenarios where an attacker set an account with reversible encryption to facilitate brutforce or cracking operations.
query: |-
    title: Account set with reversible encryption (weakness introduction)
    description: Detects scenarios where an attacker set an account with reversible encryption to facilitate brutforce or cracking operations.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://www.blackhillsinfosec.com/how-i-cracked-a-128-bit-password/
    tags:
    - attack.persistence
    - attack.t1098
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4738
        UserAccountControl: '%%2091' # Store password using reversible encryption - True
      condition: selection
    falsepositives:
    - None
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
    - TA0004
techniques:
    - T1098
tags:
    - attack.persistence
    - attack.t1098
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://www.blackhillsinfosec.com/how-i-cracked-a-128-bit-password/
data_sources:
    - windows
    - security
