id: 8d1f586f-ae9a-4ab0-beca-23e9b6da150d
name: Account marked as sensitive and cannot be delegated had its protection removed (weakness introduction)
description: Detects scenarios where an attacker removes security protection from a sensitive account to escalate privileges
query: |-
    title: Account marked as sensitive and cannot be delegated had its protection removed (weakness introduction)
    description: Detects scenarios where an attacker removes security protection from a sensitive account to escalate privileges
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://www.sans.org/blog/protecting-privileged-domain-accounts-safeguarding-access-tokens/
    - https://www.cyberark.com/resources/threat-research-blog/weakness-within-kerberos-delegation
    - https://book.hacktricks.xyz/windows/stealing-credentials/credentials-protections#protected-users
    tags:
    - attack.persistence
    - attack.t1098
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4738
        UserAccountControl: '%%2062' # Account is sensitive and cannot be delegated - FALSE
      condition: selection
    falsepositives:
    - none
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
    - TA0004
techniques:
    - T1098
tags:
    - attack.persistence
    - attack.t1098
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://www.sans.org/blog/protecting-privileged-domain-accounts-safeguarding-access-tokens/
    - https://www.cyberark.com/resources/threat-research-blog/weakness-within-kerberos-delegation
    - https://book.hacktricks.xyz/windows/stealing-credentials/credentials-protections#protected-users
data_sources:
    - windows
    - security
