id: 9397df05-e974-40ae-8e19-8276c986a773
name: NanoCore
description: detect run.dat of NanoCore
query: |
    title: NanoCore
    status: experimental
    description: detect run.dat of NanoCore
    author: Joe Security
    date: 2019-11-08
    id: 200023
    threatname: NanoCore
    behaviorgroup: 14,20,21,22
    classification: 4
    logsource:
        service: sysmon
        product: windows
    detection:
        selection:
            EventID: 11
            TargetFilename: '*\AppData\Roaming\\*-*-*-*-*\run.dat*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - windows
    - sysmon
