id: 948c7252-7448-4352-9e08-9fa4c8f38f6c
name: Office 365 email rule breach (on behalf)
description: Detects scenarios where an attacker attempt to hide emails in order to perform phishing attacks by replacing, for example, financial information from the original email with another email containing attacker's financial information. This technique may also be used to avoid specific email notification to be received by end users in case, for example, of an ongoing breach.
query: |
    title: Office 365 email rule breach (on behalf)
    description: Detects scenarios where an attacker attempt to hide emails in order to perform phishing attacks by replacing, for example, financial information from the original email with another email containing attacker's financial information. This technique may also be used to avoid specific email notification to be received by end users in case, for example, of an ongoing breach.
    references:
    - https://redcanary.com/blog/email-forwarding-rules/
    - https://raw.githubusercontent.com/PwC-IR/Business-Email-Compromise-Guide/main/PwC-Business_Email_Compromise-Guide.pdf
    - https://docs.microsoft.com/en-us/microsoft-365/security/defender/alert-grading-playbook-email-forwarding?view=o365-worldwide
    - https://logrhythm.com/blog/detecting-and-preventing-auto-forwarding-and-phishing-attacks-in-office-365/
    - https://www.huntress.com/blog/business-email-compromise-via-azure-administrative-privileges
    tags:
    - attack.collection
    - attack.t1114
    - attack.initial_access
    - attack.t1566
    author: mdecrevoisier
    status: experimental
    logsource:
      product: azure
      service: office365
    detection:
      selection:
        Operation:
          - 'New-InboxRule'
          - 'Set-InboxRule'
        Parameters.Name:
      condition: selection
    level: high
query_type: sigma
severity: high
tactics:
    - TA0009
    - TA0001
techniques:
    - T1114
    - T1566
tags:
    - attack.collection
    - attack.t1114
    - attack.initial_access
    - attack.t1566
author: mdecrevoisier
version: "1"
references:
    - https://redcanary.com/blog/email-forwarding-rules/
    - https://raw.githubusercontent.com/PwC-IR/Business-Email-Compromise-Guide/main/PwC-Business_Email_Compromise-Guide.pdf
    - https://docs.microsoft.com/en-us/microsoft-365/security/defender/alert-grading-playbook-email-forwarding?view=o365-worldwide
    - https://logrhythm.com/blog/detecting-and-preventing-auto-forwarding-and-phishing-attacks-in-office-365/
    - https://www.huntress.com/blog/business-email-compromise-via-azure-administrative-privileges
data_sources:
    - azure
    - office365
