id: 94d5fa1b-dd37-43f9-bbcd-d7d326fd0bee
name: Powershell run code from registry
description: Powershell run code from registry
query: |
    title: Powershell run code from registry
    status: experimental
    description: Powershell run code from registry
    author: Joe Security
    date: 2020-02-12
    id: 200051
    threatname:
    behaviorgroup: 1
    classification: 8
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*powershell*iex(get-itemproperty hkcu*'
                - '*powershell*iex(get-itemproperty khlm*'
                - '*powershell*iex*::ascii.getstring(( gp*hkcu:*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
