id: 97493c49-426b-4570-b2f5-bbcc2978286b
name: VSS backup deletion (WMI)
description: Detects scenarios where an attacker attempts to delete existing VSS backup.
query: |-
    title: VSS backup deletion (WMI)
    description: Detects scenarios where an attacker attempts to delete existing VSS backup.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0040-Impact/T1490-Inhibit%20System%20Recovery
    - https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks
    - https://www.itechtics.com/volume-shadow-copies/
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin
    - https://www.picussecurity.com/resource/blog/technique-to-delete-volume-shadow-copies-deviceiocontrol
    - https://lolbas-project.github.io/lolbas/Binaries/Wmic/
    - https://www.mandiant.com/resources/chasing-avaddon-ransomware
    - https://blogs.vmware.com/security/2022/09/threat-report-illuminating-volume-shadow-deletion.html
    tags:
    - attack.impact
    - attack.t1490
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      category: process_creation
    detection:
      selection: # wmic shadowcopy delete /nointeractive
        NewProcessName|endswith: \wmic.exe
        CommandLine|contains|all:
          - shadowcopy
          - delete
      condition: selection
    falsepositives:
    - administrator cleaning outdated backup
    level: high
query_type: sigma
severity: high
tactics:
    - TA0040
techniques:
    - T1490
tags:
    - attack.impact
    - attack.t1490
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0040-Impact/T1490-Inhibit%20System%20Recovery
    - https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks
    - https://www.itechtics.com/volume-shadow-copies/
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin
    - https://www.picussecurity.com/resource/blog/technique-to-delete-volume-shadow-copies-deviceiocontrol
    - https://lolbas-project.github.io/lolbas/Binaries/Wmic/
    - https://www.mandiant.com/resources/chasing-avaddon-ransomware
    - https://blogs.vmware.com/security/2022/09/threat-report-illuminating-volume-shadow-deletion.html
data_sources:
    - process_creation
    - windows
