id: 979c9ea8-69e1-4410-aaf0-a03c32e434ba
name: Fortinet APT group abuse on Windows (task)
description: Detects scenarios where APT actors exploits Fortinet vulnerabilities to gain access into Windows infrastructure.
query: |-
    title: Fortinet APT group abuse on Windows (task)
    description: Detects scenarios where APT actors exploits Fortinet vulnerabilities to gain access into Windows infrastructure.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/EVTX_full_APT_attack_steps
    - https://www.aha.org/system/files/media/file/2021/05/fbi-flash-tlp-white-apt-actors-exploiting-fortinet-vulnerabilities-to-gain-access-for-malicious-activity-5-27-21.pdf
    - https://www.securityweek.com/fbi-shares-iocs-apt-attacks-exploiting-fortinet-vulnerabilities
    tags:
    - attack.execution
    - attack.t1053.005
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4698
        TaskName|endswith: '\SynchronizeTimeZone'
      condition: selection
    falsepositives:
    - None
    level: high
query_type: sigma
severity: high
tactics:
    - TA0002
    - TA0003
    - TA0004
techniques:
    - T1053.005
tags:
    - attack.execution
    - attack.t1053.005
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/EVTX_full_APT_attack_steps
    - https://www.aha.org/system/files/media/file/2021/05/fbi-flash-tlp-white-apt-actors-exploiting-fortinet-vulnerabilities-to-gain-access-for-malicious-activity-5-27-21.pdf
    - https://www.securityweek.com/fbi-shares-iocs-apt-attacks-exploiting-fortinet-vulnerabilities
data_sources:
    - windows
    - security
