id: 98896eef-c57b-49df-8393-12a2f261bba5
name: Domain group enumeration
description: Detects scenarios where an attacker enumerates domain group with tools like CME (--groups).
query: |
    title: Domain group enumeration
    description: Detects scenarios where an attacker enumerates domain group with tools like CME (--groups).
    correlation: correlate TargetLogonId from ID 4624 with SubjectLogonId from ID 4661 to identify the source of the enumeration.
    requirements: extended rights auditing enabled (https://www.manageengine.com/products/active-directory-audit/active-directory-auditing-configuration-guide-configure-object-level-auditing-manually.html)
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1069-Permission%20Groups%20Discovery
    - https://hideandsec.sh/books/cheatsheets/page/crackmapexec
    - https://www.infosecmatter.com/crackmapexec-module-library/
    - https://docs.microsoft.com/en-us/windows/win32/adschema/extended-rights
    tags:
    - attack.discovery
    - attack.t1069.002
    - attack.t1087.002
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4662
        ObjectType|contains: '{bf967a9c-0de6-11d0-a285-00aa003049e2}' # Groups class
        ObjectServer: DS
        OperationType: Object Access
      filter:
        SubjectUserName|endswith: '$'
      condition: selection and not filter | count(ObjectName) by Computer > 30 # Count how many different ObjectName (GUID of the group) were enumerated.
      timeframe: 15m
    falsepositives:
    - Administrator activity
    level: high
query_type: sigma
severity: high
tactics:
    - TA0007
techniques:
    - T1069.002
    - T1087.002
    - T1069
tags:
    - attack.discovery
    - attack.t1069.002
    - attack.t1087.002
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1069-Permission%20Groups%20Discovery
    - https://hideandsec.sh/books/cheatsheets/page/crackmapexec
    - https://www.infosecmatter.com/crackmapexec-module-library/
    - https://docs.microsoft.com/en-us/windows/win32/adschema/extended-rights
data_sources:
    - windows
    - security
