id: 9b9154cb-ba7d-47fd-b9b4-5fc261dc43d1
name: TamperedChef - PDF Editor.exe, OneStart, ManualFinder and related hashes
query: |
    title: TamperedChef - PDF Editor.exe, OneStart, ManualFinder and related hashes
    id: a6022e03-a2b7-49e9-8f4e-5a01b04ea2ec
    status: experimental
    references:
      - >-
        https://www.virustotal.com/gui/file/abbb3e96b910c9d1e2074dc05fd51e78984941f03bcb7d443714838849a7a928
    author: Emil Stahl
    date: 2025-08-25T00:00:00.000Z
    tags:
      - threat.ioc
    logsource:
      category: file_event
      product: windows
      service: sysmon
    detection:
      selection:
        sha256:
          - bd21360149904ce42c6927d9c3fb482316f2537a4a7bce8b64990428e27a54ac
          - cf5194e7f63de52903b5d61109fd0d898b73dd3a07512e151077fba23cdf4800
          - b0c321d6e2fc5d4e819cb871319c70d253c3bf6f9a9966a5d0f95600a19c0983
          - abbb3e96b910c9d1e2074dc05fd51e78984941f03bcb7d443714838849a7a928
          - 5b754b9285d472ac1f2e9aa928fdbf6109d43374a448726a57bc24b7d9c4be75
          - 1c90519a6d75be37ef3ed591bfea92effa0cc0f724993f440977486368eacaf0
          - 8dd11957597d357877ced612aa820e24526830d365f86bd8e879f81f3398fc70
          - 611f9610808cfabd14118de2a469451203201c213a6da1ff8ab099d863895a82
          - 0365c2d3164bca9e2517508bb81b29c2f8565bef570bb50849e10a89ff0d3171
          - 6dfd5793fa84f54be855ad4bd16bf561e6c80699527ba40e9d50ca6cd27b7768
          - 9f369e63b773c06588331846dd247e48c4030183df191bc53d341fcc3be68851
          - b07cbb84d08e579320f9006acac55275618fad5334069dd9251162cc64f013cf
          - 4331c79e34c13857f419448cfdad67c1216f90d27629514ca6ad3281592a4dbf
          - 9c58aaca8dde7198240f7684b545575e4833d725d67f37e674e333eeb3ec642c
          - d8bff72de51213510004a2652b9e31b48a25e2eb0d7184fabef9014fc85e145
          - 8ecd3c8c126be7128bf654456d171284f03e4f212c27e1b33f875b8907a7bc65
          - e8f0ddfa96c4a8e12e9156f5f1078f287d844537cd70f7849bf9e306acc3eefa
          - eb5ac3ff4fd1afcf641c79642b6a180d8475b3e1073a3e734589f1b8a9458c4a
          - 7ae44a0606e74fa34cde274a0ed05b899992a9cda60124e8c60403774c7206bc
          - 73616f5e4ba6d21948339a2c4aa340000a729f4a62f15f39f7fcc2dac4a227a9
          - 96deb9504cd93f2f8cba14238af4bcacf8135c64c54a8e8c5c1658d0aaac5a2a
          - 3c00f83c095e8a84d9fb0dc47374a2434a056803c1bb2321ecf9882eea237c78
          - 87867c63806735bf8906621291ee87a2a6f593009899fe96258e741606820e92
          - 785e6a82ff8e1f87af0de6870ffa84446aa8cda1fc5cf323a3d9a0a4f36a561b
          - 3a3f3834de56df0c6f360d07e67373db9606627c2cbb3adf2d6892ac25b9b5a9
          - ce49a3b1e4161fb1869d013f198a1f05888735f9cc31c357449a7ebdfd12af71
          - 5a925624ae4d0ecbad35415f8526e409cd724bb008077eaa3ef8b9fe25878c88
          - 28c39ba950d2fb48b9733ce1ae590f763718ba9ede4619dc5261295f1c47ef20
          - 0c1e64a631985dad7008c87958d1312d8bf75b4f41ff2901f479c7f716035042
          - 4fa75264d257ebef5d837150fec58994682335dd351356d302f12777f7156769
          - 66bfdce8dfc1e55f26fe41059cdcdf00178265a3c7045e608db6d428a13bd291
          - 2e224a7a7bc6e85f8d16ae4258ee5f88a5bcc104148c0612250e6c2faf37a187
          - ed797beb927738d68378cd718ea0dc74e605df0e66bd5670f557217720fb2871
          - 71edb9f9f757616fe62a49f2d5b55441f91618904517337abd9d0725b07c2a51
          - 6e8b48972fab5610363cf4063c289e1670a252fdd40c020de0e3cfcd33c819f4
          - 83efb5f2688207a7ccf49ddb81cb094543c2fef5bf73f01342cc39b0af68e72b
          - afb0c6b4b0af0a14ac725c025ac70e8b2d8b392094ecdb10e8a2afe2ecf47ea8
          - bcb46bf1c909958a09c52d22ca54dc281357e3c5bdc0f87a6f54553b7c31af9d
          - c541cfe6baea9c48e44f808977846c2f2a2dab4cfcca677701ceac6d8fc4e1cc
          - f97c7edb0d8d9b65bf23df76412b6d2bbfbab6e3614e035789e4e1a30e40b7f1
          - 3c702aa9c7e0f2e6557f3f4ac129afd2ad4cfa2b027d6f4a357c02d4185359c4
          - 09207f1dfdd000b42b3433b85d051e8e446a1a1f2f63ab66d47edb9b196f618c
          - 69b373084e47cbb54a9003ae2435adb49f184bfa11989a2800700da22a153dff
          - f605a23f811acdee17d8fc13f0d962a6317509acaa0763fef237a69d5870aca2
          - f748022beadc73f905f9cd2d5b94be2095265433f6c9770860facda2f6b623c6
          - da3c6ec20a006ec4b289a90488f824f0f72098a2f5c2d3f37d7a2d4a83b344a0
          - 1dfd349f202c8822cbe2b45a23105b54c89eb01aa27c840b2dccdd483040da1c
          - 5485bafd43f2f3865f18e74a14a00a433971cdc5b50c357bd0307179e0187e3d
          - ce0019424497040351c9054aa2ee6b07fc610024cc2cb2cc810de80f838c7a14
          - 5e1689ca04778ff0c5764abc50b023bd71b9ab7841a40f425c5fee4b798f8e11
          - d0838244e7ebd0b4bd7d7486745346af6b9b3509e9a79b2526dcfea9d83c6b74
          - 9dc1b05b8fc53c84839164e82200c5d484b65eeba25b246777fa324869487140
          - 13006fdcb956478039312ff221fad2d33bb442ec4f080970140bb02284f4c29b
          - 4bd84f6c7ea513049f138471ceb248a843be0cdc86ecf9bece70095b89d452e7
          - 852ab5e11d0470d2882cd24cd4330051fd6f411ab186b475ee69388608144e70
          - fde67ba523b2c1e517d679ad4eaf87925c6bbf2f171b9212462dc9a855faa34b
          - fbc7ffc5bdda978afe0f20910210752d91762b97d6d7719a5b3a1e352a4717c3
          - ee4bbc26ede35c9d8c5df7431b798144ab8c563c0ef54a6f52fee29538a6d1e9
          - eaeaeffc67b9180fefc780b0b2b75fc15c1395e1f286f0600c2e3bc5b73512c5
          - dfb2334a9f5010e29a8896ec93fbf03ad88d580f0fc4d81e868e0d301df33fc3
          - cb15e1ec1a472631c53378d54f2043ba57586e3a28329c9dbf40cb69d7c10d2c
          - c3839917e12e1b3ad5407840a057dfa060550f5dc70103a491e7e180dc58fd66
          - b66d89ee13a48e9c8d4a7aa2e3e1cb2b79f0b95e4f74f4184b85628656281588
          - 9704e97a395649e9ea4450b3afde5c1f1b22caa05407c4db3ef1625b9db05324
          - 8ed1bf3052f8c1a5a7bc25d3cd2ccc1e275261f59912213d76c2964dc345d267
          - 8341b5cd52cff58c908f653daa4228538efd12aff76ac1b00856d362e9ca612d
          - 32c07f0061a3b747328bee57bcac98b4f15eae0341186772bbb177aaaa318a2b
          - 2a3f76fc7f953403653eff71f21c16d40512c1bcd7a038657bb1d0a4efbee677
          - 17355179730a16c9a1e4e81b747ae084618c2210c11dcb78b291ca757dacc853
          - 1619bcad3785be31ac2fdee0ab91392d08d9392032246e42673c3cb8964d4cb7
          - 08ea829d5c97aab089abe19686d274f829aa1cee3670d2819885e33f39a4d602
          - 01d8cd72d231f6ab9cd6325b1e53fcf3796fa804bbd130bc56f17af373daa5e9
      condition: selection
    falsepositives:
      - Legitimate files that are incorrectly included in the hash list.
    level: critical
query_type: sigma
severity: critical
tactics:
    - TA0002
    - TA0005
    - TA0010
techniques:
    - T1204
    - T1059
    - T1036
    - T1027
    - T1070.004
tags:
    - threat.ioc
author: Emil Stahl
version: "1"
references:
    - https://www.virustotal.com/gui/file/abbb3e96b910c9d1e2074dc05fd51e78984941f03bcb7d443714838849a7a928
data_sources:
    - file_event
    - windows
