id: 9b9afa31-1c19-47cf-9743-6ad2c63217c3
name: New member added to a "OCS/Lync/Skype for Business" administration group (medium risk)
description: Detects scenarios where a new member is added to a sensitive administration group related to OCS/Lync/Skype for Business in order to scan topology, infiltrate servers and move laterally.
query: |-
    title: New member added to a "OCS/Lync/Skype for Business" administration group (medium risk)
    description: Detects scenarios where a new member is added to a sensitive administration group related to OCS/Lync/Skype for Business in order to scan topology, infiltrate servers and move laterally.
    references:
    - https://docs.microsoft.com/en-us/previous-versions/office/lync-server-2013/lync-server-2013-planning-for-role-based-access-control
    - https://docs.microsoft.com/en-us/skypeforbusiness/schema-reference/active-directory-schema-extensions-classes-and-attributes/changes-made-by-forest-preparation
    - https://blog.insideo365.com/2012/11/a-lync-administrator-access-refresher/
    tags:
    - attack.persistence
    - attack.t1098
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID:
          - 4728 # security global group member added
          - 4756 # universal group member added
          - 4732 # local and domain local group member added
        TargetUserName:
          - CSArchivingAdministrator
          - CSUserAdministrator
          - RTCHSUniversalServices
          - RTCUniversalGlobalWriteGroup
          - RTCUniversalSBATechnicians
      condition: selection
    falsepositives:
    - OCS/Lync/Skype administrator updating server configuration or topology
    - OCS/Lync/Skype upgrade or migration
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
    - TA0004
techniques:
    - T1098
tags:
    - attack.persistence
    - attack.t1098
author: mdecrevoisier
version: "1"
references:
    - https://docs.microsoft.com/en-us/previous-versions/office/lync-server-2013/lync-server-2013-planning-for-role-based-access-control
    - https://docs.microsoft.com/en-us/skypeforbusiness/schema-reference/active-directory-schema-extensions-classes-and-attributes/changes-made-by-forest-preparation
    - https://blog.insideo365.com/2012/11/a-lync-administrator-access-refresher/
data_sources:
    - windows
    - security
