id: 9be6e197-243d-47b7-aac4-905396c2dd4d
name: Reference to Administrator Group SID via PowerShell Script
description: |
    The SID S-1-5-32-544 refers to the builtin "Administrators" group on a local Windows machine. Threat actors will often reference this SID rather than the group name in order to obfuscate their actions. References to the SID rather than the group name should be considered unusual.
query: |-
    title: Reference to Administrator Group SID via PowerShell Script
    id: 27d7285e-e2e6-480c-a21a-aeea7e525f47
    status: experimental
    description: |
        The SID S-1-5-32-544 refers to the builtin "Administrators" group on a local Windows machine. Threat actors will often reference this SID rather than the group name in order to obfuscate their actions. References to the SID rather than the group name should be considered unusual.
    author: Tim Peck
    date: 2025/07/23
    references:
      - https://www.security.com/threat-intelligence/play-ransomware-zero-day
      - https://www.securonix.com/blog/detecting-steepmaverick-new-covert-attack-campaign-targeting-military-contractors/
      - https://thedfirreport.com/2024/01/29/buzzing-on-christmas-eve-trigona-ransomware-in-3-hours/
      - https://research.checkpoint.com/2023/raspberry-robin-anti-evasion-how-to-exploit-analysis/
    logsource:
      product: windows
      service: powershell
      category: ps_script
    detection:
      selection:
        ScriptBlockText|contains: 'S-1-5-32-544'
      condition: selection
    fields:
      - User
      - Computer
      - ScriptBlockText
    tags:
      - attack.persistence
      - attack.T1098.007
      - threat.steep_maverick
      - threat.play
      - threat.trigona
      - threat.bluesky
      - threat.raspberry_robin
      - threat.STEEP#MAVERICK
    level: medium
    falsepositives:
        - Legitimate useage of an SID to the Administrators group.
query_type: sigma
severity: medium
techniques:
    - T1098.007
tags:
    - attack.persistence
    - attack.T1098.007
    - threat.steep_maverick
    - threat.play
    - threat.trigona
    - threat.bluesky
    - threat.raspberry_robin
    - threat.STEEP#MAVERICK
author: Tim Peck
version: "1"
references:
    - https://www.security.com/threat-intelligence/play-ransomware-zero-day
    - https://www.securonix.com/blog/detecting-steepmaverick-new-covert-attack-campaign-targeting-military-contractors/
    - https://thedfirreport.com/2024/01/29/buzzing-on-christmas-eve-trigona-ransomware-in-3-hours/
    - https://research.checkpoint.com/2023/raspberry-robin-anti-evasion-how-to-exploit-analysis/
data_sources:
    - ps_script
    - windows
    - powershell
