id: 9cb7a2e7-7ea6-416a-9813-b3ae9ac1a9a6
name: RDP shadow session started (native)
description: Detects scenarios where an attacker has initiated a RDP shadow session.
query: |-
    title: RDP shadow session started (native)
    description: Detects scenarios where an attacker has initiated a RDP shadow session.
    references:
    - http://woshub.com/rds-shadow-how-to-connect-to-a-user-session-in-windows-server-2012-r2/
    - https://www.elastic.co/guide/en/security/current/potential-remote-desktop-shadowing-activity.html
    - https://bitsadm.in/blog/spying-on-users-using-rdp-shadowing
    - https://swarm.ptsecurity.com/remote-desktop-services-shadowing/
    tags:
    - attack.lateral_movement
    - attack.t1021.001 # remote services: RDP
    - attack.collection
    - attack.t1113 # screen capture
    - attack.t1125 # video capture
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      category: rdp
    detection:
      selection:
        EventID:
          - 20503 # Shadow View Session Started
          - 20504 # Shadow View Session Stopped
          - 20508 # Shadow View Permission Granted
        Channel: Microsoft-Windows-TerminalServices-RemoteConnectionManager/Operational
      condition: selection
    falsepositives:
    - target host where shadowing is performed
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0009
    - TA0008
techniques:
    - T1021.001
    - T1113
    - T1125
tags:
    - attack.lateral_movement
    - attack.t1021.001
    - attack.collection
    - attack.t1113
    - attack.t1125
author: mdecrevoisier
version: "1"
references:
    - http://woshub.com/rds-shadow-how-to-connect-to-a-user-session-in-windows-server-2012-r2/
    - https://www.elastic.co/guide/en/security/current/potential-remote-desktop-shadowing-activity.html
    - https://bitsadm.in/blog/spying-on-users-using-rdp-shadowing
    - https://swarm.ptsecurity.com/remote-desktop-services-shadowing/
data_sources:
    - rdp
    - windows
