id: 9f451c81-107e-44bb-b05d-0c92bd927479
name: WebDAV Cookie Process via Rundll32
description: Detects the use of rundll32.exe to set WebDAV cookies, which can be indicative of forced authentication attempts or other malicious network activity. This technique is often used by adversaries to capture NTLM hashes by tricking a system into authenticating to a malicious server.
query: |
    # WEBDAV COOKIE PROCESS
    logsource:
      category: process_creation
      product: windows
    detection:
      selection:
        Image|endswith: '\rundll32.exe'
        CommandLine|contains: 'davclnt.dll,DavSetCookie'
      filter_domain_or_ip:
        CommandLine|regex:
          - 'https?:\/\/[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}'
          - 'https?:\/\/(\d{1,3}\.){3}\d{1,3}'
      condition: selection and filter_domain_or_ip
    falsepositives:
      - Legitimate use of WebDAV with valid domains or IPs
      - though this is uncommon for rundll32.exe to perform directly.
    title: WebDAV Cookie Process via Rundll32
    description: Detects the use of rundll32.exe to set WebDAV cookies, which can be
      indicative of forced authentication attempts or other malicious network
      activity. This technique is often used by adversaries to capture NTLM hashes
      by tricking a system into authenticating to a malicious server.
    author: Chaitanya B (Mr.Alien)
query_type: sigma
severity: medium
tactics:
    - TA0006
    - TA0005
    - TA0011
techniques:
    - T1187
    - T1218.011
    - T1102.001
author: Chaitanya B (Mr.Alien)
version: "1"
data_sources:
    - process_creation
    - windows
