id: 9f88a679-0aaa-4c83-9e25-d0c890076a8e
name: Copy file to startup via Powershell
description: Copy file to startup via Powershell
query: |
    title: Copy file to startup via Powershell
    status: experimental
    description: Copy file to startup via Powershell
    author: Joe Security
    date: 2022-10-28
    id: 200106
    threatname:
    behaviorgroup: 2
    classification: 1
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*copy-item *\roaming\microsoft\windows\start menu\programs\startup*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
