id: a3c34824-fa4e-4dfd-acf7-fc312bb11d21
name: Network share manipulation via commandline
description: Detects scenarios where an attacker attempts to enumerate or to establish a connection to a network share.
query: |-
    title: Network share manipulation via commandline
    description: Detects scenarios where an attacker attempts to enumerate or to establish a connection to a network share.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.002%20-SMB%20Windows%20Admin%20Shares
    - https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
    - https://attack.mitre.org/software/S0039/
    tags:
    - attack.lateral_movement
    - attack.t1021.002
    author: mdecrevoisier
    logsource:
      product: windows
      category: process_creation
    detection:
      selection: # Full command example: 'net share'
        EventID: 4688
        NewProcessName|endswith:
          - \net1.exe
          - \net.exe
        CommandLine|contains: share
      condition: selection
    falsepositives:
    - Pentest
    level: high
query_type: sigma
severity: high
tactics:
    - TA0008
techniques:
    - T1021.002
tags:
    - attack.lateral_movement
    - attack.t1021.002
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.002%20-SMB%20Windows%20Admin%20Shares
    - https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
    - https://attack.mitre.org/software/S0039/
data_sources:
    - process_creation
    - windows
