id: a8d25515-336a-432b-a8ca-a1838c298b41
name: Service abuse with backdoored "command failure" (service)
description: Detects scenarios where an attacker modify the configuration of a service to trigger an action when the service is crashed.
query: |-
    title: Service abuse with backdoored "command failure" (service)
    description: Detects scenarios where an attacker modify the configuration of a service to trigger an action when the service is crashed.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1543.003-Create%20or%20Modify%20System%20Process-Windows%20Service
    - https://twitter.com/JohnLaTwC/status/1432689635122159623?s=09
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc742019(v=ws.11)
    - https://pentestlab.blog/2020/01/22/persistence-modify-existing-service/
    tags:
    - attack.persistence
    - attack.t1543.003
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      category: process_creation
    detection:
      selection:
        EventID: 4688
        NewProcessName|endswith: \sc.exe
        CommandLine|contains|all: # Full command: sc failure W32Time command= "\"c:\Windows\system32\pentestlab.exe\""
          - sc
          - failure
          - command
      condition: selection
    falsepositives:
    - administrator reconfiguring service
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
    - TA0004
techniques:
    - T1543.003
tags:
    - attack.persistence
    - attack.t1543.003
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1543.003-Create%20or%20Modify%20System%20Process-Windows%20Service
    - https://twitter.com/JohnLaTwC/status/1432689635122159623?s=09
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc742019(v=ws.11)
    - https://pentestlab.blog/2020/01/22/persistence-modify-existing-service/
data_sources:
    - process_creation
    - windows
