id: a9bb7e0b-524b-4399-89b4-a3686bdec865
name: Run CertUtil from suspicious location
description: Run CertUtil from suspicious location
query: |
    title: Run CertUtil from suspicious location
    status: experimental
    description: Run CertUtil from suspicious location
    author: Joe Security
    date: 2020-08-11
    id: 200084
    threatname:
    behaviorgroup: 20
    classification: 4
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*c:\programdata\curl.com /urlcache /f http*'
                - '*programdata\\*.exe -urlcache -f -split http*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
