id: aa184ac1-40d1-4f70-bbf6-2989149b95cc
name: Credwiz util dropped by mshta for dll sideloading
description: Credwiz util dropped by mshta for dll sideloading
query: |
    title: Credwiz util dropped by mshta for dll sideloading
    status: experimental
    description: Credwiz util dropped by mshta for dll sideloading
    author: Joe Security
    date: 2020-01-01
    id: 200041
    threatname:
    behaviorgroup: 7
    classification: 8
    mitreattack: T1574.002

    logsource:
        service: sysmon
        product: windows
    detection:
        selection:
            EventID: 11
            Image: '*\mshta.exe*'
            TargetFilename:
                - '*\credwiz.exe*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
tactics:
    - TA0003
    - TA0004
    - TA0005
techniques:
    - T1574.002
author: Joe Security
version: "1"
data_sources:
    - windows
    - sysmon
