id: ad2735eb-f47b-4731-aa2f-aa62d37e2158
name: SQL Server - new member added to a database role
description: Detects scenarios where an attacker adds his account to a database role (db_securityadmin, db_datawriter, db_securityadmin, ...)
query: |-
    title: SQL Server - new member added to a database role
    description: Detects scenarios where an attacker adds his account to a database role (db_securityadmin, db_datawriter, db_securityadmin, ...)
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://docs.microsoft.com/en-us/sql/relational-databases/security/auditing/sql-server-audit-action-groups-and-actions
    - https://docs.microsoft.com/en-us/sql/relational-databases/security/authentication-access/server-level-roles
    tags:
    - attack.account_manipulation
    - attack.t1098
    author: mdecrevoisier
    status: experimental
    logsource:
      product: mssql
      category: application
    detection:
      selection: # ALTER ROLE [db_datareader] ADD MEMBER [DEMO\svc-kasp-db]
        EventID: 33205
        action_id:
          - APRL # ADD MEMBER
          - ADDP # DATABASE_ROLE_MEMBER_CHANGE_GROUP
        class_type: RL # ROLE
      condition: selection
    falsepositives:
    - DBA activity
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0003
    - TA0004
techniques:
    - T1098
tags:
    - attack.account_manipulation
    - attack.t1098
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://docs.microsoft.com/en-us/sql/relational-databases/security/auditing/sql-server-audit-action-groups-and-actions
    - https://docs.microsoft.com/en-us/sql/relational-databases/security/authentication-access/server-level-roles
data_sources:
    - application
    - mssql
