id: b04aaee8-3538-41c9-9661-c639b39c7f4c
name: Exchange server impersonation via PrivExchange relay attack
description: Detects scenarios where an attacker relays Exchange server authentication to abuse Exchange servers permissions and escalate privileges.
query: |
    title: Exchange server impersonation via PrivExchange relay attack
    description: Detects scenarios where an attacker relays Exchange server authentication to abuse Exchange servers permissions and escalate privileges.
    references:
    - https://dirkjanm.io/abusing-exchange-one-api-call-away-from-domain-admin/
    - https://twitter.com/_dirkjan/status/1091632489561575424?s=20
    tags:
    - attack.credential_access
    - attack.t1557.001
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4624
        AuthenticationPackageName: NTLM
        LogonProcessName: NtLmSsp
        LogonType: 3
        Computer: '%domain_controllers%' # Logon event has to be generated on a DC
        TargetUserName: # Exchange server HOSTNAMES list + "$"
          - SRVEXCH01$
          - SRVEXCH02$
          - SRVEXCH03$
      filter:
        IpAddress: '%exchange_server_ips%' # Source has to be attacker relay
      condition: selection and not filter
    falsepositives:
    - None
    level: high
query_type: sigma
severity: high
tactics:
    - TA0006
    - TA0009
techniques:
    - T1557.001
tags:
    - attack.credential_access
    - attack.t1557.001
author: mdecrevoisier
version: "1"
references:
    - https://dirkjanm.io/abusing-exchange-one-api-call-away-from-domain-admin/
    - https://twitter.com/_dirkjan/status/1091632489561575424?s=20
data_sources:
    - windows
    - security
