id: b080159c-f3e3-43ff-80fd-0166f95b0038
name: Account password set to never expire.
description: Detects scenarios where an account password is set to never expire.
query: |-
    title: Account password set to never expire.
    description: Detects scenarios where an account password is set to never expire.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    tags:
    - attack.persistence
    - attack.t1098
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4738
        UserAccountControl: '%%2089' # Account never expires - TRUE
      condition: selection
    falsepositives:
    - IAM solution, User Management solutions
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0003
    - TA0004
techniques:
    - T1098
tags:
    - attack.persistence
    - attack.t1098
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
data_sources:
    - windows
    - security
