id: b1384b38-905a-43ff-98dc-81bcd85f9e73
name: Get antivirus details via WMIC query
description: Get antivirus details via WMIC query
query: |
    title: Get antivirus details via WMIC query
    status: experimental
    description: Get antivirus details via WMIC query
    author: Joe Security
    date: 2020-03-27
    id: 200069
    threatname:
    behaviorgroup: 5
    classification: 8
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                -'*wmic * path antivirusproduct get displayname*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
