id: b2460b3f-e35f-4aa2-9342-151bcb261c23
name: Metasploit reverse shell injection in SQL Server
description: Detects scenarios where an attacker inject a payload into SQL Server in order to obtain a remote shell.
query: |-
    title: Metasploit reverse shell injection in SQL Server
    description: Detects scenarios where an attacker inject a payload into SQL Server in order to obtain a remote shell.
    references:
    - https://www.offensive-security.com/metasploit-unleashed/payloads-mssql/#
    tags:
    - attack.execution
    - attack.t1059.003
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      category: process_creation
    detection:
      selection:
        #Version: 2  # applies to ID 4688 where parent process name is available starting Windows 10 / Server 2016 and higher
        ParentProcessName|endswith: '\sqlservr.exe'
        NewProcessName|endswith:
          - \cmd.exe
          - \powershell.exe
          - \pwsh.exe # PowerShell v6
        CommandLine|contains|all:
          - cmd
          - echo
        CommandLine|contains:
          - /c
          - -c
      condition: selection
    falsepositives:
    - none
    level: high
query_type: sigma
severity: high
tactics:
    - TA0002
techniques:
    - T1059.003
tags:
    - attack.execution
    - attack.t1059.003
author: mdecrevoisier
version: "1"
references:
    - https://www.offensive-security.com/metasploit-unleashed/payloads-mssql/#
data_sources:
    - process_creation
    - windows
