id: b3fff6d7-036f-40c3-8605-68e5d6f15ec8
name: Fortinet APT group abuse on Windows (user)
description: Detects scenarios where APT actors exploits Fortinet vulnerabilities to gain access into Windows infrastructure.
query: |-
    title: Fortinet APT group abuse on Windows (user)
    description: Detects scenarios where APT actors exploits Fortinet vulnerabilities to gain access into Windows infrastructure.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/EVTX_full_APT_attack_steps
    - https://www.aha.org/system/files/media/file/2021/05/fbi-flash-tlp-white-apt-actors-exploiting-fortinet-vulnerabilities-to-gain-access-for-malicious-activity-5-27-21.pdf
    - https://www.securityweek.com/fbi-shares-iocs-apt-attacks-exploiting-fortinet-vulnerabilities
    tags:
    - attack.persistence
    - attack.t1136
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4720
        TargetUserName:
          - elie
          - WADGUtilityAccount
      condition: selection
    falsepositives:
    - None
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
techniques:
    - T1136
tags:
    - attack.persistence
    - attack.t1136
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/EVTX_full_APT_attack_steps
    - https://www.aha.org/system/files/media/file/2021/05/fbi-flash-tlp-white-apt-actors-exploiting-fortinet-vulnerabilities-to-gain-access-for-malicious-activity-5-27-21.pdf
    - https://www.securityweek.com/fbi-shares-iocs-apt-attacks-exploiting-fortinet-vulnerabilities
data_sources:
    - windows
    - security
