id: b4302cac-95bf-464c-9142-98aa96f89bd9
name: Powershell execute code from registry
description: Powershell execute code from registry
query: |
    title: Powershell execute code from registry
    status: experimental
    description: Powershell execute code from registry
    author: Joe Security
    date: 2020-06-15
    id: 200079
    threatname:
    behaviorgroup: 5
    classification: 8
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*(gp hkcu:\software).*)|iex*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
