id: b5420f00-114f-49c0-b4bb-e455fb1b052f
name: User creation via commandline
description: Detects scenarios where an attacker attempts to create a user via commandline.
query: |-
    title: User creation via commandline
    description: Detects scenarios where an attacker attempts to create a user via commandline.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1136-Create%20account
    - https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
    - https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/
    - https://attack.mitre.org/software/S0039/
    - https://regex101.com/r/S6vTNM/1
    tags:
    - attack.persistence
    - attack.t1136.001
    - attack.t1136.002
    author: mdecrevoisier
    logsource:
      product: windows
      category: process_creation
    detection:
      selection: # Full command example: 'net user <username> <password> /ADD'
        NewProcessName|endswith:
          - \net1.exe
          - \net.exe
        CommandLine|contains|all:
          - net
          - user
          - add
      condition: selection
    falsepositives:
    - Pentest
    - Administrator activity
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
techniques:
    - T1136.001
    - T1136.002
    - T1136
tags:
    - attack.persistence
    - attack.t1136.001
    - attack.t1136.002
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1136-Create%20account
    - https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
    - https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/
    - https://attack.mitre.org/software/S0039/
    - https://regex101.com/r/S6vTNM/1
data_sources:
    - process_creation
    - windows
