id: b5b606f5-e95f-4fe0-ba83-353165ea92e0
name: Suspicious Kerberos proxiable/S4U2self ticket (CVE-2021-42278/42287)
description: Detects scenarios where an attacker attempts to request a proxiable ticket. This action may trigger while attempting to identify a vulnerable target or using some offsensive Kerberos tools like Kerbrute, Impacket...
query: |-
    title: Suspicious Kerberos proxiable/S4U2self ticket (CVE-2021-42278/42287)
    description: Detects scenarios where an attacker attempts to request a proxiable ticket. This action may trigger while attempting to identify a vulnerable target or using some offsensive Kerberos tools like Kerbrute, Impacket...
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1558-Steal%20or%20Forge%20Kerberos%20Tickets
    - https://exploit.ph/cve-2021-42287-cve-2021-42278-weaponisation.html
    - https://www.thehacker.recipes/ad/movement/kerberos/samaccountname-spoofing
    - https://support.microsoft.com/en-us/topic/kb5008380-authentication-updates-cve-2021-42287-9dafac11-e0d0-4cb8-959a-143bd0201041
    - https://github.com/WazeHell/sam-the-admin
    - https://github.com/cube0x0/noPac
    - https://github.com/ly4k/Pachine
    - https://www.jpcert.or.jp/english/pub/sr/20170612ac-ir_research_en.pdf
    tags:
    - attack.credential_access
    - attack.t1558 # forged ticket
    - attack.privilege_escalation
    - attack.t1068 # exploitation for privilege escalation
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4768
        Status: 0x0 # Success
        ServiceSid|endswith: '-502' # Krbtgt account SID
        TicketOptions: '0x50800000' # Forwardable, Proxiable, Renewable ticket
      filter:
        - IpAddress: '%domain_controllers_ips%'     # reduce amount of false positives
        - TargetUserName: '%account_allowed_proxy%' # accounts allowed to perform proxiable requests
      condition: selection and not filter
    falsepositives:
    - Applications or services performing delegation activities
    level: high
query_type: sigma
severity: high
tactics:
    - TA0006
    - TA0004
techniques:
    - T1558
    - T1068
tags:
    - attack.credential_access
    - attack.t1558
    - attack.privilege_escalation
    - attack.t1068
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1558-Steal%20or%20Forge%20Kerberos%20Tickets
    - https://exploit.ph/cve-2021-42287-cve-2021-42278-weaponisation.html
    - https://www.thehacker.recipes/ad/movement/kerberos/samaccountname-spoofing
    - https://support.microsoft.com/en-us/topic/kb5008380-authentication-updates-cve-2021-42287-9dafac11-e0d0-4cb8-959a-143bd0201041
    - https://github.com/WazeHell/sam-the-admin
    - https://github.com/cube0x0/noPac
    - https://github.com/ly4k/Pachine
    - https://www.jpcert.or.jp/english/pub/sr/20170612ac-ir_research_en.pdf
data_sources:
    - windows
    - security
