id: ba04c98e-d25a-4877-9fee-d0031922af37
name: TamperedChef - PDF Editor.exe  - C2 domain
description: Detects network traffic to a list of known domains that are related to TamperedChef - PDF Editor.exe  - C2 traffic.
query: |
    title: TamperedChef - PDF Editor.exe  - C2 domain
    id: f035f308-3bf6-4e3b-924b-231eb9db4bf0
    status: experimental
    description: "Detects network traffic to a list of known domains that are
      related to TamperedChef - PDF Editor.exe  - C2 traffic."
    references:
      - https://www.virustotal.com/gui/domain/5b7crp.com
    author: Emil Stahl
    date: 2025-08-25
    tags:
      - attack.command_and_control
    logsource:
      category: network_connection
      product: zeek
    detection:
      selection:
        # List of known suspicious DGA-like domains
        destination.domain:
          - '2h4fen.com'
          - '2m8ikt.com'
          - '2r5kg4.com'
          - '2t9nxy.com'
          - '3jf4dx.com'
          - '5b7crp.com'
          - '5dr9jq.com'
          - '5dtb9a.com'
          - '65rwqc.com'
          - '6m4eun.com'
          - '7bw3tn.com'
          - '8st9kp.com'
          - '9mdp5.com'
          - '9mdp5f.com'
          - '9rw7bc.com'
          - 'a5cj3m.com'
          - 'a82kwm.com'
          - 'abf26u.com'
          - 'agm62w.com'
          - 'bw5f1k.com'
          - 'c6hak4.com'
          - 'cu5p3k.com'
          - 'cyj9u7.com'
          - 'd7sm2w.com'
          - 'dfm8h5.com'
          - 'ed6hk4.com'
          - 'ef84ny.com'
          - 'f2b9yt.com'
          - 'gc7pu2.com'
          - 'gx8en2.com'
          - 'h4b5dc.com'
          - 'he5a4f.com'
          - 'hx3d2a.com'
          - 'j3a4uw.com'
          - 'jp1t4y.com'
          - 'k3rba5.com'
          - 'k46lej.com'
          - 'k4d2ab.com'
          - 'ke9uy4.com'
          - 'kn7kt2.com'
          - 'mka3e8.com'
          - 'n3ij9v.com'
          - 'nc1p8x.com'
          - 'p1p9nh.com'
          - 'p6h5bs.com'
          - 'pf7g3m.com'
          - 'pu2mg8.com'
          - 'r2j8bc.com'
          - 'r92h4z.com'
          - 's4p6tq.com'
          - 'sc75rj.com'
          - 'td3y9m.com'
          - 'v7rh9r.com'
          - 'w3n7ab.com'
          - 'x2bvn5.com'
          - 'xskqr6.com'
          - 'y2iax5.com'
          - 'y9pn6a.com'
      condition: selection
    falsepositives:
      - Legitimate traffic to these domains is highly unlikely. However, false
        positives may occur if any of these domains are sinkholed for research
        purposes and visited by a security researcher.
    level: high
query_type: sigma
severity: high
tactics:
    - TA0011
techniques:
    - T1568.002
tags:
    - attack.command_and_control
author: Emil Stahl
version: "1"
references:
    - https://www.virustotal.com/gui/domain/5b7crp.com
data_sources:
    - network_connection
    - zeek
