id: bbac1060-fa75-48d0-b633-7bb6d808b7e3
name: Sodinokibi
description: Sodinokibi random extension key
query: |+
    title: Sodinokibi
    status: experimental
    description: Sodinokibi random extension key
    author: Joe Security
    date: 2022-11-02
    id: 200107
    threatname: Sodinokibi
    behaviorgroup: 15
    classification: 0
    mitreattack:

    logsource:
        product: windows
        category: registry_event
    detection:
        selection:
            EventID: 13
            TargetObject:
                - '*recfg*rnd_ext*'
        condition: selection
    level: critical

query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - registry_event
    - windows
