id: bd958cbe-ba6a-48e8-818e-9a1efe3b7add
name: Schedule VBS From Appdata
description: Schedule vb script From Appdata
query: |+
    title: Schedule VBS From Appdata
    status: experimental
    description: Schedule vb script From Appdata
    author: Joe Security
    date: 2019-10-29
    id: 200012
    threatname:
    behaviorgroup: 2
    classification: 4
    mitreattack: T1053

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*\schtasks.exe* /create *wscript /E:vbscript *\AppData\Roaming\\*'
                - '*schtasks /create *\appdata\roaming\\*.vbs*'
                - '*schtasks /create *\appdata\roaming\\*.js*'
        condition: selection
    level: critical

query_type: sigma
severity: critical
tactics:
    - TA0002
    - TA0003
    - TA0004
techniques:
    - T1053
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
