id: c286af2c-4084-4086-9d41-220bd624983e
name: SQL Server - Member got new privileges added on a database
description: Detects scenarios where an attacker grants new privileges on a database level
query: |-
    title: SQL Server - Member got new privileges added on a database
    description: Detects scenarios where an attacker grants new privileges on a database level
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://docs.microsoft.com/en-us/sql/relational-databases/security/auditing/sql-server-audit-action-groups-and-actions
    - https://docs.microsoft.com/en-us/sql/relational-databases/security/authentication-access/server-level-roles
    tags:
    - attack.account_manipulation
    - attack.t1098
    author: mdecrevoisier
    status: experimental
    logsource:
      product: mssql
      category: application
    detection:
      selection: # GRANT [Privilege] TO [DEMO\svc-netwrix-db]
        EventID: 33205
        action_id:
          - G   # GRANT
          - GWG # GRANT WITH GRANT
        class_type: DB # DATABASE
      condition: selection
    falsepositives:
    - DBA activity
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0003
    - TA0004
techniques:
    - T1098
tags:
    - attack.account_manipulation
    - attack.t1098
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://docs.microsoft.com/en-us/sql/relational-databases/security/auditing/sql-server-audit-action-groups-and-actions
    - https://docs.microsoft.com/en-us/sql/relational-databases/security/authentication-access/server-level-roles
data_sources:
    - application
    - mssql
