id: c4e6aa15-fc62-4e75-86b0-138f2daac68f
name: LimeRAT
description: LimeRAT
query: |
    title: LimeRAT
    status: experimental
    description: LimeRAT
    author: Joe Security
    date: 2021-07-22
    id: 200102
    threatname: LimeRAT
    behaviorgroup: 14,20,21,22
    classification: 4
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*schtasks*limerat*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
