id: c4fafe6a-d50d-4c4e-bd05-0b5916bdad4f
name: Massive remote service creation via named pipes (TChopper, CME)
description: Detects scenarios where an attacker remotely creates a service over named pipes. Tools like Tchopper or CrackMapExec can trigger this rule.
query: |-
    title: Massive remote service creation via named pipes (TChopper, CME)
    description: Detects scenarios where an attacker remotely creates a service over named pipes. Tools like Tchopper or CrackMapExec can trigger this rule.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0002-Execution/T1569.002-Service%20execution
    - https://github.com/lawrenceamer/TChopper
    tags:
    - attack.execution
    - attack.t1569
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 5145
        ShareName: '\\*\IPC$'
        RelativeTargetName: svcctl
        AccessList|contains: '%%4417' # WriteData
      filter:
        SubjectUserName|endswith: '$'
      condition: selection and not filter | count(Computer) by IpAddress > 20
    falsepositives:
    - Administrator activity, backup solutions
    level: high
query_type: sigma
severity: high
tactics:
    - TA0002
techniques:
    - T1569
    - T1569.002
tags:
    - attack.execution
    - attack.t1569
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0002-Execution/T1569.002-Service%20execution
    - https://github.com/lawrenceamer/TChopper
data_sources:
    - windows
    - security
