id: c685d0e3-4727-4a83-a636-08d9de636f52
name: ReflectiveLoader
description: ReflectiveLoader
query: |
    title: ReflectiveLoader
    status: experimental
    description: ReflectiveLoader
    author: Joe Security
    date: 2020-11-12
    id: 200091
    threatname: ReflectiveLoader
    behaviorgroup: 1
    classification: 5
    mitreattack: T1055

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                -'*.dll,_reflectiveloader*'
                -'*.dll,reflectiveloader*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
tactics:
    - TA0005
    - TA0004
techniques:
    - T1055
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
