id: c862906b-f52a-49cd-bcb6-192e0484609b
name: Possible Command Line Obfuscation via Carets
description: Detects command line obfuscation using carets (^) in Windows interpreters like cmd.exe and PowerShell.
query: |-
    title: Possible Command Line Obfuscation via Carets
    id: 12345678-90ab-cdef-1234-567890abcdef
    status: experimental
    description: >-
      Detects command line obfuscation using carets (^) in Windows interpreters like
      cmd.exe and PowerShell.
    author: Jamari Donovan(JDtheHiddenOne)
    date: 2025/08/25
    references:
      - >-
        https://www.googlecloudcommunity.com/gc/Community-Blog/Counting-Characters-to-Find-Obfuscated-Commands/ba-p/875162
    logsource:
      category: process_creation
      product: windows
    detection:
      selection:
        Image|endswith:
          - \cmd.exe
          - \powershell.exe
          - \pwsh.exe
        CommandLine|re: '[\#\^]+[a-zA-Z]+[\#\^]+[a-zA-Z]+'
      condition: selection
    falsepositives:
      - Scripts or legitimate administrative tools using carets for escaping
        characters
    level: medium
    tags:
      - attack.defense_evasion
      - attack.t1027.010
query_type: sigma
severity: medium
tactics:
    - TA0005
    - TA0002
techniques:
    - T1027.010
    - T1059.001
    - DS0009
tags:
    - attack.defense_evasion
    - attack.t1027.010
author: Jamari Donovan(JDtheHiddenOne)
version: "1"
references:
    - https://www.googlecloudcommunity.com/gc/Community-Blog/Counting-Characters-to-Find-Obfuscated-Commands/ba-p/875162
data_sources:
    - process_creation
    - windows
