id: c953bc43-c069-44e3-b680-9f2a3b21173b
name: New network file share created
description: Detects scenarios when a new file share is created.
query: |-
    title: New network file share created
    description: Detects scenarios when a new file share is created.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.002%20-SMB%20Windows%20Admin%20Shares
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5142
    tags:
    - attack.lateral_movement
    - attack.t1021.002
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 5142
      filter:
        SubjectUserName|endswith: '$' # Share created by the system are ignored
      condition: selection and not filter
    falsepositives:
    - Administrator actvity
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0008
techniques:
    - T1021.002
tags:
    - attack.lateral_movement
    - attack.t1021.002
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.002%20-SMB%20Windows%20Admin%20Shares
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5142
data_sources:
    - windows
    - security
