id: cea1c39e-a14b-4967-9c9c-ca2f728f142e
name: MSBuild Launched By Scr
description: Code injection in msbuild.exe by .scr file
query: |
    title: MSBuild Launched By Scr
    status: experimental
    description: Code injection in msbuild.exe by .scr file
    author: Joe Security
    date: 2019-10-21
    id: 200005
    threatname:
    behaviorgroup: 4
    classification: 4
    mitreattack: T1127

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            ParentCommandLine: '*\\*.scr*'
            CommandLine:
                -'*\Microsoft.NET\\*\MSBuild.exe*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
tactics:
    - TA0005
techniques:
    - T1127
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
