id: d0332a8c-ea0e-4d1e-848f-af897d53f5d9
name: High risk local/domain local group membership change
description: Detects scenarios where a suspicious group membership is changed. Having Microsoft LAPS installed may trigger false positive events for the builtin administrators group triggered by the system account (S-1-5-18).
query: |-
    title: High risk local/domain local group membership change
    description: Detects scenarios where a suspicious group membership is changed. Having Microsoft LAPS installed may trigger false positive events for the builtin administrators group triggered by the system account (S-1-5-18).
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://ss64.com/nt/syntax-groups.html
    - https://docs.microsoft.com/en-us/windows/security/identity-protection/access-control/security-identifiers
    tags:
    - attack.persistence
    - attack.t1098
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 4732 # local and domain local group
        TargetSid|startswith: 'S-1-5-32'
        TargetSid|endswith:
          - '-544' # Administrators
          - '-547' # Power Users
          - '-548' # Account Operators
          - '-549' # Server Operators
          - '-551' # Backup Operators
          - '-578' # Hyper-V Administrators
      filter:
        SubjectUserSid: 'S-1-5-18' # LAPS or others IAM solutions may trigger this as a false positive
      condition: selection and not filter
    falsepositives:
    - Administrator activity
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
    - TA0004
techniques:
    - T1098
tags:
    - attack.persistence
    - attack.t1098
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
    - https://ss64.com/nt/syntax-groups.html
    - https://docs.microsoft.com/en-us/windows/security/identity-protection/access-control/security-identifiers
data_sources:
    - windows
    - security
