id: d5fb9e93-b05b-4632-b3a4-8ccaa509c252
name: Register Jar In Run Key
description: register jar in run key
query: |
    title: Register Jar In Run Key
    status: experimental
    description: register jar in run key
    author: Joe Security
    date: 2019-11-07
    id: 200022
    threatname:
    behaviorgroup: 2
    classification: 4
    mitreattack: T1547.001

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*reg add *\Software\Microsoft\Windows\CurrentVersion\Run /v *\AppData\Roaming\\*.jar*'
                - '*reg add *\software\microsoft\windows\currentversion\run /v *javaw.exe -jar*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
tactics:
    - TA0003
    - TA0004
techniques:
    - T1547.001
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
