id: d74afce0-2fd4-4d57-8c93-6e15e91587e2
name: Microsoft Defender massive host infection
description: Detects scenarios where multiple suspicious threats are detected on a single host
query: |-
    title: Microsoft Defender massive host infection
    description: Detects scenarios where multiple suspicious threats are detected on a single host
    references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-antivirus/troubleshoot-microsoft-defender-antivirus
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/Antivirus
    tags:
    - malware
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: windefend
    detection:
      selection:
        EventID: 1116 # Threat detected, no action taken
      condition: selection | count(ThreatName) by Computer > 5
      timeframe: 30m
    falsepositives:
    - EICAR test file
    level: high
query_type: sigma
severity: high
tags:
    - malware
author: mdecrevoisier
version: "1"
references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-antivirus/troubleshoot-microsoft-defender-antivirus
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/Antivirus
data_sources:
    - windows
    - windefend
