id: d7622d98-a44d-4eba-8b2f-0957e67de13b
name: User properties enumeration via commandline
description: Detects scenarios where an attacker attempts to enumerate local users via commandline.
query: |-
    title: User properties enumeration via commandline
    description: Detects scenarios where an attacker attempts to enumerate local users via commandline.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1087-Account%20discovery
    - https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
    - https://attack.mitre.org/software/S0039/
    tags:
    - attack.discovery
    - attack.t1087.001
    - attack.t1087.002
    author: mdecrevoisier
    logsource:
      product: windows
      category: process_creation
    detection:
      selection: # Full command example: 'net user administrator [/domain]'
        NewProcessName|endswith:
          - \net1.exe
          - \net.exe
        CommandLine|contains:
          - net
          - user
          - domain
      filter:
        CommandLine|contains: add # refers to another use case for user creation via commandline
      condition: selection and not filter
    falsepositives:
    - Pentest
    - Administrator activity
    level: high
query_type: sigma
severity: high
tactics:
    - TA0007
techniques:
    - T1087.001
    - T1087.002
    - T1087
tags:
    - attack.discovery
    - attack.t1087.001
    - attack.t1087.002
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1087-Account%20discovery
    - https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
    - https://attack.mitre.org/software/S0039/
data_sources:
    - process_creation
    - windows
