id: d936ebe8-15c2-45e3-a3cf-9cd3ac4dc698
name: LSASS credential dump with LSASSY (admin share)
description: Detects scenarios where an attacker remotely dump LSASS credentials using the LSASSY tool.
query: |-
    title: LSASS credential dump with LSASSY (admin share)
    description: Detects scenarios where an attacker remotely dump LSASS credentials using the LSASSY tool.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
    - https://github.com/Hackndo/lsassy
    tags:
    - attack.credential_access
    - attack.t1003.001
    author: mdecrevoisier
    status: experimental
    logsource:
      product: Windows
      service: security
    detection:
      selection:
        EventID: 5145
        ShareName: '\\*\C$'
        RelativeTargetName|startswith: Windows # path can be changed in source code
        RelativeTargetName|endswith: '.dmp'    # example: 'Windows\Temp\FbWJpFnX.dmp'. Extension can be changed in source code
      condition: selection
    falsepositives:
    - none
    level: high
query_type: sigma
severity: high
tactics:
    - TA0006
techniques:
    - T1003.001
    - T1003
tags:
    - attack.credential_access
    - attack.t1003.001
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
    - https://github.com/Hackndo/lsassy
data_sources:
    - Windows
    - security
