id: e226b850-0aa1-4b24-b90d-cf2d48948578
name: Powershell launch wmic via class
description: Powershell launch wmic via class
query: |
    title: Powershell launch wmic via class
    status: experimental
    description: Powershell launch wmic via class
    author: Joe Security
    date: 2020-03-03
    id: 200058
    threatname:
    behaviorgroup: 7
    classification: 8
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*powershell*[wmiclass]*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
