id: e2ef1183-4ee8-4e45-ab55-d2fa1b4a8358
name: DSRM password changed (native)
description: Detects scenarios where an attacker reset or synchronize with another domain account the DSRM (Directory Services Restore Mode) password in order to escalate privileges.
query: |
    title: DSRM password changed (native)
    description: Detects scenarios where an attacker reset or synchronize with another domain account the DSRM (Directory Services Restore Mode) password in order to escalate privileges.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
    - https://adsecurity.org/?p=1714
    - https://adsecurity.org/?p=1785
    - https://book.hacktricks.xyz/windows/active-directory-methodology/dsrm-credentials
    - https://www.hackingarticles.in/domain-persistence-dsrm/
    - https://azurecloudai.blog/2020/06/19/how-to-reset-the-directory-service-restore-mode-dsrm-password/
    tags:
    - attack.persistence
    - attack.t1098
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection: # full command: NTDSUTIL >> set dsrm password >> reset password on server null >> <password>
      selection:
        EventID: 4794
      condition: selection
    falsepositives:
    - Disaster recovery situation
    level: high
query_type: sigma
severity: high
tactics:
    - TA0003
    - TA0006
    - TA0004
techniques:
    - T1098
    - T1003
tags:
    - attack.persistence
    - attack.t1098
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
    - https://adsecurity.org/?p=1714
    - https://adsecurity.org/?p=1785
    - https://book.hacktricks.xyz/windows/active-directory-methodology/dsrm-credentials
    - https://www.hackingarticles.in/domain-persistence-dsrm/
    - https://azurecloudai.blog/2020/06/19/how-to-reset-the-directory-service-restore-mode-dsrm-password/
data_sources:
    - windows
    - security
