id: e43dddb9-586a-4c8a-b9a4-a8a716d0bb96
name: User files dump via network share (DonPapi, Lazagne)
description: Detects scenarios where an attacker attempt to dump user profile information via network share.
query: |
    title: User files dump via network share (DonPapi, Lazagne)
    description: Detects scenarios where an attacker attempt to dump user profile information via network share.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1555-Credentials%20from%20Password%20Stores
    - https://github.com/login-securite/DonPAPI
    tags:
    - attack.credential_access
    - attack.t1555
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 5145
        ShareName: '\\*\C$'
        RelativeTargetName|re:
          - Users\\.*\\Desktop.*
          - Users\\.*\\Recent.*
          - Users\\.*\\Downloads.*
          #- Users\\.* # More broader filter
      filter:
        - RelativeTargetName|re: Users\\.*\\AppData\\.* # handled in another rule
        - IpAddress:
          - '%vulnerability_scanners%'
          - '%admin_netork_administration%'
      condition: selection and not filter | count(RelativeTargetName) by Computer > 15 # Counting over different user names in the path can also decrease false positives
      timeframe: 5m
    falsepositives:
    - Roaming user profile, vulnerability scanners
    level: high
query_type: sigma
severity: high
tactics:
    - TA0006
techniques:
    - T1555
tags:
    - attack.credential_access
    - attack.t1555
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1555-Credentials%20from%20Password%20Stores
    - https://github.com/login-securite/DonPAPI
data_sources:
    - windows
    - security
