id: e734a3d9-7e2b-4e6d-94b3-cc25ad1d7b45
name: Powershell Launched By Winword
description: powershell with enco parameter launched by winword / excel / powerpoint
query: |
    title: Powershell Launched By Winword
    status: experimental
    description: powershell with enco parameter launched by winword / excel / powerpoint
    author: Joe Security
    date: 2019-10-18
    id: 200002
    threatname:
    behaviorgroup: 1
    classification: 5
    mitreattack: T1055
    matchonlyifnot: 184

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            ParentImage: '*\Program Files\Microsoft Office*.EXE'
            CommandLine:
                -'*\powershell.exe* -enco *'
        condition: selection
    level: critical
query_type: sigma
severity: critical
tactics:
    - TA0005
    - TA0004
techniques:
    - T1055
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
