id: e764b330-943e-47fc-ae4a-3e1034569e2e
name: Tor Proxy Activity via torsocks Process
description: |
    This rule looks for the usage of the torsocks process which can be used by threat actors to proxy connections through the Tor network to exfiltrate data or download further payloads. The usage of this process should always be considered suspicious.
query: |
    title: Tor Proxy Activity via torsocks Process
    id: 6f43f7c9-e2e6-480c-a21a-aeea7e525f47
    status: experimental
    description: |
      This rule looks for the usage of the torsocks process which can be used by threat actors to proxy connections through the Tor network to exfiltrate data or download further payloads. The usage of this process should always be considered suspicious.
    references:
      - https://www.trendmicro.com/en_us/research/25/f/tor-enabled-docker-exploit.html
      - https://media.defcon.org/DEF%20CON%2032/DEF%20CON%2032%20presentations/DEF%20CON%2032%20-%20Vangelis%20Stykas%20-%20Behind%20Enemy%20Lines%20Engaging%20and%20disrupting%20Ransomware%20Web%20Panels.pdf
    author: Tim Peck
    tags:
      - attack.command_and_control
      - attack.T1090.003
      - threat.xmrig
      - threat.docker
    date: 2025/07/23
    logsource:
      product: linux
      category: process_creation
    detection:
      selection:
        Image|endswith:
          - '/torsocks'
      condition: selection
    level: high
    falsepositives:
      - Legitimate usage by security or anonymization utilities
query_type: sigma
severity: medium
tactics:
    - TA0011
techniques:
    - T1090.003
tags:
    - attack.command_and_control
    - attack.T1090.003
    - threat.xmrig
    - threat.docker
author: Tim Peck
version: "1"
references:
    - https://www.trendmicro.com/en_us/research/25/f/tor-enabled-docker-exploit.html
    - https://media.defcon.org/DEF%20CON%2032/DEF%20CON%2032%20presentations/DEF%20CON%2032%20-%20Vangelis%20Stykas%20-%20Behind%20Enemy%20Lines%20Engaging%20and%20disrupting%20Ransomware%20Web%20Panels.pdf
data_sources:
    - process_creation
    - linux
