id: e8270c0d-d77f-4e90-8dee-01c370596c7e
name: Firewall PaloAlto - Possible Impacket Tool Detection
description: |
    Detects logs from Palo Alto firewalls indicating possible Impacket tool traffic detection,  using categories like spyware or vulnerability and matching specific policy names.
query: |
    title: Firewall PaloAlto - Possible Impacket Tool Detection
    status: experimental
    description: >
      Detects logs from Palo Alto firewalls indicating possible Impacket tool
      traffic detection,  using categories like spyware or vulnerability and
      matching specific policy names.
    author: SaitoHiruga
    date: 2025-01-25T00:00:00.000Z
    logsource:
      category: firewall
    detection:
      selection:
        device_type: paloaltonetworks
        category:
          - spyware
          - vulnerability
        policy_name|contains:
          - Possible Impacket Tool Traffic
          - Impacket Traffic
      condition: selection
    fields:
      - device_type
      - category
      - policy_name
    falsepositives:
      - Legitimate use of tools triggering the same patterns.
    level: low
query_type: sigma
severity: medium
techniques:
    - T1021
author: SaitoHiruga
version: "1"
data_sources:
    - firewall
