id: eb367bb9-5710-40b0-882e-7287cbbba239
name: Microsoft Defender threat exclusion added (native)
description: Detects scenarios where a threat exclusion is added to the antivirus in order to bypass its detection capacities
query: |-
    title: Microsoft Defender threat exclusion added (native)
    description: Detects scenarios where a threat exclusion is added to the antivirus in order to bypass its detection capacities
    references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-antivirus/troubleshoot-microsoft-defender-antivirus
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.001-Impair%20Defenses-Disable%20or%20Modify%20tool
    tags:
    - attack.defense_evasion
    - attack.t1562.001
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: windefend
    detection:
      selection:
        EventID: 5007
        New Value|startswith: 'HKLM\SOFTWARE\Microsoft\Windows Defender\Exclusions\'
      condition: selection
    falsepositives:
    - Unknown
    level: high
query_type: sigma
severity: high
tactics:
    - TA0005
techniques:
    - T1562.001
tags:
    - attack.defense_evasion
    - attack.t1562.001
author: mdecrevoisier
version: "1"
references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-antivirus/troubleshoot-microsoft-defender-antivirus
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.001-Impair%20Defenses-Disable%20or%20Modify%20tool
data_sources:
    - windows
    - windefend
