id: ec04ddf8-affc-4890-9a96-a3d37b0d5365
name: Massive remote schedule task creation via named pipes (CrackMapExec with ATexec)
description: Detects scenarios where an attacker remotely creates a scheduled task on multiple hosts over named pipes to execute commands or elevate privileges.
query: |-
    title: Massive remote schedule task creation via named pipes (CrackMapExec with ATexec)
    description: Detects scenarios where an attacker remotely creates a scheduled task on multiple hosts over named pipes to execute commands or elevate privileges.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0002-Execution/T1053.005-Scheduled%20Task
    - https://github.com/SecureAuthCorp/impacket/blob/master/examples/atexec.py
    - https://u0041.co/blog/post/1
    - https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html
    tags:
    - attack.execution
    - attack.t1053.005
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      service: security
    detection:
      selection:
        EventID: 5145
        ShareName: '\\*\IPC$'
        RelativeTargetName: atsvc
        AccessList|contains: '%%4417' # WriteData
      condition: selection | count(Computer) by IpAddress > 20
    falsepositives:
    - Administrator activity, backup solutions
    level: medium
query_type: sigma
severity: medium
tactics:
    - TA0002
    - TA0003
    - TA0004
techniques:
    - T1053.005
tags:
    - attack.execution
    - attack.t1053.005
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0002-Execution/T1053.005-Scheduled%20Task
    - https://github.com/SecureAuthCorp/impacket/blob/master/examples/atexec.py
    - https://u0041.co/blog/post/1
    - https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html
data_sources:
    - windows
    - security
