id: ec64b13c-d988-42e0-80f4-68748900d540
name: Password policy discovery via commandline
description: Detects scenarios where an attacker attempts to enumerate the password policy via commandline.
query: |-
    title: Password policy discovery via commandline
    description: Detects scenarios where an attacker attempts to enumerate the password policy via commandline.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1201-Password%20Policy%20Discovery
    - https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
    - https://attack.mitre.org/software/S0039/
    tags:
    - attack.discovery
    - attack.t1201
    author: mdecrevoisier
    logsource:
      product: windows
      category: process_creation
    detection:
      selection: # Full command example: 'net accounts [/domain]'
        NewProcessName|endswith:
          - \net1.exe
          - \net.exe
        CommandLine|contains|all:
          - accounts
          - /do # refers to '/domain'
      condition: selection
    falsepositives:
    - Pentest
    level: high
query_type: sigma
severity: high
tactics:
    - TA0007
techniques:
    - T1201
tags:
    - attack.discovery
    - attack.t1201
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1201-Password%20Policy%20Discovery
    - https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
    - https://attack.mitre.org/software/S0039/
data_sources:
    - process_creation
    - windows
