id: ef47e87d-af8f-4457-9743-0c7cd439fee5
name: Sticky key sethc command for replacement by CMD
description: Detects scenarios where an attacker attempts to replace the original sethc.exe file by cmd.exe.
query: |-
    title: Sticky key sethc command for replacement by CMD
    description: Detects scenarios where an attacker attempts to replace the original sethc.exe file by cmd.exe.
    references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0004-Privilege%20Escalation/T1546-Image%20File%20Execution%20Options%20Injection
    - https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/
    - https://www.mandiant.com/resources/apt29-domain-frontin
    - https://www.clearskysec.com/wp-content/uploads/2020/02/ClearSky-Fox-Kitten-Campaign-v1.pdf
    tags:
    - attack.privilege_escalation
    - attack.t1546.008
    author: mdecrevoisier
    status: experimental
    logsource:
      product: windows
      category: process_creation
    detection:
      selection:
        EventID: 4688
        CommandLine|contains|all: # full command 'copy /y C:\windows\system32\cmd.exe C:\windows\system32\sethc.exe'
          - copy
          - cmd.exe
          - sethc.exe
      condition: selection
    falsepositives:
    - None
    level: high
query_type: sigma
severity: high
tactics:
    - TA0004
    - TA0003
techniques:
    - T1546.008
    - T1546
tags:
    - attack.privilege_escalation
    - attack.t1546.008
author: mdecrevoisier
version: "1"
references:
    - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0004-Privilege%20Escalation/T1546-Image%20File%20Execution%20Options%20Injection
    - https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/
    - https://www.mandiant.com/resources/apt29-domain-frontin
    - https://www.clearskysec.com/wp-content/uploads/2020/02/ClearSky-Fox-Kitten-Campaign-v1.pdf
data_sources:
    - process_creation
    - windows
