id: f113e87b-54f2-456b-96cf-cf7204f304fe
name: TamperedChef - PDF Editor.exe & OneStart  - landing page domain
description: Detects DNS queries to landing pages associated with the PDF Editor.exe & OneStart.
query: |
    title: "TamperedChef - PDF Editor.exe & OneStart  - landing page domain"
    id: f317c1de-2d5c-41d4-8e72-66b1056373ff
    status: experimental
    description: "Detects DNS queries to landing pages associated with the PDF
      Editor.exe & OneStart."
    references:
      - https://www.virustotal.com/gui/collection/7c61b355881b6f7c185c435f6cc501208128f9f1682a354510994684313c25ba
    author: Emil Stahl
    date: 2025-08-25
    tags:
      - attack.adware
    logsource:
      category: dns # product: zeek # Uncomment and adapt for specific products if needed
    detection:
      selection:
        # Detects DNS queries for domains associated with One-Start adware
        query|endswith:
          - 'agipdf.com'
          - 'allaroundgamers.com'
          - 'allconvertpdf.com'
          - 'allgamershere.com'
          - 'allmanualspdf.com'
          - 'allpdfconvert.com'
          - 'allpdfplus.com'
          - 'allpdfpro.com'
          - 'apdft.com'
          - 'appsuites.ai'
          - 'atozmanual.com'
          - 'boothgamer.com'
          - 'businesspdf.com'
          - 'classygamer.com'
          - 'click4pdf.com'
          - 'clickconvertio.com'
          - 'connectnowgamer.com'
          - 'converteasypdf.com'
          - 'convertfastpdf.com'
          - 'convertpdfplus.com'
          - 'cosmicplayerzone.com'
          - 'digitalgamerzone.com'
          - 'docpdfzone.com'
          - 'dropconvert.com'
          - 'easyconvertpdf.com'
          - 'easydirectpdf.com'
          - 'easyformsearch.com'
          - 'easygetforms.com'
          - 'easygetpdf.com'
          - 'easyonestartpdf.com'
          - 'easyopenpdf.com'
          - 'easypdfbox.com'
          - 'easypdfmanuals.com'
          - 'easypdftool.com'
          - 'easyquickmanuals.com'
          - 'easyquickpdf.com'
          - 'easysearchmanuals.com'
          - 'easysmartpdf.com'
          - 'easyviewpdf.com'
          - 'evergreengamer.com'
          - 'fastconvertpdf.com'
          - 'fastonestartpdf.com'
          - 'fileconverterdownload.com'
          - 'findallmanuals.com'
          - 'findthemanual.com'
          - 'forms-guru.com'
          - 'foundpdf.com'
          - 'freegamerzone.com'
          - 'freegetpdf.com'
          - 'fullpdf.com'
          - 'fungamersonline.com'
          - 'gameongamer.com'
          - 'gamerproone.com'
          - 'gamertimespro.com'
          - 'gamerzonepc.com'
          - 'getformonline.com'
          - 'getmanualsfinder.com'
          - 'getonestart.co'
          - 'getonestartpdf.com'
          - 'getpdflive.com'
          - 'getpdfpro.com'
          - 'getpdfquick.com'
          - 'getsearchmanuals.com'
          - 'goeasypdf.com'
          - 'gogetpdf.com'
          - 'gopdfhub.com'
          - 'gopdfmanuals.com'
          - 'gpt-pdf.com'
          - 'itpdf.com'
          - 'justconvertpdf.com'
          - 'justfindmanuals.com'
          - 'justopenpdf.com'
          - 'justpdflab.com'
          - 'justviewpdf.com'
          - 'launchpdfplus.com'
          - 'levelward.com'
          - 'lifetimegamer.com'
          - 'ltdpdf.com'
          - 'lucentgamers.com'
          - 'manualbookhub.com'
          - 'manualfinder.net'
          - 'manualsappsuite.com'
          - 'manualsbyonestart.com'
          - 'manualsfc.com'
          - 'manualsonestart.com'
          - 'manualsview.com'
          - 'manualsviewer.net'
          - 'mixgamersworld.com'
          - 'morethanmanuals.com'
          - 'myeasypdf.com'
          - 'mygamergrounds.com'
          - 'mypdflab.com'
          - 'mypdfonestart.com'
          - 'oneconvertpdf.com'
          - 'onestartbrowser.com'
          - 'onestartpdf.com'
          - 'onestartpdfdirect.com'
          - 'onestartpdfplus.com'
          - 'onestartprint.com'
          - 'openpdfnow.com'
          - 'pdf-central.com'
          - 'pdf-kiosk.com'
          - 'pdf-wizard.net'
          - 'pdf-working.com'
          - 'pdfadmin.com'
          - 'pdfappsuite.com'
          - 'pdfartisan.com'
          - 'pdfbyappsuite.com'
          - 'pdfconvertereasy.com'
          - 'pdfconvertgroup.com'
          - 'pdfconvhub.com'
          - 'pdfdoccentral.com'
          - 'pdfdocconnect.com'
          - 'pdfdochub.com'
          - 'pdfeasyconvertkits.com'
          - 'pdfeasytool.com'
          - 'pdfeditorplus.com'
          - 'pdffacts.com'
          - 'pdffastconvert.com'
          - 'pdffilehub.com'
          - 'pdfgj.com'
          - 'pdfguides.com'
          - 'pdfguruhub.com'
          - 'pdfgurupro.com'
          - 'pdfhubguru.com'
          - 'pdfhubpro.com'
          - 'pdfhubspot.com'
          - 'pdfhubtoday.com'
          - 'pdfhubweb.com'
          - 'pdfideas.com'
          - 'pdflaunch.com'
          - 'pdfmeta.com'
          - 'pdfobia.com'
          - 'pdfonestart.ai'
          - 'pdfonestart.com'
          - 'pdfonestarthub.com'
          - 'pdfonestartlive.com'
          - 'pdfonestarttoday.com'
          - 'pdfopia.com'
          - 'pdforsmartminds.com'
          - 'pdfpclab.com'
          - 'pdfplusconvert.com'
          - 'pdfprosuite.com'
          - 'pdfprotool.com'
          - 'pdfquickconverts.com'
          - 'pdfquickpro.com'
          - 'pdfreader.live'
          - 'pdfreplace.com'
          - 'pdfscraper.com'
          - 'pdfsmartkit.com'
          - 'pdfsmartlive.com'
          - 'pdfsmartonline.com'
          - 'pdfsmartpro.com'
          - 'pdfsmartsolution.com'
          - 'pdftoolapp.com'
          - 'pdftoolconvert.com'
          - 'pdftoolplus.com'
          - 'pdftoolpro.com'
          - 'pdftoolwin.com'
          - 'pdftraining.com'
          - 'pdfts.com'
          - 'pdfviewplus.com'
          - 'pdfworker.com'
          - 'pdfzonepro.com'
          - 'platinumgamerz.com'
          - 'print-recipes.com'
          - 'printappsuite.com'
          - 'printeduniverse.com'
          - 'printwithonestart.com'
          - 'proeasypdf.com'
          - 'promanualsfinder.com'
          - 'proonestarthub.com'
          - 'proonestartpdf.com'
          - 'propdfhub.com'
          - 'proprintperformance.com'
          - 'quickconvertpdf.com'
          - 'quickfastpdf.com'
          - 'quickgamerpro.com'
          - 'quickgetforms.com'
          - 'quickgetmanuals.com'
          - 'quickgetpdf.com'
          - 'quickmanualshub.com'
          - 'quickmanualspro.com'
          - 'quickpdfeditor.com'
          - 'quickpdfmanuals.com'
          - 'quickpdfnow.com'
          - 'quickpdfonestart.com'
          - 'quicksmartpdf.com'
          - 'scholarpdf.com'
          - 'searchformsfinder.com'
          - 'searchmanualsnow.com'
          - 'smartconvertpdf.com'
          - 'smarteasypdf.com'
          - 'smartmanualspdf.com'
          - 'smartonestartpdf.com'
          - 'smartopenpdf.com'
          - 'smartpdflive.com'
          - 'smartpdfpro.com'
          - 'smartpdftool.com'
          - 'smartviewpdf.com'
          - 'supersocialgamers.com'
          - 'theflashgamers.com'
          - 'thegreygamers.com'
          - 'themagicgamers.com'
          - 'thepdfbox.com'
          - 'thepdfonestart.com'
          - 'thestargamers.com'
          - 'thevirtualgamers.com'
          - 'totalpdfconvert.com'
          - 'typdf.com'
          - 'videoconverthd.com'
          - 'viewpdfonestart.com'
          - 'viewpdfpro.com'
          - 'viewpdftools.com'
          - 'webpdfconvert.com'
          - 'worldbestgamers.com'
          - 'yourpdfeditor.com'
          - 'yourpdfhub.com'
      condition: selection
    falsepositives:
      - Legitimate use of the applications, although they are generally considered
        Potentially Unwanted Programs (PUPs).
    level: high
query_type: sigma
severity: high
tactics:
    - TA0009
techniques:
    - T1560
tags:
    - attack.adware
author: Emil Stahl
version: "1"
references:
    - https://www.virustotal.com/gui/collection/7c61b355881b6f7c185c435f6cc501208128f9f1682a354510994684313c25ba
data_sources:
    - dns
