id: f81d9b89-2128-49ba-9288-427ec3b1dd49
name: Powershell load assembly from internet
description: Powershell load assembly from internet
query: |
    title: Powershell load assembly from internet
    status: experimental
    description: Powershell load assembly from internet
    author: Joe Security
    date: 2020-02-19
    id: 200057
    threatname:
    behaviorgroup: 1
    classification: 8
    mitreattack:

    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine:
                - '*powershell*[reflection.assembly]::load((new-object net.webclient).downloaddata(*'
        condition: selection
    level: critical
query_type: sigma
severity: critical
author: Joe Security
version: "1"
data_sources:
    - process_creation
    - windows
